{
  "track": {
    "name": "Mood (feat. iann dior)",
    "url": "https://www.last.fm/music/24kGoldn/_/Mood+(feat.+iann+dior)",
    "duration": "140000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "687560",
    "playcount": "7417364",
    "artist": {
      "name": "24kGoldn",
      "mbid": "0fe5df51-ba65-4784-ba85-7d024a107a8a",
      "url": "https://www.last.fm/music/24kGoldn"
    },
    "album": {
      "artist": "Various Artists",
      "title": "Now That's What I Call Music Vol. 83",
      "url": "https://www.last.fm/music/Various+Artists/Now+That%27s+What+I+Call+Music+Vol.+83",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/6406a634db64c91b49dff04b1b83ebbf.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/6406a634db64c91b49dff04b1b83ebbf.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/6406a634db64c91b49dff04b1b83ebbf.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/6406a634db64c91b49dff04b1b83ebbf.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "2020",
          "url": "https://www.last.fm/tag/2020"
        },
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "iann dior",
          "url": "https://www.last.fm/tag/iann+dior"
        },
        {
          "name": "24kGoldn",
          "url": "https://www.last.fm/tag/24kGoldn"
        },
        {
          "name": "2020s",
          "url": "https://www.last.fm/tag/2020s"
        }
      ]
    },
    "wiki": {
      "published": "31 Oct 2020, 05:56",
      "summary": "\"Mood\" is a song by American rapper and singer 24kGoldn featuring Puerto Rican-born American rapper and singer Iann Dior. Shortly after its release on July 24, 2020, it garnered popularity on the video-sharing app TikTok, and became a chart success worldwide, peaking at number one in the United States, the United Kingdom and several other countries. The pop rock-tinged \"summer\" track and its accompanying video finds the rappers detailing their toxic relationships. <a href=\"http://www.last.fm/music/24kGoldn/_/Mood+(feat.+iann+dior)\">Read more on Last.fm</a>.",
      "content": "\"Mood\" is a song by American rapper and singer 24kGoldn featuring Puerto Rican-born American rapper and singer Iann Dior. Shortly after its release on July 24, 2020, it garnered popularity on the video-sharing app TikTok, and became a chart success worldwide, peaking at number one in the United States, the United Kingdom and several other countries. The pop rock-tinged \"summer\" track and its accompanying video finds the rappers detailing their toxic relationships. The song became the first song to top the Hot 100, Hot Rock & Alternative Songs, Hot Alternative Songs, and Hot Rap Songs charts in the same week.\n\n24kGoldn had teased the song continuously on his Instagram, and on July 19, 2020, he confirmed the song's title and release date in a video alongside Iann Dior. By August 13, it was used in over 13,000 videos on TikTok.\n\nDescribed by Vicky Inoyo of Earmilk as a love-centered song that provides \"a youthful feel with modern-day pop twists\", the lyrics detail how it feels to be in a toxic relationship. The rappers deliver \"melodic\" croons about their girlfriends who are always in a \"mood\". HotNewHipHop's Alexander Cole called the track \"perfect for summer\", and said the song's title \"certainly fits the vibe as we get a very summer-inspired beat\".\n\nThe song's official video, directed by Sebastian Sdaigui, was released on August 5, 2020. It showcases the highs and lows of young love.\n\nThe video begins with a brief shot of a spotlight shining on 24kGoldn as he sits on a set with simulated decorations across a large field of sunflowers. The visual then cuts to a contrasting scene as Dior is seen sitting on a bed in a bland room. Both of them are then seen looking down in a sad state, echoing the song's lyrics. Faux behind the scenes clips of the sunflower set is shown, with the flowers now overgrowing and climbing a wall, along with \"an abundance of beautiful girls\" who are seemingly affected by animated halos that alter their moods, once again reflecting the lyrics. Both rappers dance, while singing their verses, with interjecting scenes of low shots that appears to look as though they are standing on the camera with lightening and an overcast sky special effects. The visual eventually cuts back to Dior in the original dreary room as he starts his verse, this time having fun with a woman. In between this, another version of Dior is standing in front of a greenscreen, showing older moments in his relationship with a \"distressed\" look on his face as he sings. Other scenes playing out behind him show the relationship's issues, explaining why he is worried about the circumstances. Finally, the video moves to 24kGoldn's verse as he is in a car with an attractive woman; initially they get along, however he receives a text from someone else that upsets the woman, causing her to leave the car. She is happy again after he puts the phone away, but grows angry when he tries to sneakily send a text back. The woman rapidly picks up a baseball bat, which ultimately she does not use, but makes 24 concerned for a brief moment as the video concludes.\n\nThe song reached number one on the US Billboard Hot 100 in its tenth week, becoming both 24kGoldn's and Dior's highest peaking song on the chart. It also topped the Billboard's Hot Alternative Songs and Hot Rock & Alternative Songs charts.\n\nOutside of the United States, \"Mood\" has topped the charts in Australia, Austria, Canada, Denmark, Germany, New Zealand, Norway, the Republic of Ireland, Sweden and the United Kingdom.\n\n <a href=\"http://www.last.fm/music/24kGoldn/_/Mood+(feat.+iann+dior)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}