{
  "track": {
    "name": "Envolver",
    "mbid": "7a80b244-3163-46f5-beea-6b048581b7d8",
    "url": "https://www.last.fm/music/Anitta/_/Envolver",
    "duration": "193000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "380146",
    "playcount": "8344947",
    "artist": {
      "name": "Anitta",
      "mbid": "d606b860-cc03-4959-a3fd-3a24bccf2560",
      "url": "https://www.last.fm/music/Anitta"
    },
    "album": {
      "artist": "Anitta",
      "title": "Envolver",
      "url": "https://www.last.fm/music/Anitta/Envolver",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/fe865301ed3c0ce9f84fad00729b5fce.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/fe865301ed3c0ce9f84fad00729b5fce.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/fe865301ed3c0ce9f84fad00729b5fce.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/fe865301ed3c0ce9f84fad00729b5fce.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "14 Nov 2021, 03:48",
      "summary": "\"Envolver\" is a song by Brazilian diva Anitta from her fifth studio album  Versions Of Me. It was released on November 11, 2021, through Warner Music Latino.\n\n\"Envolver\" is written by Anitta  herself with co-writers Cristian Andrés Salazar, Julio Manuel González and José Cruz with Freddy Montalvo, who also produced the song \n\nThe lyrics show that they are not looking for anything serious, but only temporary pleasure. The chorus warns the romantic interest not to get too attached and \"envolver\" (wrap up) in the relationship <a href=\"http://www.last.fm/music/Anitta/_/Envolver\">Read more on Last.fm</a>.",
      "content": "\"Envolver\" is a song by Brazilian diva Anitta from her fifth studio album  Versions Of Me. It was released on November 11, 2021, through Warner Music Latino.\n\n\"Envolver\" is written by Anitta  herself with co-writers Cristian Andrés Salazar, Julio Manuel González and José Cruz with Freddy Montalvo, who also produced the song \n\nThe lyrics show that they are not looking for anything serious, but only temporary pleasure. The chorus warns the romantic interest not to get too attached and \"envolver\" (wrap up) in the relationship, as the narrator knows that they will eventually return. The song encourages a carefree attitude towards sex and relationships with lyrics such as \"Sexo y alcohol, lo que pase aquí se va a quedar\" (Sex and alcohol, what happens here will stay). The bridge depicts a willingness to engage in intimate acts and a desire for the partner to remember their time together.\n\nAn official music video, directed by Anitta  herself, was published on November 12 2021 through her YouTube channel, which amassed over 670 MILLION views as of March 8th 2024. It’s the most viewed video by a female Brazilian act.\n\nThe music video went viral in March 2022, after it gained popularity on TikTok, where its \"booty-grinding\" dance became one of the most replicated. \n\nAnitta became the first female Latin act to reach the top spot on Spotify’s Global Chart as \"Envolver\" went on to peak with 7.2 MILLION streams in a single day. It also broke the record for most one-day streams in Brazil with over 4.5 million plays, a record that was previously held by her own \"Vai Malandra\" with 2.1 MILLION streams. \n\nAdditionally it also became the first song ever to place inside the top 50 of all Latin countries on Spotify, reach the top spot on Billboard’s Global 200 Excl. US chart & to win a MTV Video Music Award.\n\nDue to the success of the song in the United States Anitta got nominated for the “Best New Artist”Award at the GRAMMY’s  making her the first Brazilian artist to get nominated in “The Big 4” categories in over 50 years. <a href=\"http://www.last.fm/music/Anitta/_/Envolver\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}