{
  "track": {
    "name": "Problem",
    "url": "https://www.last.fm/music/Ariana+Grande/_/Problem",
    "duration": "193000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1194246",
    "playcount": "9245364",
    "artist": {
      "name": "Ariana Grande",
      "mbid": "f4fdbb4c-e4b7-47a0-b83b-d91bbfcfa387",
      "url": "https://www.last.fm/music/Ariana+Grande"
    },
    "album": {
      "artist": "Ariana Grande",
      "title": "My Everything (Deluxe)",
      "url": "https://www.last.fm/music/Ariana+Grande/My+Everything+(Deluxe)",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/b68854212b18163a584df683cb7c0fe0.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/b68854212b18163a584df683cb7c0fe0.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/b68854212b18163a584df683cb7c0fe0.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/b68854212b18163a584df683cb7c0fe0.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "2014",
          "url": "https://www.last.fm/tag/2014"
        },
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "Iggy Azalea",
          "url": "https://www.last.fm/tag/Iggy+Azalea"
        },
        {
          "name": "female vocalists",
          "url": "https://www.last.fm/tag/female+vocalists"
        },
        {
          "name": "summer 2014",
          "url": "https://www.last.fm/tag/summer+2014"
        }
      ]
    },
    "wiki": {
      "published": "08 May 2022, 19:32",
      "summary": "\"Problem\" is a song by American singer Ariana Grande, featuring Australian rapper Iggy Azalea. It was written by both alongside Savan Kotecha, Ilya and Max Martin, being produced by the latter two with Shellback, with Peter Carlsson serving as a vocal producer. The song was released by Republic Records on April 28, 2014, as the lead single from Grande's second studio album My Everything (2014). \"Problem\" is an uptempo dance-pop song with influences of R&B music, which comprises a melody based on drums, saxophone loops, and trumpets. <a href=\"http://www.last.fm/music/Ariana+Grande/_/Problem\">Read more on Last.fm</a>.",
      "content": "\"Problem\" is a song by American singer Ariana Grande, featuring Australian rapper Iggy Azalea. It was written by both alongside Savan Kotecha, Ilya and Max Martin, being produced by the latter two with Shellback, with Peter Carlsson serving as a vocal producer. The song was released by Republic Records on April 28, 2014, as the lead single from Grande's second studio album My Everything (2014). \"Problem\" is an uptempo dance-pop song with influences of R&B music, which comprises a melody based on drums, saxophone loops, and trumpets. The chorus features uncredited background vocals from American hip hop artist Big Sean. Lyrically, Grande has stated that the song is about \"the feeling of being absolutely terrified to re-approach a relationship that's gone sour – but you want to more than anything.\"\n\nThe song debuted at number three on the Billboard Hot 100 selling 438,000 copies in its first week on sale, earning Grande her biggest digital song sales week ever. The song later peaked at number two, surpassing \"The Way\" as her highest-charting single in the United States at the time. It also became Azalea's second-highest-charting single in the US, after her own single \"Fancy\". \"Problem\" remained in the top ten of the Hot 100 for the first sixteen weeks of its chart run, making its number three debut on May 7, 2014, and dropping out of the top ten on August 27, 2014. It topped the US Mainstream Top 40 and Rhythmic charts. Internationally, the single debuted at the top of the charts in Ireland, New Zealand, Scotland and the United Kingdom, while peaking within the top ten of the charts in most other territories, including Australia, Canada, Mexico, Sweden, Denmark, and Greece. \"Problem\" became the first song to top the UK Singles chart based on both sales and streaming.\n\nTo promote the song, Grande performed it first at the 2014 Radio Disney Music Awards, followed by the 2014 iHeartRadio Music Awards, on The Ellen DeGeneres Show and at the 2014 Billboard Music Awards. The song's accompanying music video was directed by Nev Todorovic and premiered on Vevo on May 30, 2014. It won \"Best Pop Video\" at the 2014 MTV Video Music Awards and has been viewed more than 1.3 billion times as of September 2021. The song itself won \"Best Song\" at the 2014 MTV Europe Music Awards.\n\nAs of 2018, the single has sold 3.7 million copies in the US and has been certified sextuple platinum by the Recording Industry Association of America (RIAA) in March 2016. It ultimately reached combined sales and track-equivalent streams of 9 million units worldwide,[1] becoming one of the best-selling singles of all time. <a href=\"http://www.last.fm/music/Ariana+Grande/_/Problem\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}