{
  "track": {
    "name": "Virtual Angel",
    "mbid": "35c981bb-e4d5-4973-8b18-ae6edb29f03e",
    "url": "https://www.last.fm/music/ARTMS/_/Virtual+Angel",
    "duration": "173000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "148815",
    "playcount": "4843084",
    "artist": {
      "name": "ARTMS",
      "mbid": "ae98b8c4-d8fc-4ff9-9b4e-4bc1fd8575d1",
      "url": "https://www.last.fm/music/ARTMS"
    },
    "album": {
      "artist": "ARTMS",
      "title": "<Dall>",
      "url": "https://www.last.fm/music/ARTMS/%3CDall%3E",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/75e1ef87a42286d9337b603e60ec3c2b.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/75e1ef87a42286d9337b603e60ec3c2b.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/75e1ef87a42286d9337b603e60ec3c2b.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/75e1ef87a42286d9337b603e60ec3c2b.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "k-pop",
          "url": "https://www.last.fm/tag/k-pop"
        },
        {
          "name": "dance-pop",
          "url": "https://www.last.fm/tag/dance-pop"
        },
        {
          "name": "artms",
          "url": "https://www.last.fm/tag/artms"
        },
        {
          "name": "Loona",
          "url": "https://www.last.fm/tag/Loona"
        },
        {
          "name": "heejin da duda",
          "url": "https://www.last.fm/tag/heejin+da+duda"
        }
      ]
    },
    "wiki": {
      "published": "31 May 2024, 09:54",
      "summary": "ARTMS debuted with their single \"Virtual Angel\" on May 31, 2024, as part of their first full-length album \"<DALL>\" (an acronym for \"Devine All Love & Live\")[1][2]. The song blends synth-pop and Eurodance genres, featuring a Eurodance backdrop with Y2K influences and an ethereal atmosphere reminiscent of church bells.\n\nThe track explores themes of digital identity and the relationship between virtual and real-world experiences. Its concept poses an intriguing question about the nature of idol-fan relationships in the digital age <a href=\"http://www.last.fm/music/ARTMS/_/Virtual+Angel\">Read more on Last.fm</a>.",
      "content": "ARTMS debuted with their single \"Virtual Angel\" on May 31, 2024, as part of their first full-length album \"<DALL>\" (an acronym for \"Devine All Love & Live\")[1][2]. The song blends synth-pop and Eurodance genres, featuring a Eurodance backdrop with Y2K influences and an ethereal atmosphere reminiscent of church bells.\n\nThe track explores themes of digital identity and the relationship between virtual and real-world experiences. Its concept poses an intriguing question about the nature of idol-fan relationships in the digital age, suggesting that emotional connections formed through screens can be as genuine as physical interactions[2].\n\n\"Virtual Angel\" underwent a transformation from its original title \"Eden\" to better align with ARTMS's vision. The lyrics address themes of support, heartbreak, and resilience, with the refrain metaphorically speaking of being there when one's wings break[1].\n\nThe music video features the five ARTMS members - HaSeul, JinSoul, Kim Lip, Choerry, and HeeJin - as \"virtual angels\" existing in a digital realm. It also shows five other individuals watching the group, holding sword-like props and wearing angel wings[2].\n\nCritics have praised the song for its sophisticated production and lyrical depth. The track's innovative concept and polished production have positioned ARTMS as a noteworthy act in the K-pop genre, showcasing their potential to influence the future direction of K-pop music[1].\n\n\"Virtual Angel\" serves as a strong debut for ARTMS, encapsulating their artistic vision and setting a high standard for their future releases. The group's exploration of virtual and real-world themes in their music reflects a forward-thinking approach that resonates with a generation increasingly immersed in digital experiences[3]. <a href=\"http://www.last.fm/music/ARTMS/_/Virtual+Angel\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}