{
  "track": {
    "name": "Pompeii",
    "mbid": "9833ffbd-a387-415f-baab-dedd322529a9",
    "url": "https://www.last.fm/music/Bastille/_/Pompeii",
    "duration": "214000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1666273",
    "playcount": "16814814",
    "artist": {
      "name": "Bastille",
      "mbid": "7808accb-6395-4b25-858c-678bbb73896b",
      "url": "https://www.last.fm/music/Bastille"
    },
    "album": {
      "artist": "Bastille",
      "title": "All This Bad Blood",
      "url": "https://www.last.fm/music/Bastille/All+This+Bad+Blood",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/59748b068339aceb61cfc90339dfb0ed.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/59748b068339aceb61cfc90339dfb0ed.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/59748b068339aceb61cfc90339dfb0ed.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/59748b068339aceb61cfc90339dfb0ed.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "indie",
          "url": "https://www.last.fm/tag/indie"
        },
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "british",
          "url": "https://www.last.fm/tag/british"
        },
        {
          "name": "alternative",
          "url": "https://www.last.fm/tag/alternative"
        },
        {
          "name": "2013",
          "url": "https://www.last.fm/tag/2013"
        }
      ]
    },
    "wiki": {
      "published": "23 Jan 2013, 16:52",
      "summary": "\"Pompeii\" is a song by British pop rock band Bastille. It is the fourth single from their debut studio album, Bad Blood, and was released on 11 January 2013. The song's title and lyrics refer to the Roman town of the same name that was destroyed and buried in the eruption of Mount Vesuvius in AD 79.\n\n\"Pompeii\" became the band's breakthrough hit, peaking at number two on the UK Singles Chart and became the eleventh best-selling song that year and, until June 2014, was the country's most streamed single of all time. <a href=\"http://www.last.fm/music/Bastille/_/Pompeii\">Read more on Last.fm</a>.",
      "content": "\"Pompeii\" is a song by British pop rock band Bastille. It is the fourth single from their debut studio album, Bad Blood, and was released on 11 January 2013. The song's title and lyrics refer to the Roman town of the same name that was destroyed and buried in the eruption of Mount Vesuvius in AD 79.\n\n\"Pompeii\" became the band's breakthrough hit, peaking at number two on the UK Singles Chart and became the eleventh best-selling song that year and, until June 2014, was the country's most streamed single of all time. It was also successful worldwide, reaching the top ten in fifteen countries, including the United States where it peaked at number five on the Billboard Hot 100, becoming Bastille's most successful single to date, until \"Happier\" reached number two on both the UK and US charts in October 2018 and February 2019 respectively.\n\nThe song was nominated for British Single of the Year at the 2014 BRIT Awards. A mashup of the song with Rudimental and Ella Eyre's \"Waiting All Night\" was performed live by Rudimental, Eyre and Bastille at the aforementioned ceremony, which reached number 21 in the UK.\n\nIt was also performed at the 2014 iHeartRadio Music Awards, where it was nominated for Alternative Rock Song of the Year.\n\nAccording to Dan Smith, the song is written as a conversation between two victims of the eruption of Mount Vesuvius, stating in an interview, \"I was reading a book that had some picture of the people who got caught up in the volcanic eruption. And it's just such a kind of dark powerful image, and it got me thinking about how boring it must have been emotionally after the event. To be sort of stuck in that same position for hundreds and hundreds of years. So, the song is sort of an imaginary conversation between these two people who are stuck next to each other in their sort of tragic death pose.\"\n\nThe official music video was filmed in Los Angeles and Palm Springs, California. It was directed by Jesse John Jenkins and produced by Tova Dann. The video was first released onto YouTube on 20 January 2013 at a total length of three minutes and fifty-two seconds. It currently has 728 million views, the highest out of all the band's songs.\n\nThe video follows Bastille frontman Dan Smith, as he wanders about an empty-looking Los Angeles, before realizing the few people around all have unnatural vacant black eyes. He steals a car and drives into the desert to escape them, but the car breaks down and he soon realizes he's been infected as well. He climbs a mountain and looks out at the view, before turning around to reveal his own eyes have turned black as well. The story is an allegory for the eruption of Mount Vesuvius in Pompeii.\n\nA popular dance remix of the track by Audien was nominated for Best Remixed Recording, Non-Classic at the 57th Annual Grammy Awards. It lost to Tiësto's remix of John Legend's \"All of Me\".\n\nThe song reached number one in Scotland and Ireland, and peaked at number two in Italy and the UK. Previously, the single also held the record (now belonging to Clean Bandit's \"Rather Be\") for the longest time at number one on the Official Streaming Chart, remaining at the peak for seven weeks, and was the second most streamed track of 2013 in the UK. \"Pompeii\" spent the anniversary of its debut at number 30, having re-entered the top 40 the previous week following a live performance (a mash-up with Rudimental's \"Waiting All Night\") at the 2014 BRIT Awards. It spent a record 92 consecutive weeks in the top 100 (since matched by \"Happy\" by Pharrell Williams). With over 26 million streams by June 2014, \"Pompeii\" became the most streamed song of all time in the UK at that time and has sold 895,000 copies there. The B-side track \"Poet\" has also managed to chart in the UK at #121.\n\nThe song reached number one on the Billboard Alternative Songs chart in October 2013 and began climbing the Billboard Hot 100 chart. It peaked at number 5 in the Hot 100 in March 2014 and reached a million in sales in the US. By March 2014, the song had reached top 5 in the Hot 100 in its 29th week, and has sold over two million digital copies. By the end of its US run, Pompeii had managed to chart for a total of 53 weeks in the top 100 as well as sell 3 million digital sales mark by June 2014. As of December 2014, the song has sold 3.4 million copies in the US. <a href=\"http://www.last.fm/music/Bastille/_/Pompeii\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}