{
  "track": {
    "name": "Sin Pijama",
    "mbid": "4fc08a86-667b-4520-a418-ea29b8cfefc8",
    "url": "https://www.last.fm/music/Becky+G/_/Sin+Pijama",
    "duration": "190000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "193158",
    "playcount": "1792863",
    "artist": {
      "name": "Becky G",
      "mbid": "eb90c8b8-d733-4c14-a293-105c3d1ba9b3",
      "url": "https://www.last.fm/music/Becky+G"
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "24 Nov 2023, 20:03",
      "summary": "\"Sin Pijama\" is a song by American singer Becky G and Dominican singer Natti Natasha. It was written by the two singers, Nate Campany, Kyle Sherear, Rafael Pina, Mau y Ricky, Jon Leone, Camilo Echeverry and its producers Daddy Yankee and Gaby Music. The song and its music video were released by Sony Music Latin on April 20, 2018. It became both Gomez and Natasha's third top 10 hit on US Hot Latin Songs and has reached number one in Bolivia, Chile, El Salvador and Spain as well as the top 10 in Guatemala, Honduras, Nicaragua, Peru and Uruguay. <a href=\"http://www.last.fm/music/Becky+G/_/Sin+Pijama\">Read more on Last.fm</a>.",
      "content": "\"Sin Pijama\" is a song by American singer Becky G and Dominican singer Natti Natasha. It was written by the two singers, Nate Campany, Kyle Sherear, Rafael Pina, Mau y Ricky, Jon Leone, Camilo Echeverry and its producers Daddy Yankee and Gaby Music. The song and its music video were released by Sony Music Latin on April 20, 2018. It became both Gomez and Natasha's third top 10 hit on US Hot Latin Songs and has reached number one in Bolivia, Chile, El Salvador and Spain as well as the top 10 in Guatemala, Honduras, Nicaragua, Peru and Uruguay. \"Sin Pijama\" received a Latin platinum certification in the US and surpassed 100 million views on YouTube/Vevo within 3 weeks of its release. As of 2022, it has been certified 38-times Latin platinum. <a href=\"http://www.last.fm/music/Becky+G/_/Sin+Pijama\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}