{
  "track": {
    "name": "THE DINER",
    "mbid": "5970bda8-52a8-45ba-a558-6910f58fdb90",
    "url": "https://www.last.fm/music/Billie+Eilish/_/THE+DINER",
    "duration": "186000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "857002",
    "playcount": "12390502",
    "artist": {
      "name": "Billie Eilish",
      "mbid": "f4abc0b5-3f7a-4eff-8f78-ac078dbce533",
      "url": "https://www.last.fm/music/Billie+Eilish"
    },
    "album": {
      "artist": "Billie Eilish",
      "title": "HIT ME HARD AND SOFT",
      "url": "https://www.last.fm/music/Billie+Eilish/HIT+ME+HARD+AND+SOFT",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/6db576307ee7bdd81056432542b6bab7.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/6db576307ee7bdd81056432542b6bab7.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/6db576307ee7bdd81056432542b6bab7.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/6db576307ee7bdd81056432542b6bab7.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "alt-pop",
          "url": "https://www.last.fm/tag/alt-pop"
        },
        {
          "name": "dark cabaret",
          "url": "https://www.last.fm/tag/dark+cabaret"
        },
        {
          "name": "2024",
          "url": "https://www.last.fm/tag/2024"
        },
        {
          "name": "zeitspalte",
          "url": "https://www.last.fm/tag/zeitspalte"
        },
        {
          "name": "jaeh",
          "url": "https://www.last.fm/tag/jaeh"
        }
      ]
    },
    "wiki": {
      "published": "17 May 2024, 14:14",
      "summary": "“THE DINER” from Billie Eilish’s third studio album HIT ME HARD AND SOFT, explores themes of obsession, longing, and the darker sides of love. The lyrics describe an almost stalker-like fixation on someone, blurring the lines between infatuation and danger. In the song, Billie tells a story of someone who watches their object of desire from afar, waits for an opportunity to approach, and ultimately breaks into their house. The tone is eerie and unsettling, capturing the unease of this one-sided obsession. <a href=\"http://www.last.fm/music/Billie+Eilish/_/THE+DINER\">Read more on Last.fm</a>.",
      "content": "“THE DINER” from Billie Eilish’s third studio album HIT ME HARD AND SOFT, explores themes of obsession, longing, and the darker sides of love. The lyrics describe an almost stalker-like fixation on someone, blurring the lines between infatuation and danger. In the song, Billie tells a story of someone who watches their object of desire from afar, waits for an opportunity to approach, and ultimately breaks into their house. The tone is eerie and unsettling, capturing the unease of this one-sided obsession.\n\nThe song ends with Billie reciting a mysterious phone number (310-807-3956), which fans discovered leads to a voicemail message from Billie herself, adding to the surreal, immersive experience of the song.\n\nThe minimalistic production and whispery vocals enhance the haunting atmosphere, reflecting the character’s unstable mindset, and further deepening the tension between love and madness. This track shows Billie Eilish pushing the boundaries of her lyrical storytelling, creating a captivating yet unsettling narrative. <a href=\"http://www.last.fm/music/Billie+Eilish/_/THE+DINER\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}