{
  "track": {
    "name": "Ice Cream (with Selena Gomez)",
    "mbid": "4607b6f3-5699-462b-8920-15b017c2aacb",
    "url": "https://www.last.fm/music/BLACKPINK/_/Ice+Cream+(with+Selena+Gomez)",
    "duration": "176000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "543083",
    "playcount": "10441627",
    "artist": {
      "name": "BLACKPINK",
      "mbid": "48646387-1664-4c9a-9139-9bfd091b823c",
      "url": "https://www.last.fm/music/BLACKPINK"
    },
    "album": {
      "artist": "BLACKPINK & Selena Gomez",
      "title": "Ice Cream (with Selena Gomez) - Single",
      "url": "https://www.last.fm/music/BLACKPINK+&+Selena+Gomez/Ice+Cream+(with+Selena+Gomez)+-+Single",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/442e901c3f4329eebcf652f1027e1208.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/442e901c3f4329eebcf652f1027e1208.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/442e901c3f4329eebcf652f1027e1208.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/442e901c3f4329eebcf652f1027e1208.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "28 Aug 2020, 04:13",
      "summary": "\"Ice Cream\" is a song by South Korean girl group Blackpink and American singer Selena Gomez. It was released on August 28, 2020, as the second single off Blackpink's first Korean-language studio album, The Album. The song was written by Gomez, Teddy, Tommy Brown, Ariana Grande, Victoria Monét, Bekuh Boom, 24, Steven Franks and produced by Teddy, Brown, 24 and Franks. \"Ice Cream\" is an electropop and bubblegum pop song with elements of trap. Lyrically, the song mainly consists of ice cream-related double entendres. <a href=\"http://www.last.fm/music/BLACKPINK/_/Ice+Cream+(with+Selena+Gomez)\">Read more on Last.fm</a>.",
      "content": "\"Ice Cream\" is a song by South Korean girl group Blackpink and American singer Selena Gomez. It was released on August 28, 2020, as the second single off Blackpink's first Korean-language studio album, The Album. The song was written by Gomez, Teddy, Tommy Brown, Ariana Grande, Victoria Monét, Bekuh Boom, 24, Steven Franks and produced by Teddy, Brown, 24 and Franks. \"Ice Cream\" is an electropop and bubblegum pop song with elements of trap. Lyrically, the song mainly consists of ice cream-related double entendres.\n\n\"Ice Cream\" debuted and peaked at number 13 on the US Billboard Hot 100, becoming Blackpink's first single to peak inside the top-twenty of the chart and subsequently becoming the longest-charting song by an all-female Korean act on the Hot 100. The song peaked in the top-10 in Singapore, Hungary, and South Korea, and also entered the top-40 in 15 other countries. An official music video for the song was released on August 28, 2020. It was nominated for Best Collaboration at the MTV Europe Music Award and Music Video of 2020 at the People's Choice Awards. <a href=\"http://www.last.fm/music/BLACKPINK/_/Ice+Cream+(with+Selena+Gomez)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}