{
  "track": {
    "name": "God's Country",
    "mbid": "e0287d0e-9d09-4ced-9434-fb9c27d7d17d",
    "url": "https://www.last.fm/music/Blake+Shelton/_/God%27s+Country",
    "duration": "204000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "116127",
    "playcount": "1059942",
    "artist": {
      "name": "Blake Shelton",
      "mbid": "2ad66473-ccb3-41d2-8756-b56680cdfe62",
      "url": "https://www.last.fm/music/Blake+Shelton"
    },
    "album": {
      "artist": "Blake Shelton",
      "title": "Fully Loaded: God's Country",
      "url": "https://www.last.fm/music/Blake+Shelton/Fully+Loaded:+God%27s+Country",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/9790c7816a6283ef30d2c224a861f21c.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/9790c7816a6283ef30d2c224a861f21c.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/9790c7816a6283ef30d2c224a861f21c.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/9790c7816a6283ef30d2c224a861f21c.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "09 Sep 2019, 14:23",
      "summary": "\"God's Country\" is a song by American country music singer Blake Shelton. It was written by Devin Dawson, Jordan Schmidt, and Hardy.\n\nThe song has been described as a southern rock anthem. Dawson stated that he and his fellows wrote the song on a Thursday, and that \"Blake heard it, and by Monday he had recorded it.\" Shelton first heard the song while working on his farm in Oklahoma, and was blown away by the song. He related \"I had to stop and just listen to this song <a href=\"http://www.last.fm/music/Blake+Shelton/_/God%27s+Country\">Read more on Last.fm</a>.",
      "content": "\"God's Country\" is a song by American country music singer Blake Shelton. It was written by Devin Dawson, Jordan Schmidt, and Hardy.\n\nThe song has been described as a southern rock anthem. Dawson stated that he and his fellows wrote the song on a Thursday, and that \"Blake heard it, and by Monday he had recorded it.\" Shelton first heard the song while working on his farm in Oklahoma, and was blown away by the song. He related \"I had to stop and just listen to this song, because the song was talking to me about a place that I was in at that moment, which was a place in the middle of nowhere that meant something to me that probably nobody else could ever understand, what that is and what it is inside of me and what my connection is to the land.\" He recalled thinking \"'I've gotta record this song,' and I think I even decided before I even recorded it, 'This has got to be the song that I put out next.'\"\n\nShelton has stated that \"'God's Country' is a song that has a strong and deep meaningful lyric, but at the same time it leaves it up to the listeners’ interpretation.\"\n\nHe went on to state that \"But no matter where you are from or where you're standing it is my belief that you're standing in God's Country. It's really about a state of mind. Wherever you're from and how you feel about that place. For me, it's about being from Oklahoma – where I was born, raised and still live today.\"\n\n\"God's Country\" was the best-selling country songs on its first full week of sales, with 32,000 sold. Shelton performed the song at the 2019 ACM Awards the following week on April 7, which helped to keep sales up at 31,000 that week. It reached #1 on Billboard's Hot Country Songs chart dated May 25, 2019, his 14th on the chart and his first since 2013. The song was certified Gold by the RIAA on June 27, 2019, and Platinum on July 31, 2019. It has sold 423,000 copies in the United States as of September 2019.\n\nThe music video was directed by Sophie Muller, and shot over the course of four days in and around Tishomingo, Oklahoma. It depicts Shelton singing and working on a modern farm, interspersed with historical footage of the Dust Bowl, storms, beautiful nature shots, and traditional rural and farm imagery, concluding with a burning tractor. The video is intended to convey the intensity of farm life, while juxtaposing the \"good, beautiful things of God's country, and also the wrath of God.\" <a href=\"http://www.last.fm/music/Blake+Shelton/_/God%27s+Country\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}