{
  "track": {
    "name": "Locked Out of Heaven",
    "mbid": "d74bbaa6-0f07-4774-b5c6-7fdd7e973a20",
    "url": "https://www.last.fm/music/Bruno+Mars/_/Locked+Out+of+Heaven",
    "duration": "233000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "2266993",
    "playcount": "22832105",
    "artist": {
      "name": "Bruno Mars",
      "mbid": "afb680f2-b6eb-4cd7-a70b-a63b25c763d5",
      "url": "https://www.last.fm/music/Bruno+Mars"
    },
    "album": {
      "artist": "Bruno Mars",
      "title": "Unorthodox Jukebox",
      "url": "https://www.last.fm/music/Bruno+Mars/Unorthodox+Jukebox",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/c7cf0cd2fcd6efb0a33e063a8d82ff0e.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/c7cf0cd2fcd6efb0a33e063a8d82ff0e.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/c7cf0cd2fcd6efb0a33e063a8d82ff0e.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/c7cf0cd2fcd6efb0a33e063a8d82ff0e.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "rnb",
          "url": "https://www.last.fm/tag/rnb"
        },
        {
          "name": "Bruno Mars",
          "url": "https://www.last.fm/tag/Bruno+Mars"
        },
        {
          "name": "10s",
          "url": "https://www.last.fm/tag/10s"
        },
        {
          "name": "2012",
          "url": "https://www.last.fm/tag/2012"
        }
      ]
    },
    "wiki": {
      "published": "11 Oct 2012, 17:51",
      "summary": "\"Locked Out of Heaven\" is a song by American singer and songwriter Bruno Mars from his second studio album Unorthodox Jukebox. It was released as the lead single from the album on October 1, 2012. The song was written by Mars, Philip Lawrence and Ari Levine of The Smeezingtons, and produced by Mark Ronson, Jeff Bhasker, Emile Haynie and The Smeezingtons. \"Locked Out of Heaven\" is a reggae rock song influenced by new wave and funk. The song's lyrics <a href=\"http://www.last.fm/music/Bruno+Mars/_/Locked+Out+of+Heaven\">Read more on Last.fm</a>.",
      "content": "\"Locked Out of Heaven\" is a song by American singer and songwriter Bruno Mars from his second studio album Unorthodox Jukebox. It was released as the lead single from the album on October 1, 2012. The song was written by Mars, Philip Lawrence and Ari Levine of The Smeezingtons, and produced by Mark Ronson, Jeff Bhasker, Emile Haynie and The Smeezingtons. \"Locked Out of Heaven\" is a reggae rock song influenced by new wave and funk. The song's lyrics are about the rapturous feelings brought about by a relationship infused with positive emotion as well as euphoria from sex.\n\n\"Locked Out of Heaven\" was well received by most critics, some of whom complimented Mars' different musical direction. His vocals were praised, being called \"smooth\" and \"sweet\", while its sound was lauded, with the song being called \"interesting\" and a \"musical evolution\". While some critics noted influences from various bands, Mars stated that The Police were the ones who influenced him the most to write the song. The single charted inside the top ten in over twenty countries, including the United States, where it became Mars' fourth number-one single on the Billboard Hot 100, holding the spot for six consecutive weeks, and topping the Canadian Hot 100 for three consecutive weeks. \"Locked Out of Heaven\" was certified six and seven times platinum by the Recording Industry Association of America (RIAA) and by the Australian Recording Industry Association (ARIA), respectively. <a href=\"http://www.last.fm/music/Bruno+Mars/_/Locked+Out+of+Heaven\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}