{
  "track": {
    "name": "Promises (with Sam Smith)",
    "mbid": "611ef58c-1252-4d45-af4c-eb60225d5c3a",
    "url": "https://www.last.fm/music/Calvin+Harris/_/Promises+(with+Sam+Smith)",
    "duration": "214000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "436322",
    "playcount": "3467735",
    "artist": {
      "name": "Calvin Harris",
      "mbid": "8dd98bdc-80ec-4e93-8509-2f46bafc09a7",
      "url": "https://www.last.fm/music/Calvin+Harris"
    },
    "album": {
      "artist": "Calvin Harris",
      "title": "Promises",
      "url": "https://www.last.fm/music/Calvin+Harris/Promises",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/2e294ccdd4e087777e093f2a8e127be2.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/2e294ccdd4e087777e093f2a8e127be2.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/2e294ccdd4e087777e093f2a8e127be2.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/2e294ccdd4e087777e093f2a8e127be2.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "19 Mar 2022, 23:20",
      "summary": "\"Promises\" is a song by Scottish music producer Calvin Harris and English singer-songwriter Sam Smith. Both artists co-wrote the song with Canadian singer-songwriter Jessie Reyez, who also provided additional vocals to the song. The song's production was handled solely by Harris. It was released by Columbia Records and Sony Music on 17 August 2018. It reached number one on the UK Singles Chart on 7 September 2018, having debuted at number four two weeks earlier. <a href=\"http://www.last.fm/music/Calvin+Harris/_/Promises+(with+Sam+Smith)\">Read more on Last.fm</a>.",
      "content": "\"Promises\" is a song by Scottish music producer Calvin Harris and English singer-songwriter Sam Smith. Both artists co-wrote the song with Canadian singer-songwriter Jessie Reyez, who also provided additional vocals to the song. The song's production was handled solely by Harris. It was released by Columbia Records and Sony Music on 17 August 2018. It reached number one on the UK Singles Chart on 7 September 2018, having debuted at number four two weeks earlier. It became Harris' tenth British chart-topper and Smith's seventh. In the United States, the single became Harris' twelfth and Smith's first number-one on Billboard's Dance/Mix Show Airplay Chart in its 6 October 2018 issue. The song appears on Smith's third studio album \"Love Goes\".\n\nBoth artists announced the song via Twitter on 13 August 2018. \"Very excited about this one\", Harris wrote. Smith added: \"Surprise! I'm so excited for you all to hear this song.\" The announcement was accompanied by a Japanese-inspired retro single artwork, which depicts a lone tree rising up in front of the ocean against a faded pink backdrop. The song marks Smith's third foray into electronic dance music, after being featured on Disclosure's singles \"Latch\" and \"Omen\" in 2012 and 2015, respectively. On 15 August, Smith posted a promotional photo on Twitter ahead of the single's release, showing them and Harris relaxing on a rooftop while sharing a bottle of wine and a pizza. The single was released alongside a lyric video. <a href=\"http://www.last.fm/music/Calvin+Harris/_/Promises+(with+Sam+Smith)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}