{
  "track": {
    "name": "My Oh My (feat. DaBaby)",
    "url": "https://www.last.fm/music/Camila+Cabello/_/My+Oh+My+(feat.+DaBaby)",
    "duration": "171000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "553957",
    "playcount": "5663249",
    "artist": {
      "name": "Camila Cabello",
      "mbid": "01b8b5bf-06cb-45da-85fb-61ada72fcd69",
      "url": "https://www.last.fm/music/Camila+Cabello"
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "2010s",
          "url": "https://www.last.fm/tag/2010s"
        },
        {
          "name": "2019",
          "url": "https://www.last.fm/tag/2019"
        },
        {
          "name": "2020",
          "url": "https://www.last.fm/tag/2020"
        },
        {
          "name": "DaBaby",
          "url": "https://www.last.fm/tag/DaBaby"
        }
      ]
    },
    "wiki": {
      "published": "10 Apr 2020, 14:24",
      "summary": "“My Oh My“ is a song by Cuban-American singer Camila Cabello featuring American rapper DaBaby from the former's second studio album Romance. It was written by the artists, Savan Kotecha, Ant Clemons, and producers Frank Dukes & Louis Bell. Due to a strong similarity to Peruvian reggae band Tierra Sur's 1992 song \"Llaman a la puerta\", group leader Alejandro \"Pochi\" Marambio received a writing credit. The song was released on adult contemporary radio stations in the United States on January 6, 2020, as the sixth single off the album. <a href=\"http://www.last.fm/music/Camila+Cabello/_/My+Oh+My+(feat.+DaBaby)\">Read more on Last.fm</a>.",
      "content": "“My Oh My“ is a song by Cuban-American singer Camila Cabello featuring American rapper DaBaby from the former's second studio album Romance. It was written by the artists, Savan Kotecha, Ant Clemons, and producers Frank Dukes & Louis Bell. Due to a strong similarity to Peruvian reggae band Tierra Sur's 1992 song \"Llaman a la puerta\", group leader Alejandro \"Pochi\" Marambio received a writing credit. The song was released on adult contemporary radio stations in the United States on January 6, 2020, as the sixth single off the album.\n\nThe song peaked at number 12 on the US Billboard Hot 100, and also reached the top 20 in Australia, Canada, Finland, Ireland, and the United Kingdom. It received a diamond certification in Brazil, double platinum in the United States, and gold in Australia, New Zealand and the United Kingdom. A music video was released on February 12, 2020, which portrayed Cabello as an actress who overcame being cast as a damsel in distress with the assistance of an up-and-coming director portrayed by DaBaby. A remix of the song featuring American rapper Gunna was released on May 1, 2020.\n\nThe recording process for Cabello's second studio album Romance took under ten months, and concluded in October 2019. \"My Oh My\" was first teased by The Sun on November 27, 2019, where the writer Howell Davies stated that the carnal song \"is her naughtiest yet\" and compared it to the 2017 song \"Havana\".\n\nFollowing the release of Romance, \"My Oh My\" debuted at number 82 on the US Billboard Hot 100 before peaking at number 12, becoming the second highest-charting single from the album behind \"Señorita\", which topped the chart in August 2019. It also debuted at number 35 on the Mainstream Top 40, where it peaked at number one on the chart dated May 9, 2020.\n\n\"My Oh My\" peaked at number six in Ireland, and charted in the top 20 in various other countries including Australia, Belgium, Finland, Greece, the Netherlands, New Zealand, and Singapore. In the United Kingdom, the track reached number 13, earning Cabello her eighth top 20 single there. In Brazil, \"My Oh My\" received a Diamond certification on October 18, 2021 for more than 160,000 copies sold in the country.\n\nOn February 12, 2020, the music video for \"My Oh My\" was released at 3 pm EST on YouTube, as an old fashioned, Golden-age Hollywood, grayscale-styled video directed by Dave Meyers after it was teased by Cabello on February 5, 2020. Cabello stars as an actress who's tired of always starring as a damsel in distress and wishes to \"be the hero\". She then goes to a bar and meets an up-and-coming movie director, portrayed by DaBaby, who then hires her to play the role she always wanted. Throughout the video, Cabello utilizes a sword in a Kill Bill inspired film titled 'La Bonita Blade', and performs a Grease-style dance, alongside the use of subtitles.\n\nOn May 1, 2020, a dance video was released during the COVID-19 pandemic. It featured Cabello and the dancers calling each other through FaceTime before performing the song's dance choreography in each of their homes and parks.\n\nCabello and DaBaby performed the song on The Tonight Show Starring Jimmy Fallon on December 12, 2019. Both Cabello and the backup dancers sported lime green and purple high school outfits, with the women wearing cheerleading costumes and the men wearing letterman jackets. During the performance, DaBaby also wore a Gucci sweater. Cabello performed a solo version of the song at the 2020 Global Awards on March 5, 2020. She also performed an acoustic version of the song on the iHeart Living Room Concert for America on March 29, 2020, accompanied by Shawn Mendes playing the acoustic guitar. <a href=\"http://www.last.fm/music/Camila+Cabello/_/My+Oh+My+(feat.+DaBaby)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}