{
  "track": {
    "name": "WAP (feat. Megan Thee Stallion)",
    "mbid": "5f794ee1-2b86-4ef9-942e-ce2d815dc12d",
    "url": "https://www.last.fm/music/Cardi+B/_/WAP+(feat.+Megan+Thee+Stallion)",
    "duration": "187000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1157516",
    "playcount": "14373373",
    "artist": {
      "name": "Cardi B",
      "mbid": "2f3c4d70-0462-40da-bba3-0aec5772c556",
      "url": "https://www.last.fm/music/Cardi+B"
    },
    "album": {
      "artist": "Various Artists",
      "title": "100 Greatest Hits",
      "url": "https://www.last.fm/music/Various+Artists/100+Greatest+Hits",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/0897b476c5312c332b454f361abbaa2f.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/0897b476c5312c332b454f361abbaa2f.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/0897b476c5312c332b454f361abbaa2f.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/0897b476c5312c332b454f361abbaa2f.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "trap",
          "url": "https://www.last.fm/tag/trap"
        },
        {
          "name": "rap",
          "url": "https://www.last.fm/tag/rap"
        },
        {
          "name": "Hip-Hop",
          "url": "https://www.last.fm/tag/Hip-Hop"
        },
        {
          "name": "best of 2020",
          "url": "https://www.last.fm/tag/best+of+2020"
        },
        {
          "name": "Megan Thee Stallion",
          "url": "https://www.last.fm/tag/Megan+Thee+Stallion"
        }
      ]
    },
    "wiki": {
      "published": "08 Aug 2020, 03:39",
      "summary": "\"WAP\" (an acronym for \"Wet-Ass Pussy\") is a song by Cardi B and Megan Thee Stallion. It was released through Atlantic Records on August 7, 2020. \"WAP\" is a hip-hop song driven by heavy bass and a sample of Frank Ski's 1993 Baltimore club single \"Whores in This House\". In the lyrics, Cardi and Megan discuss how they want men to please them, using several sexual innuendos.\n\n\"WAP\" received widespread critical acclaim for its sex-positive message, while some conservative commentators criticized its explicit nature. <a href=\"http://www.last.fm/music/Cardi+B/_/WAP+(feat.+Megan+Thee+Stallion)\">Read more on Last.fm</a>.",
      "content": "\"WAP\" (an acronym for \"Wet-Ass Pussy\") is a song by Cardi B and Megan Thee Stallion. It was released through Atlantic Records on August 7, 2020. \"WAP\" is a hip-hop song driven by heavy bass and a sample of Frank Ski's 1993 Baltimore club single \"Whores in This House\". In the lyrics, Cardi and Megan discuss how they want men to please them, using several sexual innuendos.\n\n\"WAP\" received widespread critical acclaim for its sex-positive message, while some conservative commentators criticized its explicit nature. It debuted at number one on the Billboard Hot 100, giving Cardi B her fourth number-one single in the U.S., extending her record as the female rapper with the most number-one singles in Hot 100 history. It was Megan's second Hot 100 chart-topper. The song broke the record for the largest opening streaming week for a song in United States history and debuted atop the Billboard Digital Song Sales, Streaming Songs, Hot Rap Songs, and Hot R&B/Hip-Hop songs charts. Cardi B became the only female rapper to achieve Hot 100 number-one singles in two different decades (2010s and 2020s). The single spent a total of four weeks atop the chart, while also spending multiple weeks at number one in Australia, Canada, Greece, Ireland, Lithuania, New Zealand, and the United Kingdom. \"WAP\" became the first number one single on the inaugural Billboard Global 200, topping the chart for three weeks. \"WAP\" was the most-acclaimed song of 2020, with publications such as Pitchfork, Rolling Stone, and NPR naming it the best song of the year.\n\nThe accompanying music video, directed by Colin Tilley, features cameos from several women, including television star Kylie Jenner, singers Normani and Rosalía, and rappers Mulatto, Sukihana, and Rubi Rose. The video has been described as a confident display of women who demonstrate their sexual prowess. \"WAP\" broke the record for the biggest 24-hour debut for an all-female collaboration on YouTube. \"WAP\" had the most searched lyrics on Google in 2020. <a href=\"http://www.last.fm/music/Cardi+B/_/WAP+(feat.+Megan+Thee+Stallion)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}