{
  "track": {
    "name": "La Bicicleta",
    "url": "https://www.last.fm/music/Carlos+Vives/_/La+Bicicleta",
    "duration": "0",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "231533",
    "playcount": "1655214",
    "artist": {
      "name": "Carlos Vives",
      "mbid": "ac367c2e-7783-41e5-a184-131da6b0c166",
      "url": "https://www.last.fm/music/Carlos+Vives"
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "28 Feb 2023, 17:06",
      "summary": "\"La Bicicleta\" (English: \"The Bicycle\") is a song by Colombian singer Carlos Vives and Colombian singer-songwriter Shakira from Vives' fifteenth studio album Vives (2017) and is also included as an album track on Shakira's eleventh studio album El Dorado (2017). The song was written by both singers, and produced by Andrés Castro and it marks Shakira's first collaboration with a fellow Colombian artist. \"La Bicicleta\" was intended to be representative of both singers' homelands musical styles in Colombia. <a href=\"http://www.last.fm/music/Carlos+Vives/_/La+Bicicleta\">Read more on Last.fm</a>.",
      "content": "\"La Bicicleta\" (English: \"The Bicycle\") is a song by Colombian singer Carlos Vives and Colombian singer-songwriter Shakira from Vives' fifteenth studio album Vives (2017) and is also included as an album track on Shakira's eleventh studio album El Dorado (2017). The song was written by both singers, and produced by Andrés Castro and it marks Shakira's first collaboration with a fellow Colombian artist. \"La Bicicleta\" was intended to be representative of both singers' homelands musical styles in Colombia. It is a song with a mixture of various musical elements - vallenato, pop and cumbia and instrumentally, it features indigenous Colombian wind instruments and accordions. Lyrically, it is a nostalgic song, describing the duo's excursion on bikes to places of their childhood. <a href=\"http://www.last.fm/music/Carlos+Vives/_/La+Bicicleta\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}