{
  "track": {
    "name": "Rockabye (feat. Sean Paul & Anne-Marie)",
    "mbid": "e5fc0465-60bc-41b0-88c1-a0bba71bf041",
    "url": "https://www.last.fm/music/Clean+Bandit/_/Rockabye+(feat.+Sean+Paul+&+Anne-Marie)",
    "duration": "250000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "676883",
    "playcount": "4584547",
    "artist": {
      "name": "Clean Bandit",
      "mbid": "dacc2d64-7e59-42a8-87a9-10c53919aff2",
      "url": "https://www.last.fm/music/Clean+Bandit"
    },
    "album": {
      "artist": "Clean Bandit",
      "title": "Rockabye (feat. Sean Paul & Anne-Marie)",
      "url": "https://www.last.fm/music/Clean+Bandit/Rockabye+(feat.+Sean+Paul+&+Anne-Marie)",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/f22cf3a4b613512286a0953ffda7a937.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/f22cf3a4b613512286a0953ffda7a937.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/f22cf3a4b613512286a0953ffda7a937.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/f22cf3a4b613512286a0953ffda7a937.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "dance",
          "url": "https://www.last.fm/tag/dance"
        },
        {
          "name": "electronic",
          "url": "https://www.last.fm/tag/electronic"
        },
        {
          "name": "dancehall",
          "url": "https://www.last.fm/tag/dancehall"
        },
        {
          "name": "anne-marie",
          "url": "https://www.last.fm/tag/anne-marie"
        }
      ]
    },
    "wiki": {
      "published": "30 Jan 2024, 12:32",
      "summary": "\"Rockabye\" is a song by British electronic group Clean Bandit featuring English singer Anne-Marie and Jamaican singer and rapper Sean Paul. It was released on 21 October 2016 and was their first single since Neil Amin-Smith's departure from the group and it serves as the lead single from their second studio album, What Is Love? (2018). The song is about hardships of single mothers and alludes to the nursery rhyme and lullaby, Rock-a-bye Baby. \"Rockabye\" is included on the deluxe edition of Anne-Marie's debut studio album, Speak Your Mind. <a href=\"http://www.last.fm/music/Clean+Bandit/_/Rockabye+(feat.+Sean+Paul+&+Anne-Marie)\">Read more on Last.fm</a>.",
      "content": "\"Rockabye\" is a song by British electronic group Clean Bandit featuring English singer Anne-Marie and Jamaican singer and rapper Sean Paul. It was released on 21 October 2016 and was their first single since Neil Amin-Smith's departure from the group and it serves as the lead single from their second studio album, What Is Love? (2018). The song is about hardships of single mothers and alludes to the nursery rhyme and lullaby, Rock-a-bye Baby. \"Rockabye\" is included on the deluxe edition of Anne-Marie's debut studio album, Speak Your Mind.\n\nThe song became 2016’s Christmas number one on December 23, 2016, beating the likes of Rag'n'Bone Man, Little Mix, Zara Larsson, Mariah Carey, Matt Terry and Louis Tomlinson & Steve Aoki to the Christmas number one spot. It is the first song in chart history to become Christmas number one after already being at the top of the charts for six weeks. In total, the song spent 9 weeks at the summit of the UK Singles Chart while also topping the charts in over 28 other countries.\n\n\"Rockabye\" was written by Clean Bandit and Norwegian singer Ina Wroldsen, together with Amar Malik and Steve Mac. Wroldsen wrote the lyrics about her son, which, according to Grace Chatto, \"is why it rings so true for Clean Bandit and is so emotional and special.\" Wroldsen originally provided the vocal for the song but at last minute was swapped for Anne-Marie. The band fought their label to get Ina on the records but failed. Grace described the situation as a terrible experience and she almost quit the band because she felt \"I did feel like I couldn’t do it anymore because the idea that my business was hurting people … that was really painful. I went completely crazy for a while after that. I just had to carry on, but inside it was really hard.”. Clean Bandit announced the single on 21 October 2016, just two days after Neil Amin-Smith quit the band. Talking to Digital Spy, Chatto said, \"We've wanted to work with Sean Paul for a long, long while and it's a dream that we've managed to finally do it. Anne-Marie tells the story and we love her voice. We first heard her singing with Rudimental and we've met her at a million festivals over the past couple of years – it's been so lovely to collaborate together\". The song has a sample from Jerry Rivera's song \"Amores cómo el nuestro\"\n\n\"Rockabye\" is written in the key of A minor. It was composed in common time with a tempo of 102 beats per minute, and follows a chord progression of Am–F–G–Em. The vocals span from G3 to E5. <a href=\"http://www.last.fm/music/Clean+Bandit/_/Rockabye+(feat.+Sean+Paul+&+Anne-Marie)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}