{
  "track": {
    "name": "She Had Me at Heads Carolina",
    "mbid": "1056c27b-5ea8-4997-9b0f-9e1208e2aca5",
    "url": "https://www.last.fm/music/Cole+Swindell/_/She+Had+Me+at+Heads+Carolina",
    "duration": "206000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "81874",
    "playcount": "792516",
    "artist": {
      "name": "Cole Swindell",
      "mbid": "365247e5-db90-4d0e-bf2c-ca18b54fcab9",
      "url": "https://www.last.fm/music/Cole+Swindell"
    },
    "album": {
      "artist": "Cole Swindell",
      "title": "Stereotype",
      "url": "https://www.last.fm/music/Cole+Swindell/Stereotype",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/a13f346f3297ad4909074beaa80aa0ef.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/a13f346f3297ad4909074beaa80aa0ef.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/a13f346f3297ad4909074beaa80aa0ef.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/a13f346f3297ad4909074beaa80aa0ef.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "06 Aug 2023, 23:18",
      "summary": "\"She Had Me at Heads Carolina\" is a song co-written and recorded by country music singer Cole Swindell. It is the third single from Swindell's fourth studio album Stereotype, and his 13th overall. The song contains lyrical and melodic references to Jo Dee Messina's 1996 debut single \"Heads Carolina, Tails California\", and credits that song's writers Mark D. Sanders and Tim Nichols as co-writers. The song peaked at #16 on the Billboard Hot 100, Swindell's highest charting appearance to date. <a href=\"http://www.last.fm/music/Cole+Swindell/_/She+Had+Me+at+Heads+Carolina\">Read more on Last.fm</a>.",
      "content": "\"She Had Me at Heads Carolina\" is a song co-written and recorded by country music singer Cole Swindell. It is the third single from Swindell's fourth studio album Stereotype, and his 13th overall. The song contains lyrical and melodic references to Jo Dee Messina's 1996 debut single \"Heads Carolina, Tails California\", and credits that song's writers Mark D. Sanders and Tim Nichols as co-writers. The song peaked at #16 on the Billboard Hot 100, Swindell's highest charting appearance to date. A remix version of the song featuring Messina was released on November 7, 2022 and the duo performed it at the 56th Annual Country Music Association Awards.\n\nFor the creation of Swindell's 2022 album Stereotype, he wanted to collaborate with Thomas Rhett. He met Rhett at a songwriting collaboration in Nashville, Tennessee, in early 2022 along with Ashley Gorley and Jesse Frasure. Swindell had toured with Rhett in 2021, at which point the two of them decided they wanted to record a song that referenced a country music song from the 1990s. When a song publisher told Swindell of the popularity of Jo Dee Messina's 1996 hit \"Heads Carolina, Tails California\", Swindell and Frasure chose to use that song as inspiration.\n\nOriginally, the four writers conceived the song as a duet between Swindell and Rhett. Their first idea was to structure the song similarly to Michael Jackson and Paul McCartney's 1982 hit \"The Girl Is Mine\". As Rhett did not feel comfortable singing this lyrical theme, the two decided not to make the song a duet. They then decided to create a storyline where the song's narrator falls in love with a woman who sings \"Heads Carolina, Tails California\" at a karaoke bar. The song contains interpolations from \"Heads Carolina, Tails California\", although it is in a different key than that song. Because of this, producer Zach Crowell chose to have the musicians play that song's guitar riff in the altered key instead of sampling it. Guitarist Sol Philcox-Littlefield plays this riff, while Madeline Merlo provides backing vocals on the chorus.\n\nBecause of the interpolation, \"Heads Carolina, Tails California\" co-writers Tim Nichols and Mark D. Sanders are also credited. According to Swindell, when he contacted them for permission to do so, \"they loved it\". Swindell explained to Taste Of Country that he also approached Messina and stated that he would not have released the song without her permission and told her that \"I want her to be a part of it, as much of it or as little of it as she wants to, because she's the original.\" The duet version featuring Messina was released on November 7.\n\nThe accompanying music video was released on August 11, 2022. Directed by Spidey Smith, it features Swindell performing on stage at a bar, while one of his friends tries to capture the attention of the girl singing \"Heads Carolina, Tails California\". His friend is ultimately successful, as seen at the end of the video where the girl flips a quarter to decide where he will take her, also a reference to Messina's original hit. Messina also makes a cameo appearance as the bartender. <a href=\"http://www.last.fm/music/Cole+Swindell/_/She+Had+Me+at+Heads+Carolina\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}