{
  "track": {
    "name": "Heather",
    "url": "https://www.last.fm/music/Conan+Gray/_/Heather",
    "duration": "198000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1414399",
    "playcount": "19799203",
    "artist": {
      "name": "Conan Gray",
      "mbid": "850a8b03-98a7-4fd3-afbd-5e5520b4ef5f",
      "url": "https://www.last.fm/music/Conan+Gray"
    },
    "album": {
      "artist": "Various Artists",
      "title": "Now 35",
      "url": "https://www.last.fm/music/Various+Artists/Now+35",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/fdfd652fe474d2396dd5176fa130757e.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/fdfd652fe474d2396dd5176fa130757e.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/fdfd652fe474d2396dd5176fa130757e.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/fdfd652fe474d2396dd5176fa130757e.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "sad",
          "url": "https://www.last.fm/tag/sad"
        },
        {
          "name": "my top songs",
          "url": "https://www.last.fm/tag/my+top+songs"
        },
        {
          "name": "indie",
          "url": "https://www.last.fm/tag/indie"
        },
        {
          "name": "indie pop",
          "url": "https://www.last.fm/tag/indie+pop"
        }
      ]
    },
    "wiki": {
      "published": "09 Apr 2021, 17:41",
      "summary": "\"Heather\" is a song by American singer-songwriter Conan Gray released through Republic Records. Originally released as a track on Gray's debut studio album Kid Krow in March 2020, it was released as the sixth single in September 2020 after becoming a sleeper hit. \"Heather\" was written by Gray and produced by Dan Nigro with additional production by Jam City. The song received positive reviews from music critics, mostly for the production and solo songwriting. The song was praised by artists such as Taylor Swift and Elton John. <a href=\"http://www.last.fm/music/Conan+Gray/_/Heather\">Read more on Last.fm</a>.",
      "content": "\"Heather\" is a song by American singer-songwriter Conan Gray released through Republic Records. Originally released as a track on Gray's debut studio album Kid Krow in March 2020, it was released as the sixth single in September 2020 after becoming a sleeper hit. \"Heather\" was written by Gray and produced by Dan Nigro with additional production by Jam City. The song received positive reviews from music critics, mostly for the production and solo songwriting. The song was praised by artists such as Taylor Swift and Elton John.\n\nThe song gained popularity on the video-sharing platform TikTok, consequently spawning the meme-like titular phrase which one can use to describe a \"beautiful girl\" which one aspires to look like. Commercially, \"Heather\" debuted at number 61 and rose to number 46 on the Billboard Hot 100, being his first entry on the chart. Elsewhere, the song gave Gray his first single chart entry in countries like the United Kingdom, Canada, New Zealand and the Netherlands, and his second entry in countries such as Australia, Ireland and Lithuania. \"Heather\" has become Gray's most commercially successful single to date, surpassing \"Maniac\", which achieved international mainstream hit radio success earlier that year. <a href=\"http://www.last.fm/music/Conan+Gray/_/Heather\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}