{
  "track": {
    "name": "Kiss Me More (feat. SZA)",
    "url": "https://www.last.fm/music/Doja+Cat/_/Kiss+Me+More+(feat.+SZA)",
    "duration": "208000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1757579",
    "playcount": "26796775",
    "artist": {
      "name": "Doja Cat",
      "mbid": "5df62a88-cac9-490a-b62c-c7c88f4020f4",
      "url": "https://www.last.fm/music/Doja+Cat"
    },
    "album": {
      "artist": "Various Artists",
      "title": "NRJ Music Awards 2021",
      "url": "https://www.last.fm/music/Various+Artists/NRJ+Music+Awards+2021",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/3e42a9e13c9687966ef192dc3b7787f4.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/3e42a9e13c9687966ef192dc3b7787f4.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/3e42a9e13c9687966ef192dc3b7787f4.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/3e42a9e13c9687966ef192dc3b7787f4.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "pop rap",
          "url": "https://www.last.fm/tag/pop+rap"
        },
        {
          "name": "rnb",
          "url": "https://www.last.fm/tag/rnb"
        },
        {
          "name": "2021",
          "url": "https://www.last.fm/tag/2021"
        },
        {
          "name": "planet her",
          "url": "https://www.last.fm/tag/planet+her"
        }
      ]
    },
    "wiki": {
      "published": "09 Apr 2021, 11:16",
      "summary": "\"Kiss Me More\" is a song by Doja Cat featuring SZA, from the former's third studio album Planet Her. It was released on April 9, 2021, through Kemosabe and RCA as the first single from the album.\n\nThe music video premiered the same day as the single and was directed by Warren Fu. It features an astronaut (played by Alex Landi) exploring a foreign planet, where the singers are playing aliens. As it interpolates the chorus from English-Australian singer Olivia Newton-John's 1981 single \"Physical\" <a href=\"http://www.last.fm/music/Doja+Cat/_/Kiss+Me+More+(feat.+SZA)\">Read more on Last.fm</a>.",
      "content": "\"Kiss Me More\" is a song by Doja Cat featuring SZA, from the former's third studio album Planet Her. It was released on April 9, 2021, through Kemosabe and RCA as the first single from the album.\n\nThe music video premiered the same day as the single and was directed by Warren Fu. It features an astronaut (played by Alex Landi) exploring a foreign planet, where the singers are playing aliens. As it interpolates the chorus from English-Australian singer Olivia Newton-John's 1981 single \"Physical\", additional co-writing credits on the track go to Steve Kipner and Terry Shaddick. \"Kiss Me More\" became a number-one song in New Zealand, Mexico, Malaysia, and Singapore, and reached the top five in eighteen countries including Canada, the United Kingdom, Australia, and the United States. It is the longest-running all-female top 10 hit in the latter's history. The song won a Grammy Award for Best Pop Duo/Group Performance, becoming both Doja and SZA's first Grammy wins. It was also nominated for Record of the Year and Song of the Year.\n\nIn early January 2021, Doja Cat revealed that her studio album features numerous guest appearances, including SZA. On March 5, 2021, SZA first mentioned \"Kiss Me More\" during an interview with V. She revealed that the song was \"a different strut and I'm just excited\", while Doja Cat replied by praising SZA, saying \"I commend artists, like you, who stick to something\". On April 8, 2021, Doja Cat took to social media to reveal the cover art and announce the release of the song on April 9. In an interview with Zane Lowe for Apple Music, she said: \"I wanted to make a song about kissing. I just thought it would be cute. That doesn't happen too often, but just a song that's solely about kissing.\" <a href=\"http://www.last.fm/music/Doja+Cat/_/Kiss+Me+More+(feat.+SZA)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}