{
  "track": {
    "name": "Rich Baby Daddy (feat. Sexyy Red & SZA)",
    "url": "https://www.last.fm/music/Drake/_/Rich+Baby+Daddy+(feat.+Sexyy+Red+&+SZA)",
    "duration": "319000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "690396",
    "playcount": "7467253",
    "artist": {
      "name": "Drake",
      "mbid": "9fff2f8a-21e6-47de-a2b8-7f449929d43f",
      "url": "https://www.last.fm/music/Drake"
    },
    "album": {
      "artist": "Drake",
      "title": "For All the Dogs Scary Hours Edition",
      "url": "https://www.last.fm/music/Drake/For+All+the+Dogs+Scary+Hours+Edition",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/3fe94ce0c96db8976248fd034b81f238.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/3fe94ce0c96db8976248fd034b81f238.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/3fe94ce0c96db8976248fd034b81f238.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/3fe94ce0c96db8976248fd034b81f238.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "Drake",
          "url": "https://www.last.fm/tag/Drake"
        },
        {
          "name": "pop rap",
          "url": "https://www.last.fm/tag/pop+rap"
        },
        {
          "name": "sza",
          "url": "https://www.last.fm/tag/sza"
        },
        {
          "name": "2023",
          "url": "https://www.last.fm/tag/2023"
        },
        {
          "name": "Sexyy Red",
          "url": "https://www.last.fm/tag/Sexyy+Red"
        }
      ]
    },
    "wiki": {
      "published": "05 Nov 2023, 04:06",
      "summary": "\"Rich Baby Daddy\" is a song by Canadian rapper and singer Drake featuring American rapper Sexyy Red and American singer-songwriter SZA. It was sent to Italian contemporary hit radio through OVO Sound and Republic Records as the third single from Drake's eighth studio album, For All the Dogs, on October 13, 2023. The three artists wrote the song with producers Diamanté Blackmon, Liohn, and Klahr, and co-producers BNYX, Dougie F, the Loud Pack, and UV Killin Em, alongside Florence Welch, Isabella Summers, and T. <a href=\"http://www.last.fm/music/Drake/_/Rich+Baby+Daddy+(feat.+Sexyy+Red+&+SZA)\">Read more on Last.fm</a>.",
      "content": "\"Rich Baby Daddy\" is a song by Canadian rapper and singer Drake featuring American rapper Sexyy Red and American singer-songwriter SZA. It was sent to Italian contemporary hit radio through OVO Sound and Republic Records as the third single from Drake's eighth studio album, For All the Dogs, on October 13, 2023. The three artists wrote the song with producers Diamanté Blackmon, Liohn, and Klahr, and co-producers BNYX, Dougie F, the Loud Pack, and UV Killin Em, alongside Florence Welch, Isabella Summers, and T. Schaeferdieck, due to the song interpolating \"Dog Days Are Over\" by Florence + the Machine. While the song marks the first time that Sexyy Red has collaborated with both Drake and SZA, the latter two previously collaborated on Drake's 2023 number-one single, \"Slime You Out\", which serves as the lead single from For All the Dogs.\n\nWriting for Rolling Stone, Mosi Reeves compared Drake matching his vocal performance to that of Sexyy Red on \"Rich Baby Daddy\" to his matching that of City Girls on his 2018 single, \"In My Feelings\" and praised the sample of \"Dog Days Are Over\" by Florence + the Machine. Pitchfork's Dylan Green found Sexyy Red and SZA to be \"two of the most memorable features\" on For All the Dogs and felt that their \"raucous\" parts on the song \"live up to the song’s hectic, club-ready beat\". Kyle Denis of Billboard saw the song as \"with infectious production that heavily nods to Miami bass, this is the song of the summer that we deserved — from Sexyy's 'Looking for the Hoes' interpolation to an outro from Drake that basically cements him as the ultimate rich baby daddy\" and saw it to be the potential \"Song of the Fall\". Chris Richards at The Washington Post criticized the \"stray\" line \"Take care of the dog until the dog days are over\" that Drake rapped and called it an \"inelegant hint at potentially forthcoming Drake redemption album\". <a href=\"http://www.last.fm/music/Drake/_/Rich+Baby+Daddy+(feat.+Sexyy+Red+&+SZA)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}