{
  "track": {
    "name": "Knife Talk (with 21 Savage ft. Project Pat)",
    "url": "https://www.last.fm/music/Drake/_/Knife+Talk+(with+21+Savage+ft.+Project+Pat)",
    "duration": "0",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "684404",
    "playcount": "9400878",
    "artist": {
      "name": "Drake",
      "url": "https://www.last.fm/music/Drake"
    },
    "toptags": {
      "tag": [
        {
          "name": "trap",
          "url": "https://www.last.fm/tag/trap"
        },
        {
          "name": "project pat",
          "url": "https://www.last.fm/tag/project+pat"
        },
        {
          "name": "Drake",
          "url": "https://www.last.fm/tag/Drake"
        },
        {
          "name": "21 savage",
          "url": "https://www.last.fm/tag/21+savage"
        },
        {
          "name": "Gangsta Rap",
          "url": "https://www.last.fm/tag/Gangsta+Rap"
        }
      ]
    },
    "wiki": {
      "published": "05 Aug 2022, 03:02",
      "summary": "“Knife Talk” marks another collaborative effort between Drake and 21 Savage, spat over a progressively malevolent instrumental produced by Metro Boomin, along with an introduction by Project Pat sampled from his verse on Juicy J’s 2017 song “Feed the Streets (feat. Project Pat & A$AP Rocky).”\n\nThe energy behind Drake’s venomous delivery is contrasted by 21’s, whose bars give off a sense of introspective jadedness whilst delivering the “gang shit” his general audience most often associates him with. <a href=\"http://www.last.fm/music/Drake/_/Knife+Talk+(with+21+Savage+ft.+Project+Pat)\">Read more on Last.fm</a>.",
      "content": "“Knife Talk” marks another collaborative effort between Drake and 21 Savage, spat over a progressively malevolent instrumental produced by Metro Boomin, along with an introduction by Project Pat sampled from his verse on Juicy J’s 2017 song “Feed the Streets (feat. Project Pat & A$AP Rocky).”\n\nThe energy behind Drake’s venomous delivery is contrasted by 21’s, whose bars give off a sense of introspective jadedness whilst delivering the “gang shit” his general audience most often associates him with.\n\nThis song was initially intended to be a part of 21 and Metro’s 2020 album \"SAVAGE MODE II\", but was instead retained and sent to Drake two days before the release of \"Certified Lover Boy\", who delivered his verse only one day prior to the release of the album, according to DJ Akademiks’ Off The Record podcast.\n\nThe official video for “Knife Talk” was released five days shy of Halloween, synchronizing various horror scenes with characters often miming in sync with the lyrics of the track. Such cinematic references include appropriate attribution to: Carnival of Souls (1962,) The Mad Butcher (1971,) two different Betty Boop scenes and the 1994 short; Wolf! Wolf! <a href=\"http://www.last.fm/music/Drake/_/Knife+Talk+(with+21+Savage+ft.+Project+Pat)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}