{
  "track": {
    "name": "Physical",
    "mbid": "19ddd84f-0353-4d6e-99a1-f00c0aa22cd1",
    "url": "https://www.last.fm/music/Dua+Lipa/_/Physical",
    "duration": "193000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "956487",
    "playcount": "17847372",
    "artist": {
      "name": "Dua Lipa",
      "mbid": "6f1a58bf-9b1b-49cf-a44a-6cefad7ae04f",
      "url": "https://www.last.fm/music/Dua+Lipa"
    },
    "album": {
      "artist": "Dua Lipa",
      "title": "Physical",
      "url": "https://www.last.fm/music/Dua+Lipa/Physical",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/f86044f961070de9cdbac5cd5b52f9fb.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/f86044f961070de9cdbac5cd5b52f9fb.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/f86044f961070de9cdbac5cd5b52f9fb.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/f86044f961070de9cdbac5cd5b52f9fb.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "synthpop",
          "url": "https://www.last.fm/tag/synthpop"
        },
        {
          "name": "dance",
          "url": "https://www.last.fm/tag/dance"
        },
        {
          "name": "dance-pop",
          "url": "https://www.last.fm/tag/dance-pop"
        },
        {
          "name": "electropop",
          "url": "https://www.last.fm/tag/electropop"
        }
      ]
    },
    "wiki": {
      "published": "31 Jan 2020, 20:11",
      "summary": "\"It is very ’80s inspired and quite Flashdance-y. It’s fun, you can dance to it. It’s definitely my craziest of high energy songs.\"\n\n\n\"Physical\" is a song by the English Albanian singer Dua Lipa It was released on 30 January 2020, through Warner Records on digital platforms globally and contemporary hit radio in the United Kingdom. It appears as the fourth track of her second studio album Future Nostalgia, and it's second single.\n\nThe track features a chugging synth bassline, drums and various percussion instruments. <a href=\"http://www.last.fm/music/Dua+Lipa/_/Physical\">Read more on Last.fm</a>.",
      "content": "\"It is very ’80s inspired and quite Flashdance-y. It’s fun, you can dance to it. It’s definitely my craziest of high energy songs.\"\n\n\n\"Physical\" is a song by the English Albanian singer Dua Lipa It was released on 30 January 2020, through Warner Records on digital platforms globally and contemporary hit radio in the United Kingdom. It appears as the fourth track of her second studio album Future Nostalgia, and it's second single.\n\nThe track features a chugging synth bassline, drums and various percussion instruments. Lipa uses a spoken word delivery in the prechorus, but belts and chants the chorus, which includes a reference to Olivia Newton-John's 1981 song of the same name. The lyrics describe the excitement of falling in love.\n\nIt was written by Lipa, Clarence Coffee Jr, Sarah Hudson and its producer Jason Evigan and Koz. The group had previously worked together on New Rules, the sixth single from her debut studio album. Lipa felt that the release of the song was a \"natural\" choice that would allow her to start a new chapter in her life, and chose it to be the second single from Future Nostalgia.\n\nThe music video was released in the next day, by the Catalan director Lope Serrano, who conceived the video under his company CANADA, along with his partner Nicolás Méndez.\n\n\"Well, diversity was for sure very intentional. [...] At the end, the idea is that all the colours (concepts) break their chromatic group obedience and meet together in a purely human celebration of lust and freedom and eclecticism. [...] This results in a single concept forming the nucleus of the map, the centre of existence: ORGASM. [...]  Orgasm is the physical peak of being alive! [...] Well, for me it’s a song about a genuine desire for human contact. It’s a sexy track that drives you magnetically to a climax (let’s get physical!). At the same time, the song has an increasing trajectory. The recurrent verses are repeated six times in the second half of the song as a crescendo, the same way it happens in real life with sexual arousal. [...]\n\n– Via i-D\n\nPhysical reached #2 on the Bulgaria and Ireland Singles chart, #3 on the UK Singles, and #60 on the Billboard 200. It is certified 2x PLATINUM in the UK and PLATINUM in the US, has over 1.03B streams on Spotify and 472 MILLION views on Youtube! <a href=\"http://www.last.fm/music/Dua+Lipa/_/Physical\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}