{
  "track": {
    "name": "Houdini",
    "mbid": "7bf0cb56-212f-4fdb-b68c-04d3059d68c7",
    "url": "https://www.last.fm/music/Eminem/_/Houdini",
    "duration": "227000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "632179",
    "playcount": "6419574",
    "artist": {
      "name": "Eminem",
      "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4",
      "url": "https://www.last.fm/music/Eminem"
    },
    "album": {
      "artist": "Eminem",
      "title": "Houdini",
      "url": "https://www.last.fm/music/Eminem/Houdini",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/cb5129ead86bf9fb6953c9043d0ec902.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/cb5129ead86bf9fb6953c9043d0ec902.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/cb5129ead86bf9fb6953c9043d0ec902.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/cb5129ead86bf9fb6953c9043d0ec902.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "2024",
          "url": "https://www.last.fm/tag/2024"
        },
        {
          "name": "hip hop",
          "url": "https://www.last.fm/tag/hip+hop"
        },
        {
          "name": "rap",
          "url": "https://www.last.fm/tag/rap"
        },
        {
          "name": "Hip-Hop",
          "url": "https://www.last.fm/tag/Hip-Hop"
        },
        {
          "name": "Eminem",
          "url": "https://www.last.fm/tag/Eminem"
        }
      ]
    },
    "wiki": {
      "published": "31 May 2024, 13:58",
      "summary": "\"Houdini\" is a song by American rapper Eminem, and is the lead single from his twelfth studio album, The Death of Slim Shady (Coup de Grâce). The song was produced by Eminem and Luis Resto, and was released through Shady Records, Aftermath Entertainment, and Interscope Records on May 31, 2024. It interpolates multiple previous Eminem works, as well as \"Abracadabra\" by the Steve Miller Band; Jeff Bass, Anne Dudley, Steve Miller, Trevor Horn, DJ Head, and Malcolm McLaren are credited as songwriters due to the interpolation of the latter. <a href=\"http://www.last.fm/music/Eminem/_/Houdini\">Read more on Last.fm</a>.",
      "content": "\"Houdini\" is a song by American rapper Eminem, and is the lead single from his twelfth studio album, The Death of Slim Shady (Coup de Grâce). The song was produced by Eminem and Luis Resto, and was released through Shady Records, Aftermath Entertainment, and Interscope Records on May 31, 2024. It interpolates multiple previous Eminem works, as well as \"Abracadabra\" by the Steve Miller Band; Jeff Bass, Anne Dudley, Steve Miller, Trevor Horn, DJ Head, and Malcolm McLaren are credited as songwriters due to the interpolation of the latter.\n...\n\n\n\n“Houdini” serves as the lead single to Eminem’s twelfth studio album The Death of Slim Shady (Coup de Grâce). The track is named after Harry Houdini, a popular magician known for his death-defying stunts like the Chinese Water Torture Cell, which Eminem replicates in the intro to his 1999 track, “Role Model.”\n\nWith the return of long-time collaborator Jeff Bass of the Bass Brothers, Eminem revisits his catchy albeit morbid sound of the early 2000s. This fanfare track sees him callback to his old catchphrases such as Shady’s iconic “Guess who’s back?” line from the 2002 track “Without Me.”\n\nOn October 24th, 1926, Houdini tragically passed away in Detroit, Michigan at the age of 52. Interestingly, Detroit is also the hometown of Eminem, who turns 52 in October 2024.\n\nThe single was first teased by Eminem on May 20, 2024, when he posted a teaser to his social media accounts with a text message from “All Contacts” stating:\n\n…and for my last trick!\n\nThe text message would also have a date of May 31, sparking rumours of Eminem releasing music on that day.\n\nOn May 28, 2024, Eminem would post a video to Instagram of him on a FaceTime call with magician David Blaine['url]. At the end of the video, Eminem announced the release of “Houdini” on May 31, then closed out by stating “for my last trick, I’m gonna make my career disappear,” hinting at The Death of Slim Shady (Coup de Grâce) being his final studio album. <a href=\"http://www.last.fm/music/Eminem/_/Houdini\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}