{
  "track": {
    "name": "Not Afraid",
    "mbid": "041b7a0a-dc39-41ec-bee7-ab58cce94c68",
    "url": "https://www.last.fm/music/Eminem/_/Not+Afraid",
    "duration": "303000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1254490",
    "playcount": "10531896",
    "artist": {
      "name": "Eminem",
      "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4",
      "url": "https://www.last.fm/music/Eminem"
    },
    "album": {
      "artist": "Eminem",
      "title": "Recovery",
      "url": "https://www.last.fm/music/Eminem/Recovery",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/ee16dc01c93643b288b60e9806c1e68b.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/ee16dc01c93643b288b60e9806c1e68b.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/ee16dc01c93643b288b60e9806c1e68b.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/ee16dc01c93643b288b60e9806c1e68b.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "rap",
          "url": "https://www.last.fm/tag/rap"
        },
        {
          "name": "Eminem",
          "url": "https://www.last.fm/tag/Eminem"
        },
        {
          "name": "hip hop",
          "url": "https://www.last.fm/tag/hip+hop"
        },
        {
          "name": "Hip-Hop",
          "url": "https://www.last.fm/tag/Hip-Hop"
        },
        {
          "name": "955 WKQI",
          "url": "https://www.last.fm/tag/955+WKQI"
        }
      ]
    },
    "wiki": {
      "published": "29 Apr 2010, 12:02",
      "summary": "\"Not Afraid\" is a song by American rapper Eminem from his seventh studio album Recovery. It was released as the album's lead single on April 29, 2010, by Interscope Records. \"Not Afraid\" was first revealed as a single by Eminem via Twitter, after which the song debuted on the radio. To promote the single's release, a freestyle rap, \"Despicable\", was released on the Internet and received attention for its tone and lyrical content. \"Not Afraid\" was written and produced by Eminem <a href=\"http://www.last.fm/music/Eminem/_/Not+Afraid\">Read more on Last.fm</a>.",
      "content": "\"Not Afraid\" is a song by American rapper Eminem from his seventh studio album Recovery. It was released as the album's lead single on April 29, 2010, by Interscope Records. \"Not Afraid\" was first revealed as a single by Eminem via Twitter, after which the song debuted on the radio. To promote the single's release, a freestyle rap, \"Despicable\", was released on the Internet and received attention for its tone and lyrical content. \"Not Afraid\" was written and produced by Eminem, Boi-1da, Jordan Evans and Matthew Burnett; keyboardist Luis Resto was also attributed with a songwriting credit. According to Eminem's manager Paul Rosenberg and music critics, \"Not Afraid\" carries a positive message and depicts Eminem's change in direction from drugs and violence. The hip-hop song features a choir that assists Eminem in a heavily layered chorus and vocals are sung over a guitar, synthesizer and piano; no Auto-Tune was used on the sung vocals, but many reverberation tools were.\n\n\"Not Afraid\" received mixed to positive reviews from music critics, who praised the song for being anthemic in nature and carrying a positive message. The song did, however, face criticism for its sudden change in theme from previous singles, and was considered to be less affecting than some of his other songs. Despite mixed reception, \"Not Afraid\" became the 16th song in Billboard history to debut on the Billboard Hot 100 at number one; it also debuted as a chart-topper in Canada. In June 2014 the song was certified 10× Platinum by RIAA, making Eminem the first artist with digital diamond awards for two songs. \"Not Afraid\" has earned Eminem MTV Video Music Awards, MTV Video Music Awards Japan, Grammy Awards, Billboard Music Awards, and Detroit Music Awards.\n\nThe song was accompanied by a music video, which Rich Lee directed in May 2010. New York City and Newark, New Jersey were chosen as settings to shoot the video. Reviewers praised the video as it followed the lyrics and praised the video for such depictions. However, the product placement in the video by Nike shoes and Beats by Dr. Dre headphones was criticized. In 2010, Eminem performed \"Not Afraid\" at Electronic Entertainment Expo 2010 (E3 2010), Oxegen 2010, T in the Park 2010 and the 2010 MTV Video Music Awards. He has also performed the song at the Bonnaroo Music Festival, Lollapalooza and the V Festival. Rolling Stone ranked it the 24th best song of 2010.\n\n\"Not Afraid\" is a hip-hop song written and produced by Rick Crowe, Eminem, Evans and Burnett; Resto did additional writing. Boi-1da provided drums; Evans and Burnett provided string sounds. The lyrics focus on a positive change from Eminem's past experiences, including an end to drug abuse, feuds and violence. The Los Angeles Times noted that a person hearing this song for the first time may identify it as Christian hip-hop. MTV News writer Shaheem Reid noted that \"There are no jabs at pop-culture icons, no jovial goofballing. Led by a guitar, synthesizer and piano, \"Not Afraid\" is published in the key of C minor and has a moderate tempo of 86 beats per minute, according to the sheet music published by Sony/ATV Music Publishing. A writer for MuchMusic website noted that Eminem chose to use his Marshall Mathers ego for the song, rather than Slim Shady. He follows a chord progression of Cm–A♭(maj7)–E♭–B♭ in the chorus.\n\nThe song begins with a brief introduction in which Eminem says while the chorus plays underneath, \"Yeh, it's been a ride. I guess I had to go to that place to get to this one. When he begins the first verse, his lyrics threaten people who have looked down on him: \"You can try to read my lyrics off of this paper before I lay 'em/ But you won't take the sting out these words before I say 'em.  In the second verse, Eminem says that he has indeed made mistakes, commenting on his Relapse album: \"That last Relapse CD was ehh/ Perhaps I ran them accents into the ground/ Relax, I ain't going to do that now.\" When he says \"All I'm trying to say is get back, click clack, pow\", a gunshot is heard. Approaching the end of the second verse, Eminem raps about his personal experiences: \"But I think I'm still trying to figure this crap out/ Thought I had it mapped out, but I guess I didn't/ It's time to exercise these demons/ These motherfuckers are doing jumping jacks now.\" After the chorus, Eminem sings a bridge and focuses on a positive change, as he says \"I just can't keep living this way, so starting today I'm breaking out of this cage.\" Before the final chorus, he says that he \"shoots for the moon\". The song features a choir composed of Kip Blackshire, Christal Garrick II, Terry Dexter, Rich King, Kristen Ashley Cole and Sly Jordan. This song is also about how Slim Shady is leaving Eminem so he can \"handle his responsibilities as a father.\" He promises to get his life together for better. In his new album Kamikaze, Fall shows him getting the slim shady part of him \"back.\" As he desperately runs away from the shadow, it catches up with him and he realizes he can't escape it.\n\nOn April 26, 2010, Eminem posted a message through his Twitter account that read, \"I'm 'Not Afraid'\", without any elaboration. Fans and news organizations were able to interpret the message and announced that Eminem's first single from his seventh studio album, Recovery would be titled \"Not Afraid\". Radio personality Angela Yee, from radio station WWPR-FM, confirmed that the new single would debut on Eminem's uncensored radio station, Shade 45. Eminem's manager, Paul Rosenberg, told Billboard that \"It's not a dark song, it's an uplifting song.\n\nThe new single was initially slated to impact radio on April 30, 2010; however, the date was changed to one day earlier and the song eventually aired at 10 am ET, on Shade 45's show The Morning After with Angela Yee. On May 5, 2010, the single was made available for digital download at online retailers through Aftermath Entertainment and Interscope Records. In the song, Eminem makes a reference to Relapse and spoke at Friday Night with Jonathan Ross about it: \"...looking back on it now in retrospect, I feel like there was a lot of stuff on there that was humorous and shock value and I had to go back and listen to my older material and figure out why ... Relapse didn't make me feel like [what] used to and kind of put the feeling back into what I do.\n\nThe song was featured in a trailer for the war film Act of Valor.\n\nPre-release promotion\nTwo days before \"Not Afraid\"'s slated release, Eminem released a freestyle rap video to promote the release of the album's lead single. Titled \"Despicable\", the vocals in the video are played over the instrumental versions of \"Over\" by Canadian rapper Drake and \"Beamer, Benz or Bentley\" by G-Unit member Lloyd Banks; the verse switches to the latter well into the two-minute song. Lyrics make a reference to football quarterback Ben Roethlisberger in the line \"I’d rather turn this club into a bar room brawl/Get as rowdy as Roethlisberger in a bathroom stall.\" These lyrics refers to sexual assault allegations in March 2011 at a nightclub in Milledgeville, Georgia, causing controversy. Other references include those to fictional comic book character Superman: \"I give as much of a flying fuck as that Superman dude\" and to general popular culture: \"Like a leaf suck in a vacuum, y’all/there ain’t nothing but a whole lotta sucking going on in rap.  Eminem's final lyric makes a reference to Looney Tunes character Daffy Duck.\n\nMusic critics commented on the freestyle rap. Ray Roa of the music website Consequence of Sound noted Eminem's obvious frustration in the song, saying that he \"sounds pissed off as ever on a new freestyle\". He also added, \"The first minute and a half of the track is mellow by his standards, but when the beat switches to Banks’ track, Eminem goes apeshit.\" Melinda Newman of HitFix gave a positive review and wrote that the freestyle sounds like a \"blast that sucks all the air out of room. It's better than anything on Relapse, and the sheer dexterity of his rhyming skills is awe-inspiring. Thaindian News's Madhuri Dey felt that \"Eminem takes his usual route of taking a hit at some personality\". Adam Downer of Sputnikmusic wrote positively: \"Eminem spits with the crazed desperation we remember from the albums.\n\nThe reception of \"Not Afraid\" was mixed to positive. Jon Dolan of Rolling Stone praised the song's tone: \"Over a dark, operatic beat. Eminem delivers rhymes that are typically acrobatic—and typically heavy-handed. But the anger has a gathering quality. Dolan also praised the song's inspirational theme. Henry Adaso of About.com gave a positive review on the song, noting \"Boi-1da's bouncy charm\" and \"heartwrenching lyrics from a master poet\" as good aspects of the song and noted no negative aspects. In Adaso's guide review, he praised Boi-1da's production and Eminem's affecting lyrics; he considered the former's work \"shimmering\" and Eminem's \"sensitive lyrics entwine on this knocker\"; overall, he gave the song four and a half stars out of a possible five. After the song's release, AllHipHop called it \"an anthem in nature and rebellious to the core. In her review of the Recovery, Jody Rosen of Rolling Stone noted that even if Eminem—reaching his late 30s—is becoming \"a grumpy middle-aged man, at least he's owning it\". Winston Robbins of music website Consequence of Sound called \"Not Afraid\" one of the songs on Recovery \"with catchy hooks, choruses, and beats multiplied by the endless pool of wit and anger that Eminem possesses\". In his album review, Thomas Nassiff wrote on behalf of AbsolutePunk; he noted the song for being radio-friendly and that it \"doesn't sacrifice anything to be friendly to the masses. Andy Gill of The Independent said that this is where \"the only completely commendable sentiment on the entire album comes\" and called it a \"proud rehab anthem\". In his review for Recovery, Benjamin Meadows-Ingram of Spin magazine called \"Not Afraid\" a \"stadium-ready lead single\"; he went on to say, \"Finally, Eminem addresses his personal and professional failings head-on, rather than hiding behind a joke or inside a nightmare. It's a necessary first step in moving on.\n\nThe song also faced mixed and negative reviews. After \"Not Afraid\" leaked onto the Internet on April 29, 2010, Simon Vozick-Levinson of Entertainment Weekly magazine commented on the song, noting both positive and negative characteristics; he first complimented Eminem's change of lyrical theme, calling it anthemic in nature and noting its inspirational and powerful message. He compared the song's theme to Eminem's 2002 single \"Sing for the Moment\" and his 2009 single, \"Beautiful\". Vozick-Levinson called Eminem's rapping \"wild\" but was dismissive of the production, saying, \"The track behind 'Not Afraid' has the same tinny, repetitive, wannabe-epic quality that's annoyed me on Boi-1da productions like 'Forever. Mayer Nissem of the British site Digital Spy gave the song three stars out of a possible five, and wrote a mixed review; the reviewer first commented, \"Thank heavens! – Marshall Mathers III has opted against his usual trick of cobbling together a hook and some 'satire' via two-year-old back issues of the Inquirer to trail it.\" However, Nissem criticized other aspects of the song, saying that Eminem's \"decision to chronicle ... feels a little worthy and more than a touch dull.\" He felt that Eminem's previous songs never bored the listener, unlike \"Not Afraid\". Jeff Weiss of the Los Angeles Times commented that \"Not Afraid\" was an improvement from the lead singles of Encore (2004) and Relapse, \"Just Lose It\" and \"We Made You\", respectively, giving for a more serious and inspirational theme. However, Weiss misses the comic nature of Eminem's classic singles, such as \"My Name Is\"; instead, he felt that the song was composed of \"vague self-help bromides and a bombastic but nondescript beat from ... Boi-1da.\" When discussing the chorus, Weiss commented that it \"doesn’t make for very engaging listening.\" Finally, he discussed possible influences by American rapper T.I., but overall, he named it a disappointing lead single.\n\nJohn Ulmer of the website One Thirty BPM gave the song seven points out of a possible ten, and published a mixed review; he praised it for being a more serious track compared to previous lead singles \"Just Lose It\" and \"We Made You\" but criticized it for being less powerful compared to his 2002 hit single, \"Lose Yourself\", and \"Beautiful\". According to Ulmer, \"Upon first listen it's a bit corny, but it's appropriately anthemic, and not bad enough to deter from the strength of the overall track. He noted that although Eminem does not have as much of a frustrated voice as he does in \"Despicable\", he admits that Relapse was a silly album. Pitchfork Media's Jayson Greene wrote a rather negative review on Recovery and was very dismissive of the song: \"Eminem spends nearly half of Recovery insisting he's the best rapper alive, but for the first time in his career, he actually sounds clumsy. Kitty Empire of the newspaper The Guardian also wrote negatively about the song in her album review, criticizing the song's lyrics: \"Rhyming 'through a storm' with 'whatever weather/ cold or warm' in the chorus is unforgivable for a master rhymer.\" As part of his album review, Greg Kot of daily newspaper Chicago Tribune criticized Eminem's lyrics and rhymes in \"Not Afraid\", comparing them to his rhyming skills back when his 2002 hip hop drama film, 8 Mile, premiered: \"Doesn't he realize that's the kind of cheese that the battle-rhyming Eminem of 8 Mile would've mercilessly mocked?\n\nAccording to Nielsen SoundScan, \"Not Afraid\" sold 380,000 digital copies in its first week, giving Eminem the biggest sales week for a digital single between the beginning of 2010 and the date of the song's release. Three songs received higher sales during their first week: Flo Rida's \"Right Round\", The Black Eyed Peas' \"Boom Boom Pow\" and Eminem's \"Crack a Bottle\", which were all 2009 singles. \"Not Afraid\" proved to be successful when it debuted on the Billboard Hot 100 at number one, a feat only 15 songs had accomplished previously. The song was Eminem's third number-one single on the Hot 100, coming after \"Lose Yourself\" and \"Crack a Bottle\". \"Not Afraid\" was also the first to debut at number one since October 17, 2009, when American recording artist Britney Spears's \"3\" debuted atop the chart. It is the first hip hop single by a male to debut at number one since American rapper Sean Combs (known then as \"Puff Daddy\") topped the chart in 1997, with \"I'll Be Missing You\", which features Faith Evans and band 112.\n\nAfter entering the Digital Songs chart at number one, the song fell down to number four the next week, and to number six on the Hot 100, with sales of 202,000 digital copies. On June 14, 2010, \"Not Afraid\" rose to number five again with sales of 157,000 copies. On July 14, 2010, it rose from 22 to 24 on the Hot 100; by then, the song was downloaded a total of 1,750,000 times. On July 25, 2010, the song crossed the two million mark, based on total sales. As of August 2013, the song has sold 5,000,000 digital copies. In June 2014 the song was certified 10× Platinum by RIAA.\n\nIn Canada, \"Not Afraid\" debuted at the top of the Canadian Hot 100, remaining on the chart for 20 weeks.\n\nIn the United Kingdom, \"Not Afraid\" debuted and peaked at number five on the UK Singles Chart on May 30, 2010 – for the week ending date June 5, 2010. It dropped to number six the following week, to number ten on July 4, 2010 – for the week ending July 10, 2010 – and to number 14 the week after. On August 1, 2010, the song dropped to number 20 and its last appearance on the UK Singles Chart would be on August 29, giving the song a total of 14 weeks on the chart.\n\nIn New Zealand, \"Not Afraid\" entered and peaked at number eight on the New Zealand Singles Chart on May 10, 2010. Lasting on the chart for a total of twenty-three weeks, the song would not make its last chart appearance in New Zealand until September 9, 2010, at number Thirty-four.\n\nIn Australia, the song entered at number sixteen on the Australian Singles Chart in its first week and reached its peak at number four the following week; its lowest and final chart position occurred during the song's twenty-seventh week on the chart, at number forty-eight.\n\nOn the Ö3 Austria Top 40, Austria's official singles chart, May 21, 2010 marked the song's chart debut, at number 22. It reached its peak on August 13, at number five and would stay at that position for another week. Before re-entering on January 14, 2011 at number 72, the song made a last consecutive chart appearance on November 19, 2011 at number 52. The song dropped to the bottom of the chart (number 75) on January 21, 2011, before exiting it. In Italy, the song only charted for one week, at number three; the same occurred in France, on February 19, 2011, at number 97. \"Not Afraid\" lasted 19 weeks on the Irish Singles Chart and made a final chart appearance on September 30, 2010, at number 36. Flanders' chart, Ultratop 50, gave the song a debut position at number 13 on May 15, 2010; the song would not reach a higher position and would drop to number 49 in its 16th and final week. On Wallonia's chart, Ultratop 50, the song debuted at number 14 and would not chart again until July 3, 2010, at number 40. Longer than on any other chart, \"Not Afraid\" charted in Sweden for 43 consecutive weeks, debuting at number five and charting at number 49 in its final week.\n\nBefore filming began, Eminem spoke to Paul Rosenberg on the telephone about his ideas for a music video of \"Not Afraid\"; the two shared thoughts and started collaborating in May 2010. American director Richard \"Rich\" Lee was hired to direct the video, which was shot on Market Street, in Newark, New Jersey as well as New York City. On the first day, Eminem filmed the opening scene on the rooftop of the Manhattan Municipal Building. Lee called the moment \"sort of like a very internal feeling kind of video\". In an interview, while the video was being shot, Eminem spoke about working with Lee \"as pretty anti-climactic, for the most part, you know what I mean... It's good working with him, you know, he's about his business\". The scene in which Eminem jumps from a cliff and dives, was done at Greenpoint Warehouse, in Brooklyn with Lee and video producer Justin Diener. Also working with Eminem on the video included Dennis Dennehy and Chris Clancy for marketing. The final scene filmed on the first day was where Eminem would try to escape from a dark basement on a set built by production designer Ethan Tobman; shooting in Newark also continued.\n\nThe second day of shooting focused on Eminem as he walked through Market Street in Newark. Eminem's final shoot before wrapping up was a mirror scene, which included many glass mirrors, and a fake one among them, through which he would have to break through. On May 30, 2010, Eminem confirmed the video's release date in a Twitter message: \"For those 'patiently waiting,' the NOT AFRAID video will premier Saturday 6/5. Details later...\" The day before the video's premiere, a teaser trailer was uploaded onto video sharing site YouTube, which combines many clips from the full video. The music video was uploaded on the video website Vevo on June 5, 2010 at 11:30 am ET. Vevo stylized their logo with the E reversed, similar to Eminem's logo. On June 7, the television premiere took place on MTV and VH1, and the former featured a primetime encore the day after.\n\nAs of May 2020, the music video has received over 1.4 billion views and 8 million likes on YouTube. <a href=\"http://www.last.fm/music/Eminem/_/Not+Afraid\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}