{
  "track": {
    "name": "Godzilla (feat. Juice WRLD)",
    "mbid": "8145ada9-b091-4c52-93b5-7b7e3560953a",
    "url": "https://www.last.fm/music/Eminem/_/Godzilla+(feat.+Juice+WRLD)",
    "duration": "210000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "885843",
    "playcount": "10411096",
    "artist": {
      "name": "Eminem",
      "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4",
      "url": "https://www.last.fm/music/Eminem"
    },
    "album": {
      "artist": "فنانون متعددون",
      "title": "Discover More Hip Hop",
      "url": "https://www.last.fm/music/%D9%81%D9%86%D8%A7%D9%86%D9%88%D9%86+%D9%85%D8%AA%D8%B9%D8%AF%D8%AF%D9%88%D9%86/Discover+More+Hip+Hop",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/30abb2dad8593e7a987e1c09f418e830.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/30abb2dad8593e7a987e1c09f418e830.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/30abb2dad8593e7a987e1c09f418e830.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/30abb2dad8593e7a987e1c09f418e830.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "rap",
          "url": "https://www.last.fm/tag/rap"
        },
        {
          "name": "english",
          "url": "https://www.last.fm/tag/english"
        },
        {
          "name": "2020",
          "url": "https://www.last.fm/tag/2020"
        },
        {
          "name": "Eminem",
          "url": "https://www.last.fm/tag/Eminem"
        },
        {
          "name": "Juice WRLD",
          "url": "https://www.last.fm/tag/Juice+WRLD"
        }
      ]
    },
    "wiki": {
      "published": "19 Jan 2020, 18:25",
      "summary": "Eminem and late rapper Juice WRLD team up for the first time on “Godzilla,” where they compare themselves to monsters. In particular, they become Godzilla, a fictional sea monster that is known for its mass destruction and endless killing.\n\nWhile this track marks the first collaboration between the two artists, Juice previously listed Eminem as one of his biggest influences and has frequently referenced his music, most notably on his May 2018 track, “Lean Wit Me. <a href=\"http://www.last.fm/music/Eminem/_/Godzilla+(feat.+Juice+WRLD)\">Read more on Last.fm</a>.",
      "content": "Eminem and late rapper Juice WRLD team up for the first time on “Godzilla,” where they compare themselves to monsters. In particular, they become Godzilla, a fictional sea monster that is known for its mass destruction and endless killing.\n\nWhile this track marks the first collaboration between the two artists, Juice previously listed Eminem as one of his biggest influences and has frequently referenced his music, most notably on his May 2018 track, “Lean Wit Me.” In October 2018, Juice joined Tim Westwood TV, where he freestyled for close to an hour over different Eminem beats.\n\n“Godzilla” also serves as Juice WRLD’s first posthumous release since his passing on December 8, 2019—six days after his 21st birthday. Juice reportedly recorded the chorus for the track before his untimely death, although he was unable to complete his actual verse for the song in time. Later in January 2020, a picture surfaced on XXL that depicted Juice WRLD and his friends after he recorded the chorus.\n\nGenius broke down the song on January 17, 2020, in an edition of their Song Stories series. In March 2020 interview with Genius, producer d.a. got that dope broke down how the song came together.\n\nThe song would receive its first certification on February 5, 2020, when it was certified Gold by Music Canada making it the first official certification for the single.\n\nThe official music video dropped on March 9, 2020, directed by Cole Bennett, one of the biggest names in music video production, and starred Dr. Dre, retired boxer Mike Tyson, Eminem, actress Anna Dahl, and actor George Todd McLachlan, portraying a young Eminem. Juice WRLD appears in the video as well using older stock footage.\n\nEminem launched the #GodzillaChallenge on February 25th, 2020, which encouraged fans to spit the fast third in creative ways, lip-syncing or rapping, on the Triller app in order to win a shout-out and signed lithograph. He announced the winner on March 18th, Jack Sherlock. The fan lip-synced Em’s verse while simultaneously showing his collection of vinyl Eminem albums. <a href=\"http://www.last.fm/music/Eminem/_/Godzilla+(feat.+Juice+WRLD)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}