{
  "track": {
    "name": "Worth It",
    "mbid": "b8f500bf-e18b-46fc-99f5-fb33f4ee5f3d",
    "url": "https://www.last.fm/music/Fifth+Harmony/_/Worth+It",
    "duration": "185000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "295981",
    "playcount": "1765765",
    "artist": {
      "name": "Fifth Harmony",
      "mbid": "e565610b-9a8f-451d-b594-ea658d76f725",
      "url": "https://www.last.fm/music/Fifth+Harmony"
    },
    "album": {
      "artist": "Fifth Harmony",
      "title": "Worth It",
      "url": "https://www.last.fm/music/Fifth+Harmony/Worth+It",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/feb1aaac46d0650748171599734799cf.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/feb1aaac46d0650748171599734799cf.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/feb1aaac46d0650748171599734799cf.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/feb1aaac46d0650748171599734799cf.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "30 Apr 2023, 19:29",
      "summary": "\"Worth It\" is a song by American girl group Fifth Harmony, featuring American rapper Kid Ink. The song impacted American rhythmic crossover radio on March 2, 2015, as the third and final single from the group's first studio album, Reflection. Written by Priscilla Renea and its producers Stargate, \"Worth It\" is a dance-pop and R&B song that incorporates a strong use of Balkan music and Middle Eastern music in its production, the trademark of its producer and songwriter, Ori Kaplan. <a href=\"http://www.last.fm/music/Fifth+Harmony/_/Worth+It\">Read more on Last.fm</a>.",
      "content": "\"Worth It\" is a song by American girl group Fifth Harmony, featuring American rapper Kid Ink. The song impacted American rhythmic crossover radio on March 2, 2015, as the third and final single from the group's first studio album, Reflection. Written by Priscilla Renea and its producers Stargate, \"Worth It\" is a dance-pop and R&B song that incorporates a strong use of Balkan music and Middle Eastern music in its production, the trademark of its producer and songwriter, Ori Kaplan. The lyrics discuss themes of feminism, self-worth, and confidence, and include double entendres.\n\nThe song became a sleeper hit on the US Billboard Hot 100 where it peaked at number 12, marking the group's highest-charting single at the time and the first top 20 single by a girl group in the US since \"Jai Ho! (You Are My Destiny)\" by The Pussycat Dolls in 2009. It reached number one in Israel and Lebanon and number three on the UK Singles Chart. It was the fourth-bestselling song of 2015 in Israel. It is certified Quadruple Platinum in the US and Gold or higher in eleven additional countries. Directed by Cameron Duddy, the music video has themes of female empowerment with Fifth Harmony dominating men as business executives. It has received over two billion views on YouTube. The group promoted \"Worth It\" with several televised performances, including the season twenty-one finale of Dancing with the Stars, Jimmy Kimmel Live! and at the 2015 MTV Europe Music Awards.\n\n\"Worth It\" was produced and co-written by the Norwegian production company, Stargate, consisting of duo Mikkel S. Eriksen and Tor Erik Hermansen and Ori Kaplan, with additional writing from Priscilla Renea. The song was released on January 15, 2015, on streaming and downloading services but officially impacted American rhythmic crossover radio as a single on March 2, 2015. A Spanish version titled \"Dame Esta Noche\" (Spanish for \"Give Me This Night\") was released to iTunes on July 10, 2015, following the success of the single. The track features Kid Ink's English rap verse, while the group sings in Spanish.\n\nOriginally intended for recording by rapper Kid Ink, who ended up collaborating on the song, the lyrics, and melody were changed to fit a female perspective. Kid Ink noted during an interview with Forbes that while he was \"writing on their album\", he was able to collaborate with \"producers Stargate and Cashmere Cat\" and this led to the development of the song. One of Kid Ink's verses from \"Wit It\" (the original version of the song) appears on this song. Speaking to Complex, Dinah Jane explained that the song was unplanned for the album, saying \"There were no females on the song\". After the song was presented to them by the production team Stargate, they changed part of the lyrics and bits \"of the concept\" to \"fit their perspective\". Lauren Jauregui also shared similar sentiments, saying that she \"didn't think\" the track would \"make the album\". In an interview with Billboard, music director David Armbrecht explained that the song is a \"message of self-empowerment, which is made clear in its triumphant 'Give it to me, I'm worth it!' chorus\". The song speaks to women of \"all demographics\", he said, explaining that this can be applied to anyone in a \"relationship\" or \"getting out of one\" and it is likely that one can get \"tired of the games\" and deserve better, using the song to do just that.\n\nOn the chart dated February 7, 2015, \"Worth It\" debuted on the Billboard Hot 100 at number 82. It would exit the chart the following week and re-enter on the third week at number 93. On the Mainstream Top 40 and Rhythmic charts, the song debuted at 39 and 38, respectively. On the main chart, it would exit once again, this time for four weeks, before charting at number 92. For the week dated March 28, 2015, the song rose five spots to a new position at number 87. Following the release of the music video, which premiered at the Kid's Choice Awards, the song rose nine spots to number 78. The promotion from the video and the show's audience gave the song a 20-spot jump at number 58 for the week dated April 11, 2015. For the week dated April 18, 2015, the song rose 17 spots to a peak of 41. The following week, the song rose two spots at a new peak of 39, earning the group their second top 40 hit and their highest-charting single at the time of the publication. It recorded 48,000 digital sales, a five percent slip from the previous week and a four percent increase at 3.6 million streams. On the Mainstream Top 40 chart, the song would peak at number four, earning them their first top 10 hit as well as their first entry in the Rhythmic chart, where the song peaked at number 19.\n\nSince its release, the song has sold over 1,700,000 copies, according to a publication from Billboard, on May 12, 2017. It achieved triple platinum certification by the Recording Industry Association of America, for combined sales and track-equivalent stream units of three million; additionally, as of 2016, it was one of only twenty-two songs released in 2015 to be certified multi-platinum.\n\nThe song debuted at number 92 in Canada on the week marked April 11, 2015. For the following week, the song rose 25 spots to position at number 67 and then another the week after that. It would rise 12 spots once again for the week dated May 2, 2015. The song would rise one spot for two consecutive weeks, before staying stationary for one week. It continued to rise in positions, two spots then six spots to a peak at number 44 for the week of June 6, 2015. It would rise another ten spots to peak at number 34, earning the group their first top 40 entry in this market. The following week, the song continued its rise, jumping 13 spots to number 21. It would rise once again, peaking at number 16, and earning the group their first top 20 entry as well for the week dated June 27, 2015. It rose one spot for two consecutive weeks before falling two spots to number 16. After a series of drops and rises, the song would peak at number 12, on the week of September 5, 2015. It was certified double platinum for selling over 160,000 digital copies. In Mexico, the song topped both its English and domestic charts. It was subsequently promoted through a Spanish release, where the group sang their verses in Spanish. It was certified platinum for selling 60,000 copies.\n\nThe song was released in the United Kingdom through digital download on June 21, 2015, over six months since being released in the United States market and more than three months later since receiving airplay there as well. For the week of July 4, 2015, the song debuted on the Official Charts Company at number 81. It rose thirty spots to a peak of 51, the following week. For the week dated July 16, 2015, the song rose 48 spots to a peak at number 3, earning the group their first top-five entry on the chart. The song would stay in the top 40 for eight additional weeks and would chart for a total of 19 weeks. The song peaked in the top 20 of nine additional countries. In Hungary, the song entered the top 10 of the country's three domestic charts, rising six spots to a peak of number 2 on the week of September 20, 2015, on the singles chart. On the dance and radios chart, the song rose three spots for the same week as the singles chart, to a peak of seven, and rose one spot to a peak at number four, respectively. In the French charts, the song peaked at number 15 and charted for a total of 29 weeks. Similarly, in Germany, the song peaked at number 16 and would chart for 31 weeks.\n\nIn Australia, the song would peak at number nine, earning the group their first top 10 entry in this market. The song would stay in the top 10 for an additional week and would chart for a total of fifteen weeks. Conversely, in the New Zealand market, the song failed to reach the top 20, charting at 31 and appearing on the chart for fourteen weeks. The song received airplay in Middle Eastern markets, topping the charts in both Israel and Lebanon. The song's blend of Balkan music, which has been a staple in the Middle East, aided in its success in this region. The song debuted at number 98 on the Japanese Hot 100 for the week of January 23, 2016. The following week, it rose 44 spots to a new peak of 54. It would rise 25 more spots to a new position at number 29 and then three spots to a position at 26, where it would reach its peak. Across seas, the song peaked at 53 on the Brazilian Billboard Hot 100, making its first appearance on this chart.\n\nThe music video premiered at the 2015 Kids' Choice Awards on March 28, 2015. It was uploaded the same day to the group's official Vevo account and directed by Cameron Duddy. The video follows a similar concept from their lead single, \"Boss\", focusing on themes of self-worth, confidence, and female empowerment. The \"Worth It\" music video earned Fifth Harmony their first Vevo-certified award in July 2015 and later reached the one-billion-view mark on July 26, 2016. With over 2 billion views, it is now one of the 60 most viewed YouTube videos of all time and the second-most watched YouTube video by a girl group, being overtaken at the number one spot for most watched video with \"Work from Home\", which was released a nearly a year later. <a href=\"http://www.last.fm/music/Fifth+Harmony/_/Worth+It\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}