{
  "track": {
    "name": "TQM",
    "url": "https://www.last.fm/music/Fuerza+Regida/_/TQM",
    "duration": "157000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "123460",
    "playcount": "1729091",
    "artist": {
      "name": "Fuerza Regida",
      "mbid": "e665ce26-6ce9-4c42-8f6a-7a361a0ba328",
      "url": "https://www.last.fm/music/Fuerza+Regida"
    },
    "album": {
      "artist": "Fuerza Regida",
      "title": "TQM",
      "url": "https://www.last.fm/music/Fuerza+Regida/TQM",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/2d5e70979e056e973437f618a206684f.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/2d5e70979e056e973437f618a206684f.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/2d5e70979e056e973437f618a206684f.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/2d5e70979e056e973437f618a206684f.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "17 Sep 2023, 18:51",
      "summary": "La canción \"TQM\" de Fuerza Regida es una representación de un lujoso estilo de vida. Es un corrido sin dedicatoria directa a algún personaje en específico aunque menciona algunos nombres de narcotráficantes. La letra describe los gustos del personaje como fumar marihuana \"Cherry Kush\" y usar ropa de diseñador de marcas como Psycho Bunny y Burberry. El personaje también presume de su riqueza y estilo de vida ostentoso, conduciendo un \"BMW\" y gastando dinero sin preocupaciones. <a href=\"http://www.last.fm/music/Fuerza+Regida/_/TQM\">Read more on Last.fm</a>.",
      "content": "La canción \"TQM\" de Fuerza Regida es una representación de un lujoso estilo de vida. Es un corrido sin dedicatoria directa a algún personaje en específico aunque menciona algunos nombres de narcotráficantes. La letra describe los gustos del personaje como fumar marihuana \"Cherry Kush\" y usar ropa de diseñador de marcas como Psycho Bunny y Burberry. El personaje también presume de su riqueza y estilo de vida ostentoso, conduciendo un \"BMW\" y gastando dinero sin preocupaciones. Al mismo tiempo, el personaje hace referencia a que las mujeres le dicen \"TQM\" cuando ven su auto de lujo BMW. “TQM”es la abreviatura de “Te quiero mucho”. Menciona que está a cargo de negocios como \"consigna de Iván\", refiriéndose a Iván Archivaldo, el hijo de Joaquin Guzmán. También dice \"Partiendo el queso de JGL\" que es una referencia a que trabaja para Joaquín Guzmán. En general, \"TQM\" retrata un estilo de vida de riqueza, poder, y mujeres. Aunque la letra no cuenta con mucho sentido o algún tema en específico parece ser solo un tema comercial. <a href=\"http://www.last.fm/music/Fuerza+Regida/_/TQM\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}