{
  "track": {
    "name": "WE STILL DON'T TRUST YOU",
    "url": "https://www.last.fm/music/Future/_/WE+STILL+DON%27T+TRUST+YOU",
    "duration": "252000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "417128",
    "playcount": "4750296",
    "artist": {
      "name": "Future",
      "mbid": "48262e82-db9f-4a92-b650-dfef979b73ec",
      "url": "https://www.last.fm/music/Future"
    },
    "album": {
      "artist": "Future",
      "title": "WE STILL DON'T TRUST YOU",
      "url": "https://www.last.fm/music/Future/WE+STILL+DON%27T+TRUST+YOU",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/6a3dd879bb20457745a12ac0872c8821.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/6a3dd879bb20457745a12ac0872c8821.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/6a3dd879bb20457745a12ac0872c8821.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/6a3dd879bb20457745a12ac0872c8821.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "future",
          "url": "https://www.last.fm/tag/future"
        },
        {
          "name": "pop rap",
          "url": "https://www.last.fm/tag/pop+rap"
        },
        {
          "name": "The Weeknd",
          "url": "https://www.last.fm/tag/The+Weeknd"
        },
        {
          "name": "Metro Boomin",
          "url": "https://www.last.fm/tag/Metro+Boomin"
        },
        {
          "name": "Southern Hip Hop",
          "url": "https://www.last.fm/tag/Southern+Hip+Hop"
        }
      ]
    },
    "wiki": {
      "published": "30 Aug 2024, 19:12",
      "summary": "“We Still Don’t Trust You” is the title track from Future and Metro Boomin’s collaborative album We Still Don’t Trust You, released on April 12, 2024. Serving as the thematic centerpiece of the project, the song blends dark, atmospheric production with emotionally charged lyricism, reflecting a mood of paranoia, betrayal, and resilience. With Metro Boomin’s cinematic and haunting beat setting the tone, Future delivers a somber and confessional performance that diverges from his usual bravado <a href=\"http://www.last.fm/music/Future/_/WE+STILL+DON%27T+TRUST+YOU\">Read more on Last.fm</a>.",
      "content": "“We Still Don’t Trust You” is the title track from Future and Metro Boomin’s collaborative album We Still Don’t Trust You, released on April 12, 2024. Serving as the thematic centerpiece of the project, the song blends dark, atmospheric production with emotionally charged lyricism, reflecting a mood of paranoia, betrayal, and resilience. With Metro Boomin’s cinematic and haunting beat setting the tone, Future delivers a somber and confessional performance that diverges from his usual bravado, tapping into vulnerability and introspection.\n\nThe track is widely interpreted as a continuation and deepening of themes introduced on the duo’s earlier 2024 release We Don’t Trust You, reinforcing the notion of distrust and emotional walls built from personal and professional betrayals. While much of Future’s music centers around toxic indulgence and detached bravado, “We Still Don’t Trust You” slows the pace and shifts focus toward reflection, disillusionment, and unresolved tension. The production is layered with shimmering synths and ghostly vocal effects, evoking a sense of cold distance and inner isolation.\n\nA notable feature of the track is the appearance of The Weeknd, who contributes a mournful and haunting chorus that amplifies the track’s emotional gravity. His vocals, soaked in Auto-Tune and reverb, echo the central sentiment of distrust and heartbreak, adding another layer of drama and melancholy. His presence also added to public speculation regarding the song’s subtext, with many fans believing that certain lines subtly reference personal and artistic fallouts, including rumored tensions with artists like Drake.\n\nCritics and fans have praised the song for its mood-driven production and emotional honesty, highlighting it as a standout moment on the album. Its placement as both the title track and one of the longest cuts on the project signals its importance to the album's overall narrative arc. The song balances minimalistic instrumentation with emotionally heavy performances, a hallmark of Metro Boomin’s darker work, and a testament to Future’s ability to channel pain into melody-driven flows.\n\n“We Still Don’t Trust You” has been regarded as one of the most introspective tracks in Future’s recent discography, and it marks a high point in Metro Boomin’s continued evolution as a conceptual producer. The track's raw emotion, combined with its spacious and cinematic production, captured listeners' attention not through loud declarations but through its cold, sobering mood. It stands as an anthem of distrust not just in others, but in the entire system surrounding fame, loyalty, and artistic identity. <a href=\"http://www.last.fm/music/Future/_/WE+STILL+DON%27T+TRUST+YOU\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}