{
  "track": {
    "name": "one of wun",
    "url": "https://www.last.fm/music/Gunna/_/one+of+wun",
    "duration": "0",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "568005",
    "playcount": "6767569",
    "artist": {
      "name": "Gunna",
      "mbid": "100b8734-f4f0-4536-9960-47f7c59d1b4c",
      "url": "https://www.last.fm/music/Gunna"
    },
    "toptags": {
      "tag": [
        {
          "name": "Olivia is awesome",
          "url": "https://www.last.fm/tag/Olivia+is+awesome"
        },
        {
          "name": "Olivia",
          "url": "https://www.last.fm/tag/Olivia"
        },
        {
          "name": "Im marrying Olivia",
          "url": "https://www.last.fm/tag/Im+marrying+Olivia"
        },
        {
          "name": "wunna",
          "url": "https://www.last.fm/tag/wunna"
        },
        {
          "name": "2024",
          "url": "https://www.last.fm/tag/2024"
        }
      ]
    },
    "wiki": {
      "published": "07 May 2025, 17:25",
      "summary": "\"One of Wun\" is a song by American rapper Gunna from his fifth studio album of the same name (2024). It was produced by Que, Byrd and Kenny Stuntin. Lyrically, the song centers around Gunna's determination to succeed in the face of adversity. In the chorus, he references the backlash against him and the people who want him to fail. Elsewhere, he also boasts his fashion, particularly about wearing the most stylish outfit at the Met Gala. Robin Murray of Clash remarked that the song \"hits hard, with Gunna refusing to pull his punches. <a href=\"http://www.last.fm/music/Gunna/_/one+of+wun\">Read more on Last.fm</a>.",
      "content": "\"One of Wun\" is a song by American rapper Gunna from his fifth studio album of the same name (2024). It was produced by Que, Byrd and Kenny Stuntin. Lyrically, the song centers around Gunna's determination to succeed in the face of adversity. In the chorus, he references the backlash against him and the people who want him to fail. Elsewhere, he also boasts his fashion, particularly about wearing the most stylish outfit at the Met Gala. Robin Murray of Clash remarked that the song \"hits hard, with Gunna refusing to pull his punches. As a demonstration of rap finesse, it works as a superb portrait of his technical skills.\" <a href=\"http://www.last.fm/music/Gunna/_/one+of+wun\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}