{
  "track": {
    "name": "Follow You",
    "mbid": "7d831112-bdd2-49d9-b0b1-dcce21d9eb77",
    "url": "https://www.last.fm/music/Imagine+Dragons/_/Follow+You",
    "duration": "175000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "267604",
    "playcount": "2541196",
    "artist": {
      "name": "Imagine Dragons",
      "mbid": "012151a8-0f9a-44c9-997f-ebd68b5389f9",
      "url": "https://www.last.fm/music/Imagine+Dragons"
    },
    "album": {
      "artist": "Various Artists",
      "title": "Now That's What I Call Music, Vol. 79",
      "url": "https://www.last.fm/music/Various+Artists/Now+That%27s+What+I+Call+Music,+Vol.+79",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/86165d3ec7f3d1cd18037231452a3263.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/86165d3ec7f3d1cd18037231452a3263.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/86165d3ec7f3d1cd18037231452a3263.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/86165d3ec7f3d1cd18037231452a3263.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "03 Nov 2022, 18:28",
      "summary": "“Follow You” and its B-side “Cutthroat” marks the first songs from American pop-rockers Imagine Dragons since June 2019’s “Birds (Remix).” The pair of tracks also act as the band’s lead singles for their fifth studio album \"Mercury – Act 1\".\n\nAs a whole, the song focuses on loving someone in spite of the difficulties that may arise. Lead singer Dan Reynolds makes a point to affirm to their loved ones that they are with them through thick and thin. <a href=\"http://www.last.fm/music/Imagine+Dragons/_/Follow+You\">Read more on Last.fm</a>.",
      "content": "“Follow You” and its B-side “Cutthroat” marks the first songs from American pop-rockers Imagine Dragons since June 2019’s “Birds (Remix).” The pair of tracks also act as the band’s lead singles for their fifth studio album \"Mercury – Act 1\".\n\nAs a whole, the song focuses on loving someone in spite of the difficulties that may arise. Lead singer Dan Reynolds makes a point to affirm to their loved ones that they are with them through thick and thin. According to Dan, he wrote this song soon after receiving a life-changing text from his wife, Aja, on his way to finalizing their divorce papers.\n\nPrior to the pair’s release, a set of four cryptic videos were posted on the band’s social media accounts (1, 2, 3, 4), the fourth of which contained a secret message, telling them to “ask Alexa.” Upon asking Amazon’s Alexa “Is Ragged Insomnia a good band name,” the smart assistance replied, “That’s a good question. There are two sides to every coin. Ask to follow Imagine Dragons on Amazon Music to find out on March 12th,” the release date of the pair of tracks.\n\n\"Have you ever gotten a text that changed your life? My wife and I hadn’t talked in 7 months. I was driving to the lawyer’s office to sign the divorce papers. When I got a text from her that turned my perpective upside down. She said she didn’t want to own me to love me. She loved me without expectations. We ditched the lawyers and went to lunch. It felt like the first date again. We called off the divorce…I wrote this song after I got that text\"\n\n– Dan Reynolds via TikTok\n\n\"“Follow You” is a song about loyalty and love. Loving someone is an incredibly imperfect process. It isn’t always romantic or pretty. Sometimes it can be incredibly painful. Aja taught me self-love and showed me what it meant to truly accept someone without any expectations. She was endlessly patient with me. She didn’t need me. She even taught me that I didn’t need her. But we loved each other and […] we chose to remarry and to stay together. I proposed again and she said yes, again. Not every relationship works out this way, but it did for us. It isn’t the happy ending—it is a choice that works for some. And Aja and I re-chose it after experiencing life without each other. […] I wanted [“Follow You”] to represent a love that is realistic. One where love isn’t perfect, but it endures.\"\n\n– Dan Reynolds via Twitter\n\nAs of the week ending May 22, 2021, “Follow You” has peaked at #68 on the Hot 100. <a href=\"http://www.last.fm/music/Imagine+Dragons/_/Follow+You\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}