{
  "track": {
    "name": "Eyes Closed",
    "mbid": "9d9d94bf-b32c-4518-92bf-7638d8ada240",
    "url": "https://www.last.fm/music/Imagine+Dragons/_/Eyes+Closed",
    "duration": "200000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "165333",
    "playcount": "1357880",
    "artist": {
      "name": "Imagine Dragons",
      "mbid": "012151a8-0f9a-44c9-997f-ebd68b5389f9",
      "url": "https://www.last.fm/music/Imagine+Dragons"
    },
    "album": {
      "artist": "Imagine Dragons",
      "title": "Eyes Closed",
      "url": "https://www.last.fm/music/Imagine+Dragons/Eyes+Closed",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/97f756c6846a3d0fadda872d43d7ffc2.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/97f756c6846a3d0fadda872d43d7ffc2.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/97f756c6846a3d0fadda872d43d7ffc2.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/97f756c6846a3d0fadda872d43d7ffc2.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "09 May 2024, 22:30",
      "summary": "\"Eyes Closed\" is a song by American pop rock band Imagine Dragons, released as the first single from the band's sixth studio album, Loom on April 3, 2024. The song was released through Interscope and Kidinakorner. It was written by Dan Reynolds, Wayne Sermon, Ben McKee, and producers Mattman & Robin. A remix of the song with J Balvin was released on May 3.\n\nThe song has been described as a mix of rap-rock, pop, and alternative rock, with some dubstep. In a statement, Reynolds said of the track: <a href=\"http://www.last.fm/music/Imagine+Dragons/_/Eyes+Closed\">Read more on Last.fm</a>.",
      "content": "\"Eyes Closed\" is a song by American pop rock band Imagine Dragons, released as the first single from the band's sixth studio album, Loom on April 3, 2024. The song was released through Interscope and Kidinakorner. It was written by Dan Reynolds, Wayne Sermon, Ben McKee, and producers Mattman & Robin. A remix of the song with J Balvin was released on May 3.\n\nThe song has been described as a mix of rap-rock, pop, and alternative rock, with some dubstep. In a statement, Reynolds said of the track:\n\n\"After taking some time off the road and spending time catching up with family and loved ones, I finally have felt the desire to go back to the sonic places that originally brought me the most joy, but with a new outlook and mentality. The world looks much different after being a band for more than a decade. But some things will always remain the same. It’s finding that right balance of nostalgia and freshness that brings me the most joy in the studio. We had a lot of fun making this one and hope you enjoy it too.\"\n\nOn March 2024, \"Eyes Closed\" was first teased following the latest release of \"Children of the Sky (a Starfield song)\" through various snippets, following secret codes and riddles to solve through their official website. Another snippet was released on March 27, alongside a team-based event that sorted fans into respective teams (Croyants, Reveurs, or Guerriers) based off of their choices on a quick survey. On March 31, the first week of the four-door event had officially ended with the Croyants in the lead. This resulted in the band, in collaboration with the discord server, giving fans the release date of the song, and its single art. This was shared on their social media official account the next day.\n\nDirected by Andrew Donoho, the video follows Dan Reynolds, who appears to wake up from death—emerging from piles of sand—in a strange world, where he encounters ancient ruins. On his journey, he encounters four doors, but he cannot seem to escape from this place until eventually a fifth door is unveiled that he must pass through. These strange-looking ruins turn out to be a dream from his subconscious spinning a near-death experience, from the aftermath of a car crash. The video ends with Reynolds leaving the scene and walking into the street. <a href=\"http://www.last.fm/music/Imagine+Dragons/_/Eyes+Closed\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}