{
  "track": {
    "name": "WHATS POPPIN",
    "mbid": "73801df2-a595-4747-bf8c-1c71309bb649",
    "url": "https://www.last.fm/music/Jack+Harlow/_/WHATS+POPPIN",
    "duration": "139000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "599467",
    "playcount": "5594853",
    "artist": {
      "name": "Jack Harlow",
      "mbid": "134cb0bc-06fa-42f7-8078-b0c858349975",
      "url": "https://www.last.fm/music/Jack+Harlow"
    },
    "album": {
      "artist": "Various Artists",
      "title": "Just Hits",
      "url": "https://www.last.fm/music/Various+Artists/Just+Hits",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/e9d4da5f4e041df86db634f0d0aa5b67.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/e9d4da5f4e041df86db634f0d0aa5b67.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/e9d4da5f4e041df86db634f0d0aa5b67.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/e9d4da5f4e041df86db634f0d0aa5b67.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "21 Jan 2022, 15:01",
      "summary": "\"WHATS POPPIN\" is a song by American rapper Jack Harlow, released as the lead single from his \"Sweet Action\" EP, by Generation Now and Atlantic Records on January 21, 2020. It was also included on his debut studio album \"Thats What They All Say\" along with its remix.\n\nBeing produced by the duo of jetsonmade & Pooh Beatz–the primary producers of one of Summer 2019’s hit songs, “Suge”–and being accompanied by a Lyrical Lemonade music video <a href=\"http://www.last.fm/music/Jack+Harlow/_/WHATS+POPPIN\">Read more on Last.fm</a>.",
      "content": "\"WHATS POPPIN\" is a song by American rapper Jack Harlow, released as the lead single from his \"Sweet Action\" EP, by Generation Now and Atlantic Records on January 21, 2020. It was also included on his debut studio album \"Thats What They All Say\" along with its remix.\n\nBeing produced by the duo of jetsonmade & Pooh Beatz–the primary producers of one of Summer 2019’s hit songs, “Suge”–and being accompanied by a Lyrical Lemonade music video, this playfully grandeur single from Jack Harlow shows he has gained a new level of trust and recognition within the hip-hop community he had not yet seen in prior years.\n\n\"'I had just gotten off tour and I remember Jetson DM'ed me while I was on tour. He probably had the hottest year out of any producer, so I was very excited to get a message from him. As soon as I got back, I hit his line and he came to the studio with Pooh Beatz and we made a couple records. This was probably the third or fourth song that I did right after I got off tour. As soon as they played the beat, it was just this agreement amongst all of us. Like, you gotta snap on this, you can’t be no melodic, fun rap. Just really rap. So that was the focus, and I just went in. When he first got there, I was already aware that there’s a certain tempo he works at, because I heard a lot of DaBaby songs. So the first thing I was trying to get him to do was encourage him to speed his tempo up a little bit and go into a space I’m in. But coincidentally, when this beat came on, this ain’t even really the tempo I was trying to put him in. This is usually his space, and I couldn’t argue with it. It’s just so crazy. As soon as those pianos come in, it felt like there was no choice but to rap on this song. It’s just one of those beats. I heard the beat, then I wrote probably the first 30 bars. While I was in the booth, Jetson and Pooh, they had to go after I finished the first 30. But it sounded right so I did that 30 and then the next day I came back and I started punching some lines in. I was freestyling, so some of them are a little more simple because it was like, “Let me just ride the beat.” So it took two days to finish out. Then I sent it to Jetson and he was like, “Oh, you rapping rapping.” I couldn’t tell if he was pleased by that or not, because he said it like there’s a lot of rapping, but I’m like “Yes.” What was crazy is, everyone that heard it for the first week after it was finished, thought it was special. That’s why we chose to drop it because it was just a feeling. Everyone that came into the studio, when we played that song, the drums didn’t even have to drop for everyone to do the same thing. By the second bar, I was like, “Whoa,” every time. It’s just a feeling. It’s like, this is exciting.'\"\n\n“WHATS POPPIN” debuted at #96 on the Billboard Hot 100 during the chart week of February 22, 2020.\n\nDuring the week of July 4, 2020, “WHATS POPPIN” peaked at #8 on the chart, marking Harlow’s first Top 10 hit on the chart.\n\nAfter the release of the track’s remix, the song propelled up to #2 on the chart during the week of July 11, 2020. <a href=\"http://www.last.fm/music/Jack+Harlow/_/WHATS+POPPIN\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}