{
  "track": {
    "name": "Try That in a Small Town",
    "mbid": "2d62400e-2875-4097-83b9-7b976e2cea14",
    "url": "https://www.last.fm/music/Jason+Aldean/_/Try+That+in+a+Small+Town",
    "duration": "178000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "39389",
    "playcount": "244684",
    "artist": {
      "name": "Jason Aldean",
      "mbid": "f24df11a-7e35-4979-a4db-a3b2a170ce27",
      "url": "https://www.last.fm/music/Jason+Aldean"
    },
    "album": {
      "artist": "Jason Aldean",
      "title": "Try That In A Small Town - Single",
      "url": "https://www.last.fm/music/Jason+Aldean/Try+That+In+A+Small+Town+-+Single",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/d2e91e8987896f1af563424aac6e659c.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/d2e91e8987896f1af563424aac6e659c.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/d2e91e8987896f1af563424aac6e659c.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/d2e91e8987896f1af563424aac6e659c.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "19 Jul 2023, 06:06",
      "summary": "\"Try That in a Small Town\" is a song written by Kelley Lovelace, Neil Thrasher, Tully Kennedy, and Kurt Allison, and recorded by country music singer Jason Aldean. It was released to country radio in May 2023 as the lead single to Aldean's 11th studio album Highway Desperado, released on November 3, 2023.\n\nThe song was the subject of widespread controversy and media attention following the release of its music video in July 2023, with accusations that the song was a coded endorsement of racism and lynching <a href=\"http://www.last.fm/music/Jason+Aldean/_/Try+That+in+a+Small+Town\">Read more on Last.fm</a>.",
      "content": "\"Try That in a Small Town\" is a song written by Kelley Lovelace, Neil Thrasher, Tully Kennedy, and Kurt Allison, and recorded by country music singer Jason Aldean. It was released to country radio in May 2023 as the lead single to Aldean's 11th studio album Highway Desperado, released on November 3, 2023.\n\nThe song was the subject of widespread controversy and media attention following the release of its music video in July 2023, with accusations that the song was a coded endorsement of racism and lynching, which both Aldean and the video's producers have denied. Four days after the video's release, the television network CMT withdrew it from its rotation. After the subsequent extensive media coverage, \"Try That in a Small Town\" had a surge in popularity.\n\nThe track reached #1 on the US Billboard Hot 100, Aldean's first on that chart to date, and in late July experienced the biggest sales week for a country song in over 10 years. It also reached #9 in Canada.\n\nAfter the attempted assassination of Donald Trump in July 2024, Aldean dedicated the song during a concert in Nashville to Trump, saying \"President Trump’s a friend of mine so I want to send this next song out to him. We all know what’s going to happen come November, so it’s all good. Just goes to show you there’s a lot of bullshit in the world, and that’s kind of what this song right here was about, so this one goes out to the pres.\" <a href=\"http://www.last.fm/music/Jason+Aldean/_/Try+That+in+a+Small+Town\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}