{
  "track": {
    "name": "Surround Sound (feat. 21 Savage & Baby Tate)",
    "url": "https://www.last.fm/music/JID/_/Surround+Sound+(feat.+21+Savage+&+Baby+Tate)",
    "duration": "229000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "843323",
    "playcount": "12298197",
    "artist": {
      "name": "JID",
      "mbid": "d616b606-cf6a-4b6e-ab0f-e253b8db6610",
      "url": "https://www.last.fm/music/JID"
    },
    "album": {
      "artist": "JID",
      "title": "Surround Sound (feat. 21 Savage & Baby Tate) - Single",
      "url": "https://www.last.fm/music/JID/Surround+Sound+(feat.+21+Savage+&+Baby+Tate)+-+Single",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/b61a1ac75f6faeb0475a7acfee7121e9.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/b61a1ac75f6faeb0475a7acfee7121e9.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/b61a1ac75f6faeb0475a7acfee7121e9.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/b61a1ac75f6faeb0475a7acfee7121e9.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "Southern Hip Hop",
          "url": "https://www.last.fm/tag/Southern+Hip+Hop"
        },
        {
          "name": "trap",
          "url": "https://www.last.fm/tag/trap"
        },
        {
          "name": "chipmunk soul",
          "url": "https://www.last.fm/tag/chipmunk+soul"
        },
        {
          "name": "21 savage",
          "url": "https://www.last.fm/tag/21+savage"
        },
        {
          "name": "hip hop",
          "url": "https://www.last.fm/tag/hip+hop"
        }
      ]
    },
    "wiki": {
      "published": "17 Feb 2022, 17:35",
      "summary": "\"Surround Sound\" is a song by American rapper JID featuring Atlanta-based rapper 21 Savage and fellow American rapper Baby Tate, released on January 14, 2022, as the lead single from the former's third studio album The Forever Story. Produced by DJ Scheme, Christo, and Nuri, it contains a sample of \"One Step Ahead\" by Aretha Franklin.\n\nA few days before the song was released, JID previewed the music video on Instagram. In a later post, he revealed <a href=\"http://www.last.fm/music/JID/_/Surround+Sound+(feat.+21+Savage+&+Baby+Tate)\">Read more on Last.fm</a>.",
      "content": "\"Surround Sound\" is a song by American rapper JID featuring Atlanta-based rapper 21 Savage and fellow American rapper Baby Tate, released on January 14, 2022, as the lead single from the former's third studio album The Forever Story. Produced by DJ Scheme, Christo, and Nuri, it contains a sample of \"One Step Ahead\" by Aretha Franklin.\n\nA few days before the song was released, JID previewed the music video on Instagram. In a later post, he revealed the inspiration behind the song was from focusing on the environmental sounds and noises around him as a child, to find an escape from his chaotic home life.\n\nAt the beginning of the song, a sample of \"One Step Ahead\" by Aretha Franklin is played and a loop built around it serves as the instrumental. Notable “One Step Ahead” was already sampled in 1999 by Mos Def in his song “Ms. Fat Booty”. JID raps the chorus and first verse with double entendres and multisyllabic rhymes. The second verse is rapped by 21 Savage, who \"mixes gun talk with making sound financial decisions\". Near the first half of the song, Baby Tate provides \"fluttering vocals\" in R&B style closing out of the first part. The beat then switches to a \"woozy, bass-bombed wobble that artfully weaves in elements from the song's first half\". During the second half of the song, JID returns with another verse, which has a darker approach and has been described as \"cut-throat\".\n\nThe official music video was released alongside the single. Directed by Mac Grant and Chad Tennies, the video opens with JID going into an older model vehicle. He starts rapping as he is driving, with women in the passenger seats of the car. In a garage, he raps while surrounded by women, and is seen atop a car. 21 Savage performs his verse standing next to JID. Baby Tate sings while lying on top of a car. When the beat switches, the video transitions to black and white. The scene changes to that of an \"eerie\" house, where JID raps the last verse. Multiple clones of him are also seen in the house. <a href=\"http://www.last.fm/music/JID/_/Surround+Sound+(feat.+21+Savage+&+Baby+Tate)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}