{
  "track": {
    "name": "Seven (feat. Latto) (Explicit Ver.)",
    "url": "https://www.last.fm/music/Jung+Kook/_/Seven+(feat.+Latto)+(Explicit+Ver.)",
    "duration": "183000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "797207",
    "playcount": "88799268",
    "artist": {
      "name": "Jung Kook",
      "mbid": "23c8056b-ee13-4cfc-a772-2f5292e35bb5",
      "url": "https://www.last.fm/music/Jung+Kook"
    },
    "album": {
      "artist": "Jung Kook",
      "title": "Seven (feat. Latto)",
      "url": "https://www.last.fm/music/Jung+Kook/Seven+(feat.+Latto)",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/fc5555019222111b6fe437143d230804.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/fc5555019222111b6fe437143d230804.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/fc5555019222111b6fe437143d230804.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/fc5555019222111b6fe437143d230804.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "horny",
          "url": "https://www.last.fm/tag/horny"
        },
        {
          "name": "Turn it off🔥🔥",
          "url": "https://www.last.fm/tag/Turn+it+off%F0%9F%94%A5%F0%9F%94%A5"
        },
        {
          "name": "k-pop",
          "url": "https://www.last.fm/tag/k-pop"
        },
        {
          "name": "explicit",
          "url": "https://www.last.fm/tag/explicit"
        }
      ]
    },
    "wiki": {
      "published": "14 Jul 2023, 07:20",
      "summary": "\"Seven\" is a song recorded by South Korean artist Jung Kook, a member of the globally renowned boy group BTS. It was released on July 14, 2023, as his solo debut. The track features American rapper Latto, adding a dynamic element to its sound. The song's lyrical theme revolves around expressing unconditional love and reassuring a partner of constant affection, with the hook declaring, \"I'll be lovin' you right, seven days a week.\" The genre of the song is influenced by UK Garage <a href=\"http://www.last.fm/music/Jung+Kook/_/Seven+(feat.+Latto)+(Explicit+Ver.)\">Read more on Last.fm</a>.",
      "content": "\"Seven\" is a song recorded by South Korean artist Jung Kook, a member of the globally renowned boy group BTS. It was released on July 14, 2023, as his solo debut. The track features American rapper Latto, adding a dynamic element to its sound. The song's lyrical theme revolves around expressing unconditional love and reassuring a partner of constant affection, with the hook declaring, \"I'll be lovin' you right, seven days a week.\" The genre of the song is influenced by UK Garage, blending its characteristic beats and rhythms with contemporary pop sensibilities.\n\nThe collaboration with Latto brought an exciting synergy to \"Seven\", combining Jung Kook's smooth vocal delivery with Latto's vibrant rap verses. This fusion of styles created a unique auditory experience that appeals to a broad audience, showcasing Jung Kook’s versatility as an artist. The production, handled by a team of renowned producers, incorporates elements of UK Garage, with its distinctive basslines and syncopated rhythms, seamlessly woven into the track's modern pop framework.\n\nUpon its release, \"Seven\" quickly garnered attention for its catchy melody and heartfelt lyrics. The song’s blend of love-centric themes and upbeat tempo has resonated with fans worldwide, making it a significant entry in Jung Kook's solo career. The track's success was further bolstered by its visually striking music video, which features vibrant scenes of Jung Kook and Latto exploring various urban landscapes, enhancing the song’s themes of love and connection.\n\nCritically, \"Seven\" has been praised for its innovative blend of genres and the chemistry between Jung Kook and Latto. Reviewers have highlighted the song’s infectious beat and the seamless integration of UK Garage elements, which distinguish it from other tracks in the contemporary pop landscape. The collaboration has been lauded for its dynamic interplay, with Jung Kook’s melodious voice complementing Latto's powerful rap verses, creating a track that is both catchy and deeply emotive.\n\nOverall, \"Seven\" stands as a testament to Jung Kook's growth and his ability to blend different musical influences seamlessly. Its success has not only showcased his talents as a solo artist but also highlighted his potential to explore diverse musical styles. With its infectious rhythm, heartfelt lyrics, and memorable collaboration with Latto, \"Seven\" has solidified its place as a standout track in Jung Kook's discography, further establishing him as a significant figure in the global music scene. <a href=\"http://www.last.fm/music/Jung+Kook/_/Seven+(feat.+Latto)+(Explicit+Ver.)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}