{
  "track": {
    "name": "El Tsurito",
    "url": "https://www.last.fm/music/Junior+H/_/El+Tsurito",
    "duration": "0",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "51774",
    "playcount": "736001",
    "artist": {
      "name": "Junior H",
      "url": "https://www.last.fm/music/Junior+H"
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "17 Sep 2023, 20:25",
      "summary": "La canción \"El Tsurito\" de Junior H, Gabito Ballesteros y Peso Pluma profundiza el mundo del narcotráfico y su relación con el gobierno. Inicia con un grupo de hombres inhalando cocaína. Se describen fuertemente armados y sin miedo a lo que pase. Al mismo momento llega la Marina que es a lo que hace referencia el verso \"parecía dulcería, Marinela nos caía\", Dulcería por la empresa de dulces Marinela. Intercambian palabras diciendo que tienen armas como AKs <a href=\"http://www.last.fm/music/Junior+H/_/El+Tsurito\">Read more on Last.fm</a>.",
      "content": "La canción \"El Tsurito\" de Junior H, Gabito Ballesteros y Peso Pluma profundiza el mundo del narcotráfico y su relación con el gobierno. Inicia con un grupo de hombres inhalando cocaína. Se describen fuertemente armados y sin miedo a lo que pase. Al mismo momento llega la Marina que es a lo que hace referencia el verso \"parecía dulcería, Marinela nos caía\", Dulcería por la empresa de dulces Marinela. Intercambian palabras diciendo que tienen armas como AKs, granadas y lanzagranadas para defenderse, y que mejor se resuelva con dinero, ya que les sobra. El sargento responde diciendo que así le gusta, que sepan que son de los mismos, haciendo referencia a que también están coludidos. El sargento termina diciendo que si los deja ir se tienen que \"arreglar\" dando a entender que habrá dinero de por medio. Al final de la canción uno de los hombres pide hablar con el encargado o que se los va a llevar el diablo, por lo que se entiende que habrá un enfrentamiento. En resumen, las letras describen las duras realidades de este mundo, incluyendo lidiar con la corrupción en las autoridades y la constante amenaza de violencia. Seguido de la alianza que tienen los cárteles con jefes del gobierno. <a href=\"http://www.last.fm/music/Junior+H/_/El+Tsurito\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}