{
  "track": {
    "name": "Moonlight",
    "mbid": "52c1af81-18f4-4e57-8d75-0b15c0206094",
    "url": "https://www.last.fm/music/Kali+Uchis/_/Moonlight",
    "duration": "187000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1321250",
    "playcount": "18699209",
    "artist": {
      "name": "Kali Uchis",
      "mbid": "d0c7656d-8169-4f77-9dbe-b8f24e40105d",
      "url": "https://www.last.fm/music/Kali+Uchis"
    },
    "album": {
      "artist": "Kali Uchis",
      "title": "Red Moon in Venus",
      "url": "https://www.last.fm/music/Kali+Uchis/Red+Moon+in+Venus",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/6044a8163acfc5cb5f7fd68501e54e11.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/6044a8163acfc5cb5f7fd68501e54e11.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/6044a8163acfc5cb5f7fd68501e54e11.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/6044a8163acfc5cb5f7fd68501e54e11.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "funk",
          "url": "https://www.last.fm/tag/funk"
        },
        {
          "name": "Neo-Soul",
          "url": "https://www.last.fm/tag/Neo-Soul"
        },
        {
          "name": "contemporary rnb",
          "url": "https://www.last.fm/tag/contemporary+rnb"
        },
        {
          "name": "rnb",
          "url": "https://www.last.fm/tag/rnb"
        },
        {
          "name": "Psychedelic Soul",
          "url": "https://www.last.fm/tag/Psychedelic+Soul"
        }
      ]
    },
    "wiki": {
      "published": "05 Jul 2023, 17:49",
      "summary": "\"Moonlight\" is an uplifting and dreamy love song that celebrates the freeing and euphoric feeling of being with someone special and being high together in the moonlight. The song opens with the desire to get high with a lover, seeking to escape and forget about the small talk and surface-level conversations of daily life. The lyrics \"Veo una muñeca cuando miro en el espejo\" (I see a doll when I look in the mirror) suggest an idealized and doll-like persona, indicating a desire to feel liberated and carefree. <a href=\"http://www.last.fm/music/Kali+Uchis/_/Moonlight\">Read more on Last.fm</a>.",
      "content": "\"Moonlight\" is an uplifting and dreamy love song that celebrates the freeing and euphoric feeling of being with someone special and being high together in the moonlight. The song opens with the desire to get high with a lover, seeking to escape and forget about the small talk and surface-level conversations of daily life. The lyrics \"Veo una muñeca cuando miro en el espejo\" (I see a doll when I look in the mirror) suggest an idealized and doll-like persona, indicating a desire to feel liberated and carefree.\n\nThe chorus repeats the desire to get high in the moonlight, using the phrase \"ride\" to connote a sense of ease, fluidity and transcendence. The song's protagonist enjoys feeling like a doll and looking \"dolly\", implying a desire to escape from the societal expectations and oppressive standards of beauty.\n\nThe second verse focuses on the connection between the protagonist and her lover, showing gratitude for being a priority in their life and appreciating the way they take care of her. The lyrics' meaning encourages a healthy, mutual expression of love and support, emphasizing that they both go out of their way for each other.\n\nThe bridge reaffirms the escapism of being together, expressing a feeling of \"higher and higher\" as the couple goes to the moon and leaves everything behind. In this context, the moon serves as a symbol of a new beginning, an escape to something new and exciting.\n\nOverall, \"Moonlight\" is a song that expresses the joy and freedom of being with someone you love and feel completely comfortable with, and the transformative and liberating power of sharing that bond while high in the moonlight. <a href=\"http://www.last.fm/music/Kali+Uchis/_/Moonlight\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}