{
  "track": {
    "name": "N95",
    "mbid": "983af624-24b8-41e2-a4ab-6be19a30b5f3",
    "url": "https://www.last.fm/music/Kendrick+Lamar/_/N95",
    "duration": "195000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1204492",
    "playcount": "19049706",
    "artist": {
      "name": "Kendrick Lamar",
      "mbid": "381086ea-f511-4aba-bdf9-71c753dc5077",
      "url": "https://www.last.fm/music/Kendrick+Lamar"
    },
    "album": {
      "artist": "Kendrick Lamar",
      "title": "Mr. Morale & the Big Steppers",
      "url": "https://www.last.fm/music/Kendrick+Lamar/Mr.+Morale+&+the+Big+Steppers",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/98050f67524ffee7af6edd314b767ac4.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/98050f67524ffee7af6edd314b767ac4.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/98050f67524ffee7af6edd314b767ac4.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/98050f67524ffee7af6edd314b767ac4.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "rap",
          "url": "https://www.last.fm/tag/rap"
        },
        {
          "name": "trap",
          "url": "https://www.last.fm/tag/trap"
        },
        {
          "name": "Conscious Hip Hop",
          "url": "https://www.last.fm/tag/Conscious+Hip+Hop"
        },
        {
          "name": "Hip-Hop",
          "url": "https://www.last.fm/tag/Hip-Hop"
        },
        {
          "name": "2022",
          "url": "https://www.last.fm/tag/2022"
        }
      ]
    },
    "wiki": {
      "published": "13 May 2022, 18:47",
      "summary": "“N95” is the second track on Kendrick Lamar’s fifth studio album Mr. Morale & The Big Steppers. The song’s title refers to N95 face masks, which have been one of the several key tools adopted to contrast the COVID-19 pandemic. Throughout this track, Kendrick addresses futile and superficial coping mechanisms, while pointing out at the facades a lot of people have acquired, which he also discussed on the previous song from the album, “United in Grief”. <a href=\"http://www.last.fm/music/Kendrick+Lamar/_/N95\">Read more on Last.fm</a>.",
      "content": "“N95” is the second track on Kendrick Lamar’s fifth studio album Mr. Morale & The Big Steppers. The song’s title refers to N95 face masks, which have been one of the several key tools adopted to contrast the COVID-19 pandemic. Throughout this track, Kendrick addresses futile and superficial coping mechanisms, while pointing out at the facades a lot of people have acquired, which he also discussed on the previous song from the album, “United in Grief”.\n\nSome fans interpreted phrases like “You’re back outside, but they still lied” and the refrain “take off” as the artist’s criticism of the way the U.S. government (first under Donald Trump, and then under Joe Biden) handled the state of emergency in response to the pandemic. However, in the wider context of the whole album, these references are more likely metaphors not just for people’s hypocrisy and “clout chase,” but for Kendrick’s own pretense and facade, as well, as he “took them off” in order to confront his “ugliness” and experience the first phases of his healing process.\n\nThis song’s bridge, alongside the first half of the third verse, were originally meant to appear on Baby Keem’s “vent”, but Kendrick ended up only providing vocals on the chorus.\n\nIn September of 2020, Kendrick was spotted filming a music video for this song, hovering over the beach. Two years later, hours after the album’s release, Dave Free teased the music video on his Twitter with a clip from the aforementioned shoot; Kendrick’s posture closely resembles that of Jesus Christ on the cross. This coincides with the religious themes found on Mr. Morale, as well as the cover art, where Kendrick is depicted wearing a crown of thorns.\n\nOn May 14, 2022, just a day after the release of Mr. Morale & The Big Steppers, the official music video was shared on YouTube.\n\nThe song debuted at #3 on the Billboard Hot 100 on May 23, 2022. <a href=\"http://www.last.fm/music/Kendrick+Lamar/_/N95\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}