{
  "track": {
    "name": "KICK BACK",
    "url": "https://www.last.fm/music/Kenshi+Yonezu/_/KICK+BACK",
    "duration": "194000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "471961",
    "playcount": "9363248",
    "artist": {
      "name": "Kenshi Yonezu",
      "url": "https://www.last.fm/music/Kenshi+Yonezu"
    },
    "album": {
      "artist": "Kenshi Yonezu",
      "title": "KICK BACK",
      "url": "https://www.last.fm/music/Kenshi+Yonezu/KICK+BACK",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/4c4e6c93455689e610c1e0789a91eef0.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/4c4e6c93455689e610c1e0789a91eef0.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/4c4e6c93455689e610c1e0789a91eef0.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/4c4e6c93455689e610c1e0789a91eef0.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "Chainsaw Man",
          "url": "https://www.last.fm/tag/Chainsaw+Man"
        },
        {
          "name": "j-pop",
          "url": "https://www.last.fm/tag/j-pop"
        },
        {
          "name": "anime",
          "url": "https://www.last.fm/tag/anime"
        },
        {
          "name": "J-rock",
          "url": "https://www.last.fm/tag/J-rock"
        },
        {
          "name": "Drum and bass",
          "url": "https://www.last.fm/tag/Drum+and+bass"
        }
      ]
    },
    "wiki": {
      "published": "17 Oct 2022, 14:44",
      "summary": "“KICK BACK” is a song by Japanese singer-songwriter and artist 米津玄師 (Kenshi Yonezu). It is served as the opening theme of チェンソーマン (Chainsaw Man). The title of the song references a phrase commonly used when operating a chainsaw, which is to describe “the sudden jolt by the chainsaw in an upward direction.” A kickback chainsaw is potentially very dangerous and is “one of the most common causes of accidents involving chainsaws.” <a href=\"http://www.last.fm/music/Kenshi+Yonezu/_/KICK+BACK\">Read more on Last.fm</a>.",
      "content": "“KICK BACK” is a song by Japanese singer-songwriter and artist 米津玄師 (Kenshi Yonezu). It is served as the opening theme of チェンソーマン (Chainsaw Man). The title of the song references a phrase commonly used when operating a chainsaw, which is to describe “the sudden jolt by the chainsaw in an upward direction.” A kickback chainsaw is potentially very dangerous and is “one of the most common causes of accidents involving chainsaws.”\n\nThe jacket image of the song and its details were announced on 20 September 2022 alongside the lineup for its ED. In addition, it is also revealed that Kenshi Yonezu drew the jacket image of the song. This is not the first time Kenshi has done so for his singles. He has been in charge of his own cover art since his early days in Nico, and is also the creator of the cover art for M.87 and Pale Blue.\n\nThe song is also the first song performed in Japanese to be certified Gold in the United States by the RIAA, achieving this feat in October 2023. <a href=\"http://www.last.fm/music/Kenshi+Yonezu/_/KICK+BACK\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}