{
  "track": {
    "name": "Big Energy",
    "mbid": "0f35f080-edf1-4353-b09d-a6b8cd1bc0cf",
    "url": "https://www.last.fm/music/Latto/_/Big+Energy",
    "duration": "172000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "308821",
    "playcount": "2216879",
    "artist": {
      "name": "Latto",
      "mbid": "355cc194-b8db-4af2-8678-c7ad54213f4b",
      "url": "https://www.last.fm/music/Latto"
    },
    "album": {
      "artist": "Latto",
      "title": "Big Energy",
      "url": "https://www.last.fm/music/Latto/Big+Energy",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/37e15b78c048b6f4809561b9be76da5c.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/37e15b78c048b6f4809561b9be76da5c.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/37e15b78c048b6f4809561b9be76da5c.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/37e15b78c048b6f4809561b9be76da5c.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "15 Mar 2022, 15:36",
      "summary": "\"Big Energy\" is a song by American rapper Latto, released through Streamcut and RCA Records on September 24, 2021. It was released as the lead single from Latto's second studio album. \"Big Energy\" became Latto's highest-charting song on the Billboard Hot 100, so far peaking at number 3.\n\nIn May 2021, Latto released the song \"The Biggest\" following the announcement of her stage name changing from Mulatto to Latto. \"Big Energy\" was first premiered at the 2021 MTV Video Music Awards <a href=\"http://www.last.fm/music/Latto/_/Big+Energy\">Read more on Last.fm</a>.",
      "content": "\"Big Energy\" is a song by American rapper Latto, released through Streamcut and RCA Records on September 24, 2021. It was released as the lead single from Latto's second studio album. \"Big Energy\" became Latto's highest-charting song on the Billboard Hot 100, so far peaking at number 3.\n\nIn May 2021, Latto released the song \"The Biggest\" following the announcement of her stage name changing from Mulatto to Latto. \"Big Energy\" was first premiered at the 2021 MTV Video Music Awards, where Latto performed three songs in short segments throughout the show.\n\nThe song was produced by Dr. Luke. It heavily samples the 1981 single, \"Genius of Love\" by Tom Tom Club, one of the most sampled rhythm tracks of the 1980s, particularly within the hip-hop and R&B genre. Notable sample uses include Dr. Jeckyl & Mr. Hyde's \"Genius Rap\" in 1981; Grandmaster Flash and the Furious Five's \"It's Nasty\" in 1982; Mariah Carey's \"Fantasy\" in 1995, and The X-Ecutioners' \"Genius of Love 2002\" in 2002.\n\n\"Big Energy\" debuted at number 88 on the Billboard Hot 100, week dated November 24, 2021, becoming Latto's highest-charting song on the chart since \"Bitch from da Souf\", which peaked at number 95 in 2020. The song has since peaked at number 3, becoming Latto's first top 40 hit. The song also reached number 1 on the US Rhythmic chart.\n\nThe song's video was directed by Arrad. It was released alongside the song. <a href=\"http://www.last.fm/music/Latto/_/Big+Energy\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}