{
  "track": {
    "name": "INDUSTRY BABY (feat. Jack Harlow)",
    "url": "https://www.last.fm/music/Lil+Nas+X/_/INDUSTRY+BABY+(feat.+Jack+Harlow)",
    "duration": "212000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1238842",
    "playcount": "17629716",
    "artist": {
      "name": "Lil Nas X",
      "mbid": "0b30341b-b59d-4979-8130-b66c0e475321",
      "url": "https://www.last.fm/music/Lil+Nas+X"
    },
    "toptags": {
      "tag": [
        {
          "name": "trap",
          "url": "https://www.last.fm/tag/trap"
        },
        {
          "name": "rap",
          "url": "https://www.last.fm/tag/rap"
        },
        {
          "name": "Hip-Hop",
          "url": "https://www.last.fm/tag/Hip-Hop"
        },
        {
          "name": "2021",
          "url": "https://www.last.fm/tag/2021"
        },
        {
          "name": "2020s",
          "url": "https://www.last.fm/tag/2020s"
        }
      ]
    },
    "wiki": {
      "published": "27 Jul 2021, 03:53",
      "summary": "Lil Nas X recruits Louisville native Jack Harlow for “INDUSTRY BABY,” a boisterous song where the duo rap about their fame and success, blowing up, and their newfound statuses in the rap game. The title plays on the term “industry plant,” which are people backed by a major label at the start, but play into an image of being organic and all by themselves.\n\nThe song was first teased on October 22, 2020 with a snippet showing Nas X dancing to the song with producer duo, Take a Daytrip. <a href=\"http://www.last.fm/music/Lil+Nas+X/_/INDUSTRY+BABY+(feat.+Jack+Harlow)\">Read more on Last.fm</a>.",
      "content": "Lil Nas X recruits Louisville native Jack Harlow for “INDUSTRY BABY,” a boisterous song where the duo rap about their fame and success, blowing up, and their newfound statuses in the rap game. The title plays on the term “industry plant,” which are people backed by a major label at the start, but play into an image of being organic and all by themselves.\n\nThe song was first teased on October 22, 2020 with a snippet showing Nas X dancing to the song with producer duo, Take a Daytrip. A demo version of the song leaked in full late June 2021, using a slightly different instrumental and containing no feature. A week before its release, the rapper tweeted a promise, claiming he would drop “INDUSTRY BABY” once the June 2019 track, “Panini,” hit 400 Million views on YouTube.\n\nThe music video hit the goal shortly after and Lil Nas announced the song on July 19th, through a trailer portraying him being sentenced to jail in relation to his Nike court case. The trailer revealed the release date, producers, and Jack Harlow as a featured artist. \nIt was released on July 23, 2021, through Columbia Records. The song features co-production by American rapper and record producer Kanye West and production duo Take a Daytrip. It serves as the third single from Lil Nas X's debut studio album Montero (2021). “INDUSTRY BABY” debuted at #2 on the Hot 100 during the charting week of August 7, 2021. It goes down as Lil Nas X’s 4th top 10 hit and Harlow’s 2nd. The song reached the chart’s top spot during the week ending October 23. It is Lil Nas X’s third #1 Harlow’s first.\n\nIt also earned Kanye West’s 22nd top 10 hit as a producer.\n\nOn January 10, 2023, “INDUSTRY BABY” was certified 6x platinum by the RIAA. <a href=\"http://www.last.fm/music/Lil+Nas+X/_/INDUSTRY+BABY+(feat.+Jack+Harlow)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}