{
  "track": {
    "name": "THATS WHAT I WANT",
    "mbid": "d796a70d-65c6-4ee8-bec7-1a3979c6cb78",
    "url": "https://www.last.fm/music/Lil+Nas+X/_/THATS+WHAT+I+WANT",
    "duration": "144000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "811209",
    "playcount": "9196334",
    "artist": {
      "name": "Lil Nas X",
      "mbid": "0b30341b-b59d-4979-8130-b66c0e475321",
      "url": "https://www.last.fm/music/Lil+Nas+X"
    },
    "album": {
      "artist": "Various Artists",
      "title": "MuchDance 2022",
      "url": "https://www.last.fm/music/Various+Artists/MuchDance+2022",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/ce8034259808e682dcb09db43ec92535.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/ce8034259808e682dcb09db43ec92535.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/ce8034259808e682dcb09db43ec92535.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/ce8034259808e682dcb09db43ec92535.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "Hip-Hop",
          "url": "https://www.last.fm/tag/Hip-Hop"
        },
        {
          "name": "pop rock",
          "url": "https://www.last.fm/tag/pop+rock"
        },
        {
          "name": "rap",
          "url": "https://www.last.fm/tag/rap"
        },
        {
          "name": "2021",
          "url": "https://www.last.fm/tag/2021"
        }
      ]
    },
    "wiki": {
      "published": "20 Sep 2021, 14:19",
      "summary": "\"That's What I Want\" is a single by American rapper and singer Lil Nas X, released on September 17, 2021, as part of his debut studio album, Montero. The track was produced by Omer Fedi, Roy Lenzo, and Take a Daytrip, and stands out as one of the more emotionally raw and melodic songs on the album. It blends elements of pop rock with trap, featuring jangly guitar riffs and a catchy chorus. Lyrically, it focuses on the universal desire for love, companionship <a href=\"http://www.last.fm/music/Lil+Nas+X/_/THATS+WHAT+I+WANT\">Read more on Last.fm</a>.",
      "content": "\"That's What I Want\" is a single by American rapper and singer Lil Nas X, released on September 17, 2021, as part of his debut studio album, Montero. The track was produced by Omer Fedi, Roy Lenzo, and Take a Daytrip, and stands out as one of the more emotionally raw and melodic songs on the album. It blends elements of pop rock with trap, featuring jangly guitar riffs and a catchy chorus. Lyrically, it focuses on the universal desire for love, companionship, and vulnerability, themes that resonate strongly with Lil Nas X's openly queer identity.\n\nThe song received critical acclaim for its emotional honesty and pop sensibility. Critics praised Lil Nas X's ability to fuse personal storytelling with mainstream appeal, further establishing him as a dynamic force in pop and hip-hop music. \"That's What I Want\" also performed well commercially, peaking at number 8 on the Billboard Hot 100 and charting in several other countries including the UK, Canada, and Australia. Its success was buoyed by strong radio play and streaming numbers.\n\nThe accompanying music video, directed by Stillz, plays a significant role in the song’s impact. It features Lil Nas X as a football player who falls in love with a teammate, only to discover that the teammate has a secret life with a woman. The visual narrative includes romantic and intimate scenes and concludes with Lil Nas X walking down the aisle in a wedding dress, ultimately standing alone at the altar. The video was widely discussed for its bold representation of queer love and heartbreak.\n\n\"That's What I Want\" has been performed at numerous high-profile events, including Saturday Night Live and the iHeartRadio Music Festival. Each performance further emphasized the song's emotional intensity and Lil Nas X’s charisma as a live performer. The track also found a second life on platforms like TikTok, where fans used it to soundtrack videos about relationships and longing.\n\nOverall, \"That's What I Want\" reinforces Lil Nas X’s reputation for breaking musical and cultural boundaries. The song’s candid lyrics, genre-blending production, and unapologetic queerness have contributed to its standing as a standout track from Montero. It encapsulates themes of love, pain, and identity, reflecting the artist’s broader mission to challenge norms and create space for authentic self-expression in pop music. <a href=\"http://www.last.fm/music/Lil+Nas+X/_/THATS+WHAT+I+WANT\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}