{
  "track": {
    "name": "All My Life (feat. J. Cole)",
    "url": "https://www.last.fm/music/Lil+Durk/_/All+My+Life+(feat.+J.+Cole)",
    "duration": "223000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "351154",
    "playcount": "3057409",
    "artist": {
      "name": "Lil Durk",
      "mbid": "c9cd225b-4883-428e-82c2-73e0b6282fb6",
      "url": "https://www.last.fm/music/Lil+Durk"
    },
    "album": {
      "artist": "Lil Durk",
      "title": "All My Life (feat. J. Cole)",
      "url": "https://www.last.fm/music/Lil+Durk/All+My+Life+(feat.+J.+Cole)",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/07d84721186d35ba7f406da4d6188870.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/07d84721186d35ba7f406da4d6188870.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/07d84721186d35ba7f406da4d6188870.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/07d84721186d35ba7f406da4d6188870.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "26 May 2023, 19:33",
      "summary": "“All My Life,” the J. Cole-accompanied track is the lead single to Lil Durk’s eighth full-length studio album, Almost Healed. The track’s warm melody and the addition of the choir in the chorus support the song’s positive purpose.\n\nIn the track, Durk speaks about the hardships and endeavors he’s come across throughout his career as a rapper and his life as a whole. J. Cole’s addition to the track adds a Hip-Hop feeling to the track’s harmonious value. <a href=\"http://www.last.fm/music/Lil+Durk/_/All+My+Life+(feat.+J.+Cole)\">Read more on Last.fm</a>.",
      "content": "“All My Life,” the J. Cole-accompanied track is the lead single to Lil Durk’s eighth full-length studio album, Almost Healed. The track’s warm melody and the addition of the choir in the chorus support the song’s positive purpose.\n\nIn the track, Durk speaks about the hardships and endeavors he’s come across throughout his career as a rapper and his life as a whole. J. Cole’s addition to the track adds a Hip-Hop feeling to the track’s harmonious value. Furthermore, Cole complements the positive meaning behind the track—overcoming one’s obstacles in life—due to Cole’s notability for rapping about positivity and realness.\n\nThe Dr. Luke-produced instrumental features a sympathetic piano beat alongside a children’s choir in the song’s chorus. The addition of the choir adds a Gospel value to the track, aiding the song’s positive image.\n\nReleased alongside the track, the Steve Cannon-directed music video sees Durk and Cole surrounded by children in a low-income neighborhood, playing into Durk’s newly founded Neighborhood Heroes Foundation.\n\n“All My Life” debuted at #2 on the Billboard Hot 100 during the chart week ending May 27, 2023. The track debuted with 30.9 million streams, 10.8 million radio audience, and 3,000 units sold.\n\nIt marks Durk’s second #2 following his appearance on “Laugh Now Cry Later,” alongside his first solo, and it marks Cole’s second #2 following “​​m y . l i f e.”\n\n“All My Life” marks the rappers' first collaboration together. <a href=\"http://www.last.fm/music/Lil+Durk/_/All+My+Life+(feat.+J.+Cole)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}