{
  "track": {
    "name": "Watch This - ARIZONATEARS Pluggnb Remix",
    "mbid": "296c6296-570c-471b-ace2-bd1d0f6bc3f6",
    "url": "https://www.last.fm/music/Lil+Uzi+Vert/_/Watch+This+-+ARIZONATEARS+Pluggnb+Remix",
    "duration": "163000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "646233",
    "playcount": "7284780",
    "artist": {
      "name": "Lil Uzi Vert",
      "mbid": "8837b875-3689-4646-b3fd-d8b53815c7a8",
      "url": "https://www.last.fm/music/Lil+Uzi+Vert"
    },
    "toptags": {
      "tag": [
        {
          "name": "pluggnb",
          "url": "https://www.last.fm/tag/pluggnb"
        },
        {
          "name": "hip hop",
          "url": "https://www.last.fm/tag/hip+hop"
        },
        {
          "name": "pop rap",
          "url": "https://www.last.fm/tag/pop+rap"
        },
        {
          "name": "queer",
          "url": "https://www.last.fm/tag/queer"
        },
        {
          "name": "trap",
          "url": "https://www.last.fm/tag/trap"
        }
      ]
    },
    "wiki": {
      "published": "24 Jan 2024, 13:19",
      "summary": "“Watch This (Pluggnb Remix)” is a popular song by American rapper Lil Uzi Vert and producer ARIZONATEARS. The original song “Watch This” leaked in April of 2022, which was long awaited by many fans.\n\nIn August of 2022, ARIZONATEARS, a producer known for his Pluggnb style, remixed the song and released it on SoundCloud. The remix quickly gained traction on social media platforms like TikTok and Instagram, with users creating videos set to the song. <a href=\"http://www.last.fm/music/Lil+Uzi+Vert/_/Watch+This+-+ARIZONATEARS+Pluggnb+Remix\">Read more on Last.fm</a>.",
      "content": "“Watch This (Pluggnb Remix)” is a popular song by American rapper Lil Uzi Vert and producer ARIZONATEARS. The original song “Watch This” leaked in April of 2022, which was long awaited by many fans.\n\nIn August of 2022, ARIZONATEARS, a producer known for his Pluggnb style, remixed the song and released it on SoundCloud. The remix quickly gained traction on social media platforms like TikTok and Instagram, with users creating videos set to the song.\n\nThe Pluggnb style is characterized by its use of distorted 808 basslines and dark, atmospheric melodies. ARIZONATEARS' remix of “Watch This” incorporates these elements, giving the song a new, edgier vibe.\n\nThe remix’s popularity led to its eventual release on streaming platforms like Spotify and Apple Music. It has since become a popular song of of Lil Uzi Vert, with over 141 million streams on Spotify alone. The original song is still unreleased, and it is not clear if that version will ever see an official release. <a href=\"http://www.last.fm/music/Lil+Uzi+Vert/_/Watch+This+-+ARIZONATEARS+Pluggnb+Remix\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}