{
  "track": {
    "name": "Faint",
    "mbid": "7d0f2d5a-bdec-3aaa-b375-58736a08cadc",
    "url": "https://www.last.fm/music/Linkin+Park/_/Faint",
    "duration": "261000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "2154335",
    "playcount": "25851309",
    "artist": {
      "name": "Linkin Park",
      "mbid": "f59c5520-5f46-4d2c-b2c4-822eabf53419",
      "url": "https://www.last.fm/music/Linkin+Park"
    },
    "album": {
      "artist": "Linkin Park",
      "title": "Meteora",
      "url": "https://www.last.fm/music/Linkin+Park/Meteora",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/fee069a98672ac3719f6c766ff6f0f9c.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/fee069a98672ac3719f6c766ff6f0f9c.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/fee069a98672ac3719f6c766ff6f0f9c.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/fee069a98672ac3719f6c766ff6f0f9c.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "Nu Metal",
          "url": "https://www.last.fm/tag/Nu+Metal"
        },
        {
          "name": "rock",
          "url": "https://www.last.fm/tag/rock"
        },
        {
          "name": "Linkin Park",
          "url": "https://www.last.fm/tag/Linkin+Park"
        },
        {
          "name": "alternative rock",
          "url": "https://www.last.fm/tag/alternative+rock"
        },
        {
          "name": "alternative",
          "url": "https://www.last.fm/tag/alternative"
        }
      ]
    },
    "wiki": {
      "published": "03 Dec 2022, 13:48",
      "summary": "\"Faint\" is a song by American rock band Linkin Park from their second studio album, Meteora. The song was released as the album's second single on June 9, 2003, and is the seventh track. It entered the top thirty on the majority of the charts it appeared on. On the Hot 100, it peaked at No. 48. The song reached No. 1 on the US Modern Rock Tracks, becoming the band's third number-one hit on the chart. The song would later be featured on the group's mashup EP with Jay-Z <a href=\"http://www.last.fm/music/Linkin+Park/_/Faint\">Read more on Last.fm</a>.",
      "content": "\"Faint\" is a song by American rock band Linkin Park from their second studio album, Meteora. The song was released as the album's second single on June 9, 2003, and is the seventh track. It entered the top thirty on the majority of the charts it appeared on. On the Hot 100, it peaked at No. 48. The song reached No. 1 on the US Modern Rock Tracks, becoming the band's third number-one hit on the chart. The song would later be featured on the group's mashup EP with Jay-Z, Collision Course, where it was mashed up with lyrics of the song Nigga What from Vol. 2... Hard Knock Life.\n\nIn May 2025, \"Faint\" became the band's fifth song to surpass one billion streams on Spotify.\n\nThis song was released as two singles, \"Faint 1\" and \"Faint 2.\" They differed in cover color and track listing (\"Faint 1\" is blue, and \"Faint 2\" is a brownish-green mixture). \"Faint 1\" was also released as a Canadian version that includes the tracks, but does not include the music video. \"Faint 1\" lists the length of \"Lying from You\" as 3:43 but is actually 3:04. \"One Step Closer\", on \"Faint 2\", is 3:43 long. A promotional sampler was given to members of the street team and some members of the LPU, the band's official fan club. A demo for the song can be found on the Underground 9.0 Fan Club release. It features Mike Shinoda rapping with different lyrics, with only some backing input from Chester Bennington. A live version of the track was featured as a b-side for \"What I've Done\".\nThe success of this single, and the success of Linkin Park's \"Numb/Encore\" mashup with Jay-Z, led MTV to produce a mashup of \"Faint\" with \"Toxic\" by Britney Spears. This was done by DJ Rob Boskamp and can be found on MTV's MTV Mash Up - Amazing Remixes! CD.\nThe intro is a reversed sample from \"Tania Meets Klebb\" from the James Bond film soundtrack From Russia With Love.\n\nThe video, directed by Mark Romanek and shot in downtown Los Angeles, consists of the band performing in front of an audience and a floodlight. The audience consisted of members from the LPU. Almost the entire video is shot from behind the band, allowing the strong lighting to portray them in silhouettes. Therefore, the faces of the band are not shown throughout most of the video, except at the final chorus where the band is then shown from the front. They perform in front of a derelict building structure with graffiti, such as a monstrous version of the Hybrid Theory Soldier and some Linkin Park symbols.\n\n\"Faint\" was officially released to US radio on July 1, 2003. The song reached the top twenty on the Hot 100 Recurrent Airplay, and the following week it debuted on the Hot 100, the official US chart. \"Faint\" peaked at number forty-eight in its eighth week and remained on the chart until its twentieth week. The song entered the top twenty on the majority of the Billboard charts on which it appeared. \"Faint\" proved popular on Modern Rock Tracks radio, attaining the number one position on that chart for six weeks (with 37 weeks on the chart), and peaked at number two for two weeks on the US Mainstream Rock Tracks.\n\"Faint\" reached the top thirty on the Canadian Singles Chart where it peaked at 21.\nThe song was released in Australia, Europe and New Zealand on July 22, 2003. \"Somewhere I Belong\" reached the UK top ten, while \"Faint\" reached the top twenty. \"Faint\" continued the trend of lower-charting singles when it debuted and peaked at number fifteen, and remained in the chart for 8 weeks. \"Faint\" peaked at number twenty-five on the Australian Singles Chart and stayed at its peak for two weeks.\n\"Faint\" reached 67 on the Japanese singles chart and 48 on the Eurochart Hot 100 Singles and it would also peak at forty in seven countries and reached the top twenty in the United Kingdom and Spain. It was a moderate top ten success on the LAUNCH Music Videos Top 100.\nIn September 2023, for the 35th anniversary of Modern Rock Tracks (which by then had been renamed to Alternative Airplay), Billboard ranked \"Faint\" at number 92 on its list of the 100 most successful songs in the chart's history.\n\n\"Faint\" is widely regarded as one of Linkin Park's best songs. In 2017, Billboard ranked the song number two on their list of the 15 greatest Linkin Park songs, and in 2021, Kerrang ranked the song number three on their list of the 20 greatest Linkin Park songs. <a href=\"http://www.last.fm/music/Linkin+Park/_/Faint\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}