{
  "track": {
    "name": "Royals",
    "url": "https://www.last.fm/music/Lorde/_/Royals",
    "duration": "190000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1988201",
    "playcount": "20564237",
    "artist": {
      "name": "Lorde",
      "mbid": "8e494408-8620-4c6a-82c2-c2ca4a1e4f12",
      "url": "https://www.last.fm/music/Lorde"
    },
    "album": {
      "artist": "Lorde",
      "title": "Pure Heroine",
      "url": "https://www.last.fm/music/Lorde/Pure+Heroine",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/1c3f14fba3dececc85d10d7252e68b93.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/1c3f14fba3dececc85d10d7252e68b93.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/1c3f14fba3dececc85d10d7252e68b93.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/1c3f14fba3dececc85d10d7252e68b93.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "indie",
          "url": "https://www.last.fm/tag/indie"
        },
        {
          "name": "electronic",
          "url": "https://www.last.fm/tag/electronic"
        },
        {
          "name": "2013",
          "url": "https://www.last.fm/tag/2013"
        },
        {
          "name": "Lorde",
          "url": "https://www.last.fm/tag/Lorde"
        }
      ]
    },
    "wiki": {
      "published": "09 Oct 2013, 21:05",
      "summary": "\"Royals\" is a song by Lorde, released on November 22, 2012 on SoundCloud and on March 8, 2013 in online stores in New Zealand and Australia as the lead single from her debut extended play, The Love Club EP, and from her debut album, Pure Heroine. Its music video, directed by Joel Kefali, was released on May 12, 2013.\n\nLorde wrote the song in half an hour at her home in July 2012 and during a school break, she and Joel Little recorded the song at Golden Age Studios in Auckland in one week. <a href=\"http://www.last.fm/music/Lorde/_/Royals\">Read more on Last.fm</a>.",
      "content": "\"Royals\" is a song by Lorde, released on November 22, 2012 on SoundCloud and on March 8, 2013 in online stores in New Zealand and Australia as the lead single from her debut extended play, The Love Club EP, and from her debut album, Pure Heroine. Its music video, directed by Joel Kefali, was released on May 12, 2013.\n\nLorde wrote the song in half an hour at her home in July 2012 and during a school break, she and Joel Little recorded the song at Golden Age Studios in Auckland in one week. Lorde and Little wrote songs for her debut EP in three weeks. The title \"Royals\" came to Lorde after she saw a 1976 photograph of Kansas City Royals baseball player George Brett signing baseballs with his team's name \"Royals\" emblazoned on his shirt. She said during a VH1 interview in September 2013, \"It was just that word. It's really cool.\"\n\nIt's a song about rejecting the luxurious and materialistic lifestyle of the wealthy and elite, and embracing a life that is more humble and simpler. The lyrics portray the singer and her friends as rejecting the indulgences of those in power, such as Cristal, Maybach, jet planes, and diamonds. Instead, they choose to focus on creating their own joy and success through meaningful moments, such as counting their dollars on a train to the party, and being \"bigger than they ever dreamed\". This theme of setting one’s own standards for a successful life is echoed in the chorus: \"And we'll never be royals/It don't run in our blood/That kind of luxe just ain't for us/We crave a different kind of buzz\". Lorde encourages listeners to be unapologetic in their choices and find their own idea of what it means to be \"royal\".\n\nSince its release in the US, \"Royals\" has broken multiple records, many of them a result of Lorde's young age. At 16 years and 11 months old, Lorde became the youngest female artist in 26 years to top the Billboard Hot 100 since 16-year-old Tiffany topped the chart with I Think We're Alone Now in 1987. It also made Lorde the first New Zealand act to top the Billboard Hot 100 as a lead artist and the youngest musician to top the chart with a song written by the performer, surpassing Soulja Boy, who achieved this at age 17 with [track artist=Soulja Boy[/track]Crank That (Soulja Boy in 2007. Lorde became the youngest artist whose song stayed at number one for more than eight weeks, a feat that was previously achieved by 13-year-old hip-hop duo Kris Kross with Jump in 1992. It also made Lorde the youngest solo artist to top the chart since Mario who, at 18 years old, topped the chart with Let Me Love You in 2005.\n\nIn August 2013, Lorde became the second ever solo female artist to top the Billboard Alternative Songs chart, since Tracy Bonham in 1996. \"Royals\" holds the record for longest spell at number one on the Billboard Alternative Songs chart by a woman, surpassing Alanis Morissette's You Oughta Know (1995), which spent five weeks at number one. The song topped the US Billboard Hot 100 chart for nine consecutive weeks and was the top-selling song by a female artist in 2013. It was certified fourteen-times Platinum in 2023 for selling over 14 million copies in the country.\n\nOn 15 October 2013, co-writers Lorde and Joel Little won the APRA Silver Scroll award, which honours original New Zealand songwriting. At the 56th Annual Grammy Awards, \"Royals\" won Song Of The Year and Best Pop Solo Performance and was nominated for Record Of The Year. Lorde was the youngest New Zealander to win a Grammy and the third-youngest performer overall. \"Royals\" also won Single Of The Year at the 2013 New Zealand Music Awards, and the Most Performed Songs distinction at the ASCAP Pop Awards. It received a nomination for Song Of The Year at the BBC Music Awards and Best Track at the Q Awards. <a href=\"http://www.last.fm/music/Lorde/_/Royals\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}