{
  "track": {
    "name": "Lost on You",
    "mbid": "0f9e8343-97bb-4690-918d-4225602e83d4",
    "url": "https://www.last.fm/music/LP/_/Lost+on+You",
    "duration": "269000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "509944",
    "playcount": "5214399",
    "artist": {
      "name": "LP",
      "mbid": "6301cda3-f614-4501-a1c4-b19b27c2efac",
      "url": "https://www.last.fm/music/LP"
    },
    "album": {
      "artist": "LP",
      "title": "Lost on You",
      "url": "https://www.last.fm/music/LP/Lost+on+You",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/d218ee11c008eb2705857d66d51ab576.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/d218ee11c008eb2705857d66d51ab576.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/d218ee11c008eb2705857d66d51ab576.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/d218ee11c008eb2705857d66d51ab576.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "Masterpiece",
          "url": "https://www.last.fm/tag/Masterpiece"
        },
        {
          "name": "indie rock",
          "url": "https://www.last.fm/tag/indie+rock"
        },
        {
          "name": "Love",
          "url": "https://www.last.fm/tag/Love"
        },
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "love at first listen",
          "url": "https://www.last.fm/tag/love+at+first+listen"
        }
      ]
    },
    "wiki": {
      "published": "01 Jul 2023, 17:07",
      "summary": "\"Lost on You\" is a song by American singer and songwriter LP (Laura Pergolizzi), released as the lead single from her 2016 album Lost on You. Known for her distinctive voice and emotionally raw songwriting, LP's \"Lost on You\" became a breakout hit, showcasing her unique blend of pop, folk, and rock influences. The song garnered widespread attention for its heartfelt lyrics, captivating melody, and LP's powerful vocal performance.\n\nTitle Song\n\"Lost on You\" is one of LP’s signature tracks, marking a major point in her career. <a href=\"http://www.last.fm/music/LP/_/Lost+on+You\">Read more on Last.fm</a>.",
      "content": "\"Lost on You\" is a song by American singer and songwriter LP (Laura Pergolizzi), released as the lead single from her 2016 album Lost on You. Known for her distinctive voice and emotionally raw songwriting, LP's \"Lost on You\" became a breakout hit, showcasing her unique blend of pop, folk, and rock influences. The song garnered widespread attention for its heartfelt lyrics, captivating melody, and LP's powerful vocal performance.\n\nTitle Song\n\"Lost on You\" is one of LP’s signature tracks, marking a major point in her career. The song combines poignant, introspective lyrics with a rich, soulful melody. The title itself refers to the theme of emotional miscommunication and regret, exploring the feeling of giving love and care to someone who doesn’t recognize or appreciate it. The track is often viewed as a personal reflection on the complexity of relationships, capturing feelings of loss and vulnerability.\n\nBackground\n\"Lost on You\" was written by LP and Mike Del Rio, who also co-produced the track. The song was released in 2016 as the lead single from her album Lost on You, which received critical acclaim for its emotional depth and eclectic mix of genres, including pop, folk, and rock.\n\nLP, who had already gained recognition as a songwriter for other artists, was looking to establish her own unique musical identity with her album Lost on You. The song quickly became a standout track, gaining both commercial success and praise for its emotionally charged lyrics and LP’s unique vocal delivery.\n\n\"Lost on You\" was initially released in Europe, where it gained significant traction, and it later reached wider international audiences. The song was lauded for its vulnerability and honesty, and its universal themes of love and loss made it relatable to many listeners.\n\nMusical Style\n\"Lost on You\" blends pop, folk, and rock elements, characterized by its haunting melody and emotional intensity. The track opens with a delicate, piano-driven intro before building into a full, lush arrangement with prominent guitar lines and atmospheric instrumentation. The song’s mix of acoustic and electronic elements gives it a timeless feel, while LP’s powerful, raspy voice provides an emotional anchor throughout.\n\nThe song's slow, deliberate pace allows for deep emotional resonance, with each instrument complementing LP's raw and soulful delivery. The music gradually intensifies as the song progresses, emphasizing the rising emotion in the lyrics. The combination of folk-inspired instrumentation and pop sensibilities makes \"Lost on You\" accessible while maintaining an authenticity that resonates with listeners.\n\nLyrical Analysis\nThe lyrics of \"Lost on You\" express feelings of regret, miscommunication, and unrequited love. The narrator reflects on a relationship where their love and efforts seem to have been unappreciated, symbolized in the phrase \"lost on you.\" The song addresses the pain of giving everything to someone and realizing that it wasn’t enough or that it wasn’t fully recognized.\n\nThe recurring refrain, \"And I’d be lying if I said I was fine,\" captures the vulnerability and heartbreak at the core of the song, expressing emotional turmoil and the realization that the effort invested in the relationship was ultimately in vain. Despite the song’s sorrowful themes, LP’s performance is full of grit and determination, making the message of loss and heartache feel empowering rather than purely sorrowful.\n\nThe song's raw, honest lyrics connect with listeners on a deeply emotional level, as it speaks to the universal experience of loving someone who may not return or acknowledge that love.\n\nChart Performance\n\"Lost on You\" was a commercial success, particularly in Europe, where it became LP's breakout hit. The song charted highly across several countries:\n\nFrance: The song reached #1 on the SNEP French Singles Chart, where it stayed for several weeks.\n\nItaly: It was also a major hit in Italy, reaching #2 on the FIMI Italian Singles Chart.\n\nGermany: \"Lost on You\" charted in the top 10 on the German Singles Chart.\n\nBillboard Adult Alternative Songs (US): It reached #8, marking a significant breakthrough for LP in the American market.\n\nDespite the song’s success in Europe and the United States, it didn’t crack the mainstream charts in all countries, but it was widely regarded as LP’s breakout song and helped establish her as a unique and compelling voice in the music industry.\n\nLive Performance\n\"Lost on You\" became one of LP’s most prominent tracks during her live performances. The song’s emotional depth and the rawness of LP's vocal delivery made it a standout moment in her concerts, often performed with minimalistic arrangements to allow the power of her voice and the lyrics to take center stage.\n\nLP’s live performances of \"Lost on You\" are marked by her ability to connect with the audience, using her expressive vocal technique and stage presence to convey the emotion of the song. The track’s slow, deliberate build in live shows gives the audience a chance to experience the growing intensity of the song, making it a key moment in her setlists.\n\nPersonnel / Band Members\nLP (Laura Pergolizzi) – Lead vocals, songwriting\n\nMike Del Rio – Co-writer, co-producer\n\nSession musicians – Various musicians contributed to the instrumentation, including guitar, drums, and piano.\n\nReception\n\"Lost on You\" received widespread critical acclaim for its emotional intensity and LP’s distinctive vocal performance. Critics praised the song for its vulnerability, rawness, and the mix of folk, pop, and rock influences. The song was also lauded for its lyrical depth, with many seeing it as a powerful statement on love, loss, and personal growth.\n\nThe song’s success in Europe helped LP gain a significant following, and it also introduced her to American audiences. Critics highlighted the track’s authenticity, with some comparing LP's voice to iconic performers such as Stevie Nicks and Janis Joplin due to its unique rasp and emotional power.\n\nTrivia\n\"Lost on You\" was initially released in Europe in 2015, but it gained international success in 2016, making it one of LP’s biggest hits.\n\nThe song’s success marked a turning point in LP’s career, establishing her as a significant figure in the indie pop scene.\n\nThe music video for \"Lost on You\" has been widely praised for its emotional visuals and intimate aesthetic, which matches the song’s themes of heartbreak and longing.\n\nLP’s raspy, emotive voice and her ability to convey deep emotion through her singing made \"Lost on You\" stand out as one of her signature tracks.\n\nLegacy\n\"Lost on You\" remains one of LP’s defining songs, celebrated for its honesty, emotional depth, and unique vocal style. The song is often regarded as her breakthrough hit, garnering her widespread attention and recognition, particularly in Europe.\n\nThe track’s success helped LP carve out a space for herself in the competitive pop and folk-rock genres, and it remains a fan favorite in her catalog. \"Lost on You\" is frequently included in compilations of modern pop and indie tracks, and it continues to be a highlight in LP's live performances.\n\nOver the years, the song has been praised for its timeless themes of love, loss, and emotional resilience, making it a staple of LP’s musical legacy. <a href=\"http://www.last.fm/music/LP/_/Lost+on+You\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}