{
  "track": {
    "name": "Despacito - Remix",
    "url": "https://www.last.fm/music/Luis+Fonsi/_/Despacito+-+Remix",
    "duration": "0",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "488252",
    "playcount": "3062329",
    "artist": {
      "name": "Luis Fonsi",
      "url": "https://www.last.fm/music/Luis+Fonsi"
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "22 Jun 2017, 03:40",
      "summary": "A remix version of \"Despacito\" featuring Canadian singer Justin Bieber was released digitally on April 17, 2017. His Spanish performance of the chorus became the first time he sang in that language. It is the first collaboration between Luis Fonsi and Daddy Yankee with Bieber. The song maintains the original rhythms and Luis Fonsi translated some lines to English, singing a verse in Spanglish, while Daddy Yankee's verses were kept from the original version. <a href=\"http://www.last.fm/music/Luis+Fonsi/_/Despacito+-+Remix\">Read more on Last.fm</a>.",
      "content": "A remix version of \"Despacito\" featuring Canadian singer Justin Bieber was released digitally on April 17, 2017. His Spanish performance of the chorus became the first time he sang in that language. It is the first collaboration between Luis Fonsi and Daddy Yankee with Bieber. The song maintains the original rhythms and Luis Fonsi translated some lines to English, singing a verse in Spanglish, while Daddy Yankee's verses were kept from the original version. Justin Bieber and American songwriters Jason Boyd and Marty James co-wrote the version. Colombian musician Juan Felipe Samper was hired to help Bieber sing in Spanish. According to Fonsi, Justin Bieber wanted to record the remix version after seeing how people reacted to \"Despacito\" in a Colombian club.\n\nThe remix's official audio became the highest debut for a music-related video in 2017 as of April and also the fourth music-related video with most views in one day with 23.8 million views. Bieber's collaboration helped the song to reach number one of the US Billboard Hot 100, the first for a primarily Spanish-language song since \"Macarena\" by Los del Río in 1996. Combined chart entries for the original and the remix version enhanced the song's chart performance in various countries, as well as increasing the music video's weekly views on YouTube. The remix alone topped the charts of Finland, Malaysia, New Zealand, Norway and Sweden, and reached the top ten of Mexico and Spain. <a href=\"http://www.last.fm/music/Luis+Fonsi/_/Despacito+-+Remix\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}