{
  "track": {
    "name": "Can't Hold Us (feat. Ray Dalton)",
    "mbid": "b1830529-162e-4938-b913-0adee21054c3",
    "url": "https://www.last.fm/music/Macklemore+&+Ryan+Lewis/_/Can%27t+Hold+Us+(feat.+Ray+Dalton)",
    "duration": "252000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "893520",
    "playcount": "7389942",
    "artist": {
      "name": "Macklemore & Ryan Lewis",
      "mbid": "97b226c8-7140-4da3-91ac-15e62e131a81",
      "url": "https://www.last.fm/music/Macklemore+&+Ryan+Lewis"
    },
    "album": {
      "artist": "Macklemore & Ryan Lewis",
      "title": "The Heist (Deluxe Edition)",
      "url": "https://www.last.fm/music/Macklemore+&+Ryan+Lewis/The+Heist+(Deluxe+Edition)",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/8a74205dbcd160b15135f29523e0b5e0.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/8a74205dbcd160b15135f29523e0b5e0.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/8a74205dbcd160b15135f29523e0b5e0.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/8a74205dbcd160b15135f29523e0b5e0.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "18 Mar 2013, 20:10",
      "summary": "\"Can't Hold Us\" is a song written and performed by American hip-hop duo Macklemore & Ryan Lewis and singer Ray Dalton, originally released on August 16, 2011 as the second single from the duo's debut studio album, The Heist.\n\nThe song was a sleeper hit, gaining more attention in 2012. It reached number one on the Billboard Hot 100, making it their second number-one hit in the United States. It is also their third consecutive number-one single in Australia. <a href=\"http://www.last.fm/music/Macklemore+&+Ryan+Lewis/_/Can%27t+Hold+Us+(feat.+Ray+Dalton)\">Read more on Last.fm</a>.",
      "content": "\"Can't Hold Us\" is a song written and performed by American hip-hop duo Macklemore & Ryan Lewis and singer Ray Dalton, originally released on August 16, 2011 as the second single from the duo's debut studio album, The Heist.\n\nThe song was a sleeper hit, gaining more attention in 2012. It reached number one on the Billboard Hot 100, making it their second number-one hit in the United States. It is also their third consecutive number-one single in Australia. The music video was nominated for Best Music Video at the 56th Annual Grammy Awards in 2014. The song was also listed as \"The Most-Streamed Song of 2013\" by Spotify.\n\nDue to the major international success of the duo's \"Thrift Shop\", there was a resurgence in sales of their previous singles and their album The Heist.\n\nIn the United Kingdom, the song debuted in the UK Singles Chart at number 187 on March 17, 2013, climbing up to number 53 the following week. It eventually peaked at number three on the chart. In Australia, \"Can't Hold Us\" became Macklemore & Ryan Lewis' third consecutive number-one single after \"Thrift Shop\" and \"Same Love\", reaching the top of the chart on March 25, 2013. In the United States, the song became a sleeper hit, and following a performance of the song on Saturday Night Live, the song cracked the top 10 at number 7, becoming the duo's second top 10 hit, following the number-one single \"Thrift Shop\". \"Can't Hold Us\" reached number one on the Billboard Hot 100 during the week dated May 17, 2013. They became the first duo to place their two debut singles atop the chart. They also became the fifth act to place their two debut singles atop the Billboard Hot 100, following Mariah Carey with \"Vision of Love\" and \"Love Takes Time\", Christina Aguilera with \"Genie in a Bottle\" and \"What a Girl Wants\", Lady Gaga with \"Just Dance\" and \"Poker Face\" and Bruno Mars with \"Just the Way You Are\" and \"Grenade\". The song stayed at number one for five consecutive weeks before being surpassed by Robin Thicke's \"Blurred Lines\". As of January 2014, the song has sold 4,383,000 downloads in the United States with 4,260,000 sold in 2013, making it the eighth best-selling song of the year.\n\nWith the helpful release and advertisement of DJ crue and several other artists/producers, remixes were made. One of the most successful one's was Eminem, Macklemore & Ryan Lewis – Just Can't Hold Us. This was hosted by Ryan Lewis himself and produced by many artists such as OfficialDJLithium who is current day DJ Crue, and Sparks Hopes who is currently known as Jimmy Kang.\n\nSparks Hopes also helped with the dated release/production working closely with Ryan Lewis, going as far as helping with the 2013 YouTube rewind in order to remix the background track in it. Going as far as helping with the film production, as you can see him in the background of the filming. Overall contributing to the monumental success of the launch.\n\nMacklemore premiered the music video for \"Can't Hold Us\" on April 17, 2013. The video was directed by Ryan Lewis, Jason Koenig and Jon Jon Augustavo, and shooting took place for 17 days, on 2 continents and 16 different shoots, ranging from the Pacific Northwest to Southern California to New Zealand at Cathedral Cove where scenes for The Chronicles of Narnia: Prince Caspian were also shot. Several prominent parts were filmed on the tall ship Lady Washington.\n\nThe video won two MTV Video Music Awards for Best Hip-Hop Video and Director of Photography Jason Koenig, and Mego Lin won Best Cinematography, the video was nominated for Best Direction and Best Editing Nomination to Jason Koenig and Ryan Lewis. It also was placed at No. 12 on BET Notarized Top 100 in 2013. It was nominated for Best Music Video at the 2014 Grammy Awards.\n\nIn an interview about “Can’t Hold Us“ and the tour he was on, Macklemore was asked about the inspiration for the song and responded:\n\n\"Ryan [Lewis] had the beat a long time ago, like he made that beat in two thousand seven/eight-ish. And I was always just kind of intimidated to write to it, ‘cause it sounded like it was a soccer anthem […]. Finally he’s like “You do have to write to it!“ and I finally listened to him and I, I wrote to it. We had these verses in place when we were going on tour and […] I don’t remember what we did to the hook, but it wasn’t what it ended up being, it was something else. And when we got back, we knew we wanted to knock it out and we had Ray Dalton in mind for it, Ray came over. He kinda had like a melody idea and I wrote the lyrics to it and we all collaborated on what I wrote and fine tuned it and then turned it then turned it to this song. But Ryan put in tons of effort like with Owuour Arunga, trumpet, trombone player Greg – I don’t know his last name; Greg [Kramer], I’m sorry –, but a bunch of amazing musicians got on it, awarded all the arrangements of Greg for the trombone, it’s just a big collaboration, but Ryan put tons and tons, tons of hours into what it is today.\" <a href=\"http://www.last.fm/music/Macklemore+&+Ryan+Lewis/_/Can%27t+Hold+Us+(feat.+Ray+Dalton)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}