{
  "track": {
    "name": "Frozen",
    "mbid": "87687915-6b34-49b7-b171-f6e113255cf8",
    "url": "https://www.last.fm/music/Madonna/_/Frozen",
    "duration": "370000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "811065",
    "playcount": "6865699",
    "artist": {
      "name": "Madonna",
      "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287",
      "url": "https://www.last.fm/music/Madonna"
    },
    "album": {
      "artist": "Madonna",
      "title": "Ray of Light",
      "url": "https://www.last.fm/music/Madonna/Ray+of+Light",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/f8954eaed52fc4a524ea6f333aa2464d.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/f8954eaed52fc4a524ea6f333aa2464d.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/f8954eaed52fc4a524ea6f333aa2464d.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/f8954eaed52fc4a524ea6f333aa2464d.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "90s",
          "url": "https://www.last.fm/tag/90s"
        },
        {
          "name": "female vocalists",
          "url": "https://www.last.fm/tag/female+vocalists"
        },
        {
          "name": "Madonna",
          "url": "https://www.last.fm/tag/Madonna"
        },
        {
          "name": "electronic",
          "url": "https://www.last.fm/tag/electronic"
        }
      ]
    },
    "wiki": {
      "published": "09 Oct 2009, 13:15",
      "summary": "\"Frozen\" is a song recorded by American singer Madonna for her seventh studio album, Ray of Light. It was written and produced by Madonna, Patrick Leonard and William Orbit. The song was released as the record's lead single in February 1998.\n\nAcclaimed by the music critics and often described as a masterpiece, the single was also a worldwide commercial success. On the Billboard Hot 100, “Frozen” peaked at #2, while in the UK Singles Chart, it was Madonna’s first single to debut at the top. <a href=\"http://www.last.fm/music/Madonna/_/Frozen\">Read more on Last.fm</a>.",
      "content": "\"Frozen\" is a song recorded by American singer Madonna for her seventh studio album, Ray of Light. It was written and produced by Madonna, Patrick Leonard and William Orbit. The song was released as the record's lead single in February 1998.\n\nAcclaimed by the music critics and often described as a masterpiece, the single was also a worldwide commercial success. On the Billboard Hot 100, “Frozen” peaked at #2, while in the UK Singles Chart, it was Madonna’s first single to debut at the top. The single also reached #1 in Finland, Greece, Hungary, Italy, Scotland, and Spain, and the top five elsewhere.\n\nThe music video, directed by British artist Chris Cunningham, was shot in a desert in California. It portrays Madonna as an ethereal, witch-like persona, who shapeshifts into a flock of birds and a black dog. In an interview on the set of the video, Madonna described herself as a “mystical creature in the desert”.\n\nIn 1998, Madonna talked to MTV Asia about the shooting of the video:\n\n“Because the song is called ‘Frozen’, the original idea was to go someplace where it’s really cold and where there’s snow, and we were thinking of shooting it in Iceland. But then I thought, ‘You know what, I’m going to be freezing. I’m going to be miserable, I’ll be complaining all day, I’ll be sorry that I ever chose a cold place. So I said, 'Let’s do it in the desert, it’ll be warm,’ and it would be sort of the opposite, because even though you think of deserts as being hot, they’re still sort of frozen in terms of there’s no vegetation and they’re very desolate.\nI thought that that would still work as a visual, but then we got there and it was like 20 degrees below zero, it was bitterly cold, and I was barefoot. I was barefoot for the entire video, and then it started pouring rain and everyone got really sick, and it just actually turned out to be a really miserable experience.\"\n\nThe video was delivered to broadcasting channels (such as MTV and Much Music) in a box of dry ice. Next to the first run, the VJs had to melt or chip away the ice block to get to the video inside. Selected radio stations also got an ice box with the promo CD inside, containing three tracks: the album version, the radio edit and a remix, as well as a promo flyer for the single. <a href=\"http://www.last.fm/music/Madonna/_/Frozen\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}