{
  "track": {
    "name": "It's a Wrap - Sped Up",
    "url": "https://www.last.fm/music/Mariah+Carey/_/It%27s+a+Wrap+-+Sped+Up",
    "duration": "0",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "67435",
    "playcount": "389754",
    "artist": {
      "name": "Mariah Carey",
      "url": "https://www.last.fm/music/Mariah+Carey"
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "10 Feb 2023, 13:57",
      "summary": "\"It's A Wrap” is a song which appears on Mariah Carey’s album Memoirs of an Imperfect Angel (2009).\n\nThe song has two samples: Samples Love Unlimited’s 1974 “I Belong to You.” Interpolates the piano from Aretha Franklin’s Ain’t No Way. Sample appears at 1:03 \n\n\"This next song, this is about, basically, relationships. We’re dealing with relationships here. It’s like when you’ve waited all night long for somebody to come home and they finally come home <a href=\"http://www.last.fm/music/Mariah+Carey/_/It%27s+a+Wrap+-+Sped+Up\">Read more on Last.fm</a>.",
      "content": "\"It's A Wrap” is a song which appears on Mariah Carey’s album Memoirs of an Imperfect Angel (2009).\n\nThe song has two samples: Samples Love Unlimited’s 1974 “I Belong to You.” Interpolates the piano from Aretha Franklin’s Ain’t No Way. Sample appears at 1:03 \n\n\"This next song, this is about, basically, relationships. We’re dealing with relationships here. It’s like when you’ve waited all night long for somebody to come home and they finally come home, and it’s the morning and… you yourself are like, ‘Where is this MF'er?’ … I’m talking about a serious subject here. This is a serious situation that I’m talking about. This is from, well I told you the remix album is gonna be out and I’m singing this with Mary J. Blige and I’m really excited about it. But right now I’m gonna do it alone. It’s called ‘It’s A Wrap'.\"\n\nMariah on the Angels Advocate Tour on January 16th, 2010 at MGM Grand at Foxwoods in CT. <a href=\"http://www.last.fm/music/Mariah+Carey/_/It%27s+a+Wrap+-+Sped+Up\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}