{
  "track": {
    "name": "Moves Like Jagger - Studio Recording From The Voice Performance",
    "url": "https://www.last.fm/music/Maroon+5/_/Moves+Like+Jagger+-+Studio+Recording+From+The+Voice+Performance",
    "duration": "0",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "525089",
    "playcount": "2805853",
    "artist": {
      "name": "Maroon 5",
      "url": "https://www.last.fm/music/Maroon+5"
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "01 Oct 2013, 14:36",
      "summary": "This electro-pop track is billed as \"Maroon 5 featuring Christina Aguilera,\" though the latter actually does very little, only coming in at the bridge after two minutes. The song was released on June 21, 2011 in conjunction with a live performance on The Voice. Both Maroon 5 frontman Adam Levine and Aguilera were coaches on the show. For this song, their vocals were both Auto-Tuned, although it was used more for effect here than for pitch correction. <a href=\"http://www.last.fm/music/Maroon+5/_/Moves+Like+Jagger+-+Studio+Recording+From+The+Voice+Performance\">Read more on Last.fm</a>.",
      "content": "This electro-pop track is billed as \"Maroon 5 featuring Christina Aguilera,\" though the latter actually does very little, only coming in at the bridge after two minutes. The song was released on June 21, 2011 in conjunction with a live performance on The Voice. Both Maroon 5 frontman Adam Levine and Aguilera were coaches on the show. For this song, their vocals were both Auto-Tuned, although it was used more for effect here than for pitch correction. The song's lyrics refer to the narrator's ability to impress a female with his dance moves, which he compares to those of legendary Rolling Stones rocker Mick Jagger. <a href=\"http://www.last.fm/music/Maroon+5/_/Moves+Like+Jagger+-+Studio+Recording+From+The+Voice+Performance\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}