{
  "track": {
    "name": "Made You Look",
    "mbid": "750a96d7-26bd-4733-8826-e0475f946476",
    "url": "https://www.last.fm/music/Meghan+Trainor/_/Made+You+Look",
    "duration": "134000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "456591",
    "playcount": "3334441",
    "artist": {
      "name": "Meghan Trainor",
      "mbid": "b2029169-2574-4305-820f-252a5fde3697",
      "url": "https://www.last.fm/music/Meghan+Trainor"
    },
    "album": {
      "artist": "Meghan Trainor",
      "title": "TAKIN’ IT BACK",
      "url": "https://www.last.fm/music/Meghan+Trainor/TAKIN%E2%80%99+IT+BACK",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/dc36c123dbd4d1dcc4c6521b4f09938e.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/dc36c123dbd4d1dcc4c6521b4f09938e.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/dc36c123dbd4d1dcc4c6521b4f09938e.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/dc36c123dbd4d1dcc4c6521b4f09938e.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "03 Nov 2022, 14:59",
      "summary": "“Made You Look“ is a song by American singer Meghan Trainor. It was released on October 21, 2022 as the seconnd official single from Trainor's fifth studio album, Takin' It Back. Upon its release, it charted in numerous countries across the world, debuting at #95 in the US Billboard Hot 100, and in the top 40 of the UK, Norway, Sweden, New Zealand, and Ireland. \n\nThe track is a doo-wop track with pop influences. Lyrically, it describes feeling confident in your own body, no matter what you are wearing or doing. <a href=\"http://www.last.fm/music/Meghan+Trainor/_/Made+You+Look\">Read more on Last.fm</a>.",
      "content": "“Made You Look“ is a song by American singer Meghan Trainor. It was released on October 21, 2022 as the seconnd official single from Trainor's fifth studio album, Takin' It Back. Upon its release, it charted in numerous countries across the world, debuting at #95 in the US Billboard Hot 100, and in the top 40 of the UK, Norway, Sweden, New Zealand, and Ireland. \n\nThe track is a doo-wop track with pop influences. Lyrically, it describes feeling confident in your own body, no matter what you are wearing or doing. It was inspired by Trainor's insecurities of body image after her pregnancy.\n\nMeghan Trainor first teased the song on Tik Tok a few days before the release of her album, stating that the song would be the official second single from the album. Prior to its release, Trainor posted numerous videos on Tik Tok teasing the song, with videos featuring numerous popular content creators. About a week after the song's initial release, \"Made You Look\" began to go viral on Tik Tok. This led to a large increase in streams across streaming platforms, charting in the Spotify Global, Spotify US, and Spotify UK charts.\n\nThe song was a massive international success, reaching #1 in Poland and the top 10 in over 20 countries. The track was featured on the Belgium and the Netherlands'  year end charts. In Australia it is certified x2 Platinum. In the United States, it peaked at #11 on the US Billboard Hot 100 Chart and reached #1 on the US Adult Contemporary Chart. \n\nA music video for the track was released the same day as the album. This music video featured her husband, Daryl Sabara, as well as numerous content creators such as, Drew Afualo, Chris Olsen, JoJo Siwa, and Scott Hoying. The song was sent to US radio on October 31, 2022, a week and a half after its initial release. Trainor performed the song on The Today Show on October 21, later performing the song on The Tonight Show starring Jimmy Fallon. <a href=\"http://www.last.fm/music/Meghan+Trainor/_/Made+You+Look\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}