{
  "track": {
    "name": "Trance (with Travis Scott & Young Thug)",
    "url": "https://www.last.fm/music/Metro+Boomin/_/Trance+(with+Travis+Scott+&+Young+Thug)",
    "duration": "194000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "922303",
    "playcount": "18158645",
    "artist": {
      "name": "Metro Boomin",
      "mbid": "59db3d82-86ea-451f-881f-dffc8ec387c9",
      "url": "https://www.last.fm/music/Metro+Boomin"
    },
    "album": {
      "artist": "Metro Boomin",
      "title": "HEROES & VILLAINS",
      "url": "https://www.last.fm/music/Metro+Boomin/HEROES+&+VILLAINS",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/1240a338ee297d49b02b8f4e608ae49c.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/1240a338ee297d49b02b8f4e608ae49c.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/1240a338ee297d49b02b8f4e608ae49c.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/1240a338ee297d49b02b8f4e608ae49c.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "trap",
          "url": "https://www.last.fm/tag/trap"
        },
        {
          "name": "travis scott",
          "url": "https://www.last.fm/tag/travis+scott"
        },
        {
          "name": "Young Thug",
          "url": "https://www.last.fm/tag/Young+Thug"
        },
        {
          "name": "Metro Boomin",
          "url": "https://www.last.fm/tag/Metro+Boomin"
        },
        {
          "name": "rnb",
          "url": "https://www.last.fm/tag/rnb"
        }
      ]
    },
    "wiki": {
      "published": "14 Apr 2023, 02:12",
      "summary": "\"Trance\" is a song by American record producer Metro Boomin and American rappers Travis Scott and Young Thug, from Metro's second studio album, Heroes & Villains. It was produced by Metro Boomin and Allen Ritter.\n\nThe song was met with a generally mixed to negative reception. Its production has been criticized; Charles Lyons-Burt of Slant Magazine wrote, \"Metro is often just going about recycling what's worked on tracks that he's produced in the past <a href=\"http://www.last.fm/music/Metro+Boomin/_/Trance+(with+Travis+Scott+&+Young+Thug)\">Read more on Last.fm</a>.",
      "content": "\"Trance\" is a song by American record producer Metro Boomin and American rappers Travis Scott and Young Thug, from Metro's second studio album, Heroes & Villains. It was produced by Metro Boomin and Allen Ritter.\n\nThe song was met with a generally mixed to negative reception. Its production has been criticized; Charles Lyons-Burt of Slant Magazine wrote, \"Metro is often just going about recycling what's worked on tracks that he's produced in the past, as with the sad-sack fiddle that he layers over the top of 'Trance'—the exact same one that he used on Savage Mode II's \"Rich Nigga Shit,\" which similarly featured Young Thug.\" Similarly, Hamza Riaz of Mic Cheque described the production in Heroes & Villains as \"the most skeletal we've ever heard Metro, excessively subdued in songs like 'Trance'\". Uproxx's Wongo Okon commented that the gloom in the song \"foreshadows the danger that lurks between the drums and hi-hats of Heroes & Villains.\" Writing for Complex, Peter A. Berry considered it among the songs which although \"can suffer from lyrical blandness, their melodies make them compelling anyways.\"\n\nIn January 2023, an alternative version of the song featuring a verse from Canadian rapper Drake surfaced online. In an interview with DJ Drama on the Streetz Is Watchin Radio, Metro Boomin revealed that when they were in the studio once, Drake wanted to hear songs from Heroes & Villains and heard \"Trance\", which by then had been finished. Though Metro already liked the way it sounded and did not intend to alter it, Drake still recorded a verse for the song. Boomin explained, \"a couple parts was cool but like I just felt like just even with like Slime verse and Trav verse and the outro, it wasn't just no room. It wasn't nothing personal... I just ended up using the original and I guess the other one just leaked or something.\" <a href=\"http://www.last.fm/music/Metro+Boomin/_/Trance+(with+Travis+Scott+&+Young+Thug)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}