{
  "track": {
    "name": "AMG",
    "url": "https://www.last.fm/music/Natanael+Cano/_/AMG",
    "duration": "174000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "140620",
    "playcount": "2218678",
    "artist": {
      "name": "Natanael Cano",
      "mbid": "41925f30-8737-4fb8-af65-da918c0e98f3",
      "url": "https://www.last.fm/music/Natanael+Cano"
    },
    "album": {
      "artist": "Natanael Cano",
      "title": "AMG",
      "url": "https://www.last.fm/music/Natanael+Cano/AMG",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/683edda2e8ef223eb36e70fc43fe413a.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/683edda2e8ef223eb36e70fc43fe413a.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/683edda2e8ef223eb36e70fc43fe413a.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/683edda2e8ef223eb36e70fc43fe413a.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "17 Sep 2023, 18:14",
      "summary": "La canción \"AMG\" de Peso Pluma, Natanael Cano y Gabito Ballesteros es una celebración del éxito y la riqueza material. Centrada en la compra de cosas bonitas como un Mercedes AMG y un estilo de vida lujoso. El personaje presume haber conseguido el éxito en la vida disfrutando de su dinero, de las chicas que atrae y del respeto que recibe de los demás, sugiriendo que el dinero le ha abierto muchas oportunidades. También habla de la rutina, las luchas y los riesgos asumidos para llegar a ese lugar de éxito <a href=\"http://www.last.fm/music/Natanael+Cano/_/AMG\">Read more on Last.fm</a>.",
      "content": "La canción \"AMG\" de Peso Pluma, Natanael Cano y Gabito Ballesteros es una celebración del éxito y la riqueza material. Centrada en la compra de cosas bonitas como un Mercedes AMG y un estilo de vida lujoso. El personaje presume haber conseguido el éxito en la vida disfrutando de su dinero, de las chicas que atrae y del respeto que recibe de los demás, sugiriendo que el dinero le ha abierto muchas oportunidades. También habla de la rutina, las luchas y los riesgos asumidos para llegar a ese lugar de éxito, de ahí la necesidad de mantenerse alerta. En el verso \"un jeeter pa rolar, los baby a mi me gustan más\" se refiere a la marca de cannabis Baby Jeeter. En general, la canción expresa la idea de que el trabajo duro, la determinación y la ambición pueden y serán recompensados con una vida de riqueza y respeto. <a href=\"http://www.last.fm/music/Natanael+Cano/_/AMG\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}