{
  "track": {
    "name": "Bulletproof",
    "url": "https://www.last.fm/music/Nate+Smith/_/Bulletproof",
    "duration": "183000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "37281",
    "playcount": "249522",
    "artist": {
      "name": "Nate Smith",
      "mbid": "5ecf10f3-1dbe-4aa8-8dca-d5afb8b959f2",
      "url": "https://www.last.fm/music/Nate+Smith"
    },
    "album": {
      "artist": "Nate Smith",
      "title": "Bulletproof",
      "url": "https://www.last.fm/music/Nate+Smith/Bulletproof",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/21a0072f1cffebec2d0a1e819911ab7d.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/21a0072f1cffebec2d0a1e819911ab7d.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/21a0072f1cffebec2d0a1e819911ab7d.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/21a0072f1cffebec2d0a1e819911ab7d.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "09 Oct 2025, 02:13",
      "summary": "\"Bulletproof\" is a song by country music singer Nate Smith. It was released on February 19, 2024, as the lead single from his second studio album, California Gold. It was written by Ashley Gorley, Hunter Phelps, and Ben Johnson, and produced by Lindsay Rimes.\n\nAfter co-writing most of the tracks for his self-titled debut album, Smith spent most of 2023 on the road touring radio stations and had less time for songwriting, leading to him looking for outside cuts. <a href=\"http://www.last.fm/music/Nate+Smith/_/Bulletproof\">Read more on Last.fm</a>.",
      "content": "\"Bulletproof\" is a song by country music singer Nate Smith. It was released on February 19, 2024, as the lead single from his second studio album, California Gold. It was written by Ashley Gorley, Hunter Phelps, and Ben Johnson, and produced by Lindsay Rimes.\n\nAfter co-writing most of the tracks for his self-titled debut album, Smith spent most of 2023 on the road touring radio stations and had less time for songwriting, leading to him looking for outside cuts. \"Bulletproof\" was written in April 2021, by Ashley Gorley, Hunter Phelps, and Ben Johnson, and its title was inspired by La Roux's 2009 single, also titled \"Bulletproof\". Johnson built the demo off a 2000s-era rock sound, specifically drawing influence from Green Day's \"Boulevard of Broken Dreams\", and an intro that bears a resemblance to Tom Petty's \"Mary Jane's Last Dance\". It was among several tracks sent by the songwriters to Smith, who resonated with it and had producer Lindsay Rimes lean into a country rock sound for his recording. Topically, the song finds the protagonist dealing with heartbreak by taking various shots at a bar, before drawing the conclusion that his ex must be \"bulletproof\" as her memory remains unshakeable.\n\nOn May 16, 2024, an alternate duet version with Avril Lavigne was released, the same day Smith performed the song with Lavigne on the 59th Academy of Country Music Awards at the Ford Center at The Star in Frisco, Texas. <a href=\"http://www.last.fm/music/Nate+Smith/_/Bulletproof\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}