{
  "track": {
    "name": "bad idea right?",
    "mbid": "de92a070-4368-493b-8755-ec7e3036b352",
    "url": "https://www.last.fm/music/Olivia+Rodrigo/_/bad+idea+right%3F",
    "duration": "184000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1127583",
    "playcount": "23540308",
    "artist": {
      "name": "Olivia Rodrigo",
      "mbid": "6925db17-f35e-42f3-a4eb-84ee6bf5d4b0",
      "url": "https://www.last.fm/music/Olivia+Rodrigo"
    },
    "album": {
      "artist": "Olivia Rodrigo",
      "title": "bad idea right?",
      "url": "https://www.last.fm/music/Olivia+Rodrigo/bad+idea+right%3F",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/77970775482a8f5fa6e723dc9efe40a5.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/77970775482a8f5fa6e723dc9efe40a5.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/77970775482a8f5fa6e723dc9efe40a5.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/77970775482a8f5fa6e723dc9efe40a5.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "power pop",
          "url": "https://www.last.fm/tag/power+pop"
        },
        {
          "name": "rock",
          "url": "https://www.last.fm/tag/rock"
        },
        {
          "name": "pop rock",
          "url": "https://www.last.fm/tag/pop+rock"
        },
        {
          "name": "indie rock",
          "url": "https://www.last.fm/tag/indie+rock"
        },
        {
          "name": "garage rock revival",
          "url": "https://www.last.fm/tag/garage+rock+revival"
        }
      ]
    },
    "wiki": {
      "published": "12 Aug 2023, 01:45",
      "summary": "\"bad idea right?\" is a song by American singer-songwriter Olivia Rodrigo, released as the second single from her sophomore album GUTS on August 11, 2023. Produced by Dan Nigro, the track marked a notable departure from the melancholic balladry that defined much of her debut album SOUR, leaning instead into a more playful and punk-pop aesthetic. It was co-written by Rodrigo and Nigro and served as a bold, tongue-in-cheek entry in the album’s exploration of post-adolescent chaos, romantic contradictions, and emotional self-sabotage. <a href=\"http://www.last.fm/music/Olivia+Rodrigo/_/bad+idea+right%3F\">Read more on Last.fm</a>.",
      "content": "\"bad idea right?\" is a song by American singer-songwriter Olivia Rodrigo, released as the second single from her sophomore album GUTS on August 11, 2023. Produced by Dan Nigro, the track marked a notable departure from the melancholic balladry that defined much of her debut album SOUR, leaning instead into a more playful and punk-pop aesthetic. It was co-written by Rodrigo and Nigro and served as a bold, tongue-in-cheek entry in the album’s exploration of post-adolescent chaos, romantic contradictions, and emotional self-sabotage.\n\nThe song details a conflicted internal monologue where Rodrigo debates whether or not to reconnect with an ex-lover, despite knowing it’s a poor decision. With a self-aware, almost comedic tone, she leans into the irrationality of desire and impulsive behavior. The chorus, with its chant-like repetition of “I’m gonna see him tonight,” captures the song's central tension between logic and lust. This emotional seesaw is accompanied by fuzzy guitars, driving drums, and an infectious spoken-sung vocal delivery that channels early 2000s alt-pop and garage rock.\n\nVisually, \"bad idea right?\" was brought to life through a vibrant music video directed by Petra Collins, who previously collaborated with Rodrigo on her SOUR visuals. The video complements the track’s playful chaos with surreal, campy visuals showing Rodrigo navigating a night filled with temptation and absurdity. This visual storytelling helped cement the song’s appeal to Gen Z audiences, blending nostalgic aesthetics with hyper-modern attitude and humor.\n\nCritically, the track was praised for its refreshing sonic experimentation and bold lyricism, further showcasing Rodrigo’s evolution as a pop artist unafraid to shift styles. \"bad idea right?\" charted globally and added a dynamic layer to GUTS, an album celebrated for its emotional honesty, genre diversity, and rebellious spirit. Its success underscored Rodrigo’s growing prowess not just as a balladeer but also as a sharp, self-aware narrator of youth and contradiction. <a href=\"http://www.last.fm/music/Olivia+Rodrigo/_/bad+idea+right%3F\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}