{
  "track": {
    "name": "LUNA",
    "url": "https://www.last.fm/music/Peso+Pluma/_/LUNA",
    "duration": "190000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "110484",
    "playcount": "1949700",
    "artist": {
      "name": "Peso Pluma",
      "mbid": "75e4f8ef-34c3-44fd-8467-88a7d9599f77",
      "url": "https://www.last.fm/music/Peso+Pluma"
    },
    "album": {
      "artist": "Peso Pluma",
      "title": "GÉNESIS",
      "url": "https://www.last.fm/music/Peso+Pluma/G%C3%89NESIS",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/e1798a004f87e216e8d2789e29e7a5a5.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/e1798a004f87e216e8d2789e29e7a5a5.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/e1798a004f87e216e8d2789e29e7a5a5.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/e1798a004f87e216e8d2789e29e7a5a5.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "17 Sep 2023, 19:49",
      "summary": "\"LUNA\" es la tercera colaboración de Peso Pluma y Junior H. Esta canción revela la historia de una relación amorosa que llegó a su fin. Enfatiza el anhelo por alguien que ya no está más en su vida, por lo que el protagonista le pide a la Luna que cuide de la misma. También expresa que su amor fue único, puro y verdadero. Debido a que sabe que su amor pasado ahora está con alguien más, con mucho dolor no le queda más que desearle lo mejor y que le vaya muy bien con su actual pareja <a href=\"http://www.last.fm/music/Peso+Pluma/_/LUNA\">Read more on Last.fm</a>.",
      "content": "\"LUNA\" es la tercera colaboración de Peso Pluma y Junior H. Esta canción revela la historia de una relación amorosa que llegó a su fin. Enfatiza el anhelo por alguien que ya no está más en su vida, por lo que el protagonista le pide a la Luna que cuide de la misma. También expresa que su amor fue único, puro y verdadero. Debido a que sabe que su amor pasado ahora está con alguien más, con mucho dolor no le queda más que desearle lo mejor y que le vaya muy bien con su actual pareja, de igual manera decirle que se cuide y recordarle todos sus buenos momentos con ella, a través del mensajero que es la \"Luna.” En conclusión, \"LUNA\" es una canción sobre aferrarse a los recuerdos del amor pasado y buscar la guía de algo tan puro y eterno como la luna para asegurar la seguridad y  felicidad de un amor pasado. <a href=\"http://www.last.fm/music/Peso+Pluma/_/LUNA\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}