{
  "track": {
    "name": "PRC",
    "url": "https://www.last.fm/music/Peso+Pluma/_/PRC",
    "duration": "186000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "146527",
    "playcount": "1866322",
    "artist": {
      "name": "Peso Pluma",
      "mbid": "75e4f8ef-34c3-44fd-8467-88a7d9599f77",
      "url": "https://www.last.fm/music/Peso+Pluma"
    },
    "album": {
      "artist": "Peso Pluma",
      "title": "PRC",
      "url": "https://www.last.fm/music/Peso+Pluma/PRC",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/6aacf19f380a5606e5e9858619eb07cd.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/6aacf19f380a5606e5e9858619eb07cd.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/6aacf19f380a5606e5e9858619eb07cd.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/6aacf19f380a5606e5e9858619eb07cd.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "17 Sep 2023, 18:21",
      "summary": "La canción \"PRC\" de Peso Pluma y Natanael Cano trata de la vida de un traficante de drogas. El nombre de la canción \"PRC\" es una abreviatura a las siguientes palabras: \"Polvo\" que es Cocaína, \"Ruedas\" se refiere a cualquier tipo de comprimido o pastilla, en este caso M-30 Fentanilo y por último \"Cristal\" que refiere Metanfetamina. La letra nos cuenta cómo es la vida llena de lujos y excesos que el personaje obtiene por su oficio. Aunque la canción describe una vida de actividad ilegal <a href=\"http://www.last.fm/music/Peso+Pluma/_/PRC\">Read more on Last.fm</a>.",
      "content": "La canción \"PRC\" de Peso Pluma y Natanael Cano trata de la vida de un traficante de drogas. El nombre de la canción \"PRC\" es una abreviatura a las siguientes palabras: \"Polvo\" que es Cocaína, \"Ruedas\" se refiere a cualquier tipo de comprimido o pastilla, en este caso M-30 Fentanilo y por último \"Cristal\" que refiere Metanfetamina. La letra nos cuenta cómo es la vida llena de lujos y excesos que el personaje obtiene por su oficio. Aunque la canción describe una vida de actividad ilegal, hace hincapié en el disfrute y la falta de arrepentimiento de su estilo de vida. No cabe duda que es un estilo de vida problemático que, aunque conduce al dinero rápido, está plagado de peligros e incertidumbre. En conclusión, \"PRC\" parece ser una celebración de una vida de narcotráfico, destacando la atención al detalle y el cuidado que se pone en la fabricación y el transporte de drogas, al tiempo que entatiza el disfrute y la falta de remordimiento que el personaje siente por sus acciones. <a href=\"http://www.last.fm/music/Peso+Pluma/_/PRC\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}