{
  "track": {
    "name": "Doctor (Work It Out) [feat. Miley Cyrus]",
    "url": "https://www.last.fm/music/Pharrell+Williams/_/Doctor+(Work+It+Out)+%5Bfeat.+Miley+Cyrus%5D",
    "duration": "182000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "130904",
    "playcount": "721019",
    "artist": {
      "name": "Pharrell Williams",
      "mbid": "149f91ef-1287-46da-9a8e-87fee02f1471",
      "url": "https://www.last.fm/music/Pharrell+Williams"
    },
    "album": {
      "artist": "Pharrell Williams",
      "title": "Doctor (Work It Out) [feat. Miley Cyrus]",
      "url": "https://www.last.fm/music/Pharrell+Williams/Doctor+(Work+It+Out)+%5Bfeat.+Miley+Cyrus%5D",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/73aea3d5ed8c56c6c9989c11888b8a97.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/73aea3d5ed8c56c6c9989c11888b8a97.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/73aea3d5ed8c56c6c9989c11888b8a97.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/73aea3d5ed8c56c6c9989c11888b8a97.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "05 Mar 2024, 05:21",
      "summary": "\"Doctor (Work It Out)\" is a song by American singer Pharrell Williams featuring Miley Cyrus; produced by the former with vocals from the latter, it was released on March 1, 2024. As an outtake from Cyrus's fourth studio album Bangerz, it is her first official release of 2024. It marks their first collaboration in 10 years, previously having worked together on \"Come Get It Bae\" and multiple songs on Bangerz.\n\n\"We just believe so much in timing and in everything happening when it's supposed to. <a href=\"http://www.last.fm/music/Pharrell+Williams/_/Doctor+(Work+It+Out)+%5Bfeat.+Miley+Cyrus%5D\">Read more on Last.fm</a>.",
      "content": "\"Doctor (Work It Out)\" is a song by American singer Pharrell Williams featuring Miley Cyrus; produced by the former with vocals from the latter, it was released on March 1, 2024. As an outtake from Cyrus's fourth studio album Bangerz, it is her first official release of 2024. It marks their first collaboration in 10 years, previously having worked together on \"Come Get It Bae\" and multiple songs on Bangerz.\n\n\"We just believe so much in timing and in everything happening when it's supposed to. And around the Grammys, Pharrell and I were talking about putting the song out, and it just felt like it was so serendipitous, and there were so many alignments and so many moments that made me know that now was the perfect time. And then sometimes things in our past make more sense in our present than they ever did then. So this song, I think the nature, the celebration, the feeling, especially with the video, the joy, the dancing, the letting go, it's what this song really always needed.\"\n\n— Cyrus, Pitchfork\n\nThe song was initially written and recorded by Cyrus—with co-writing and production by Williams—for her fourth studio album Bangerz but did not make the final tracklist. Cyrus and Williams collaborated on four tracks released as part of the album, and the single \"Come Get It Bae\"—from the latter's second studio album, Girl. A demo titled \"Doctor\" was leaked online in December 2017.\n\nOver a decade later, the track was reworked and re-recorded by 2023. It was previewed during the livestream of William's Louis Vuitton menswear fall-winter show during Paris Fashion Week, on January 16, 2024. In February, Cyrus's website and social media layouts were updated with new pictures from a Polaroid-themed photoshoot, which prompted speculation on new music. Later that month, Williams previewed the song via his social media and alluded to an official release, with his post captioned \"soon\".\n\nOn February 27, Cyrus announced the single's title as \"Doctor (Work It Out)\", shared a promotional image, and released a 30-second snippet via her social media. The picture featured Cyrus standing against a gray background and looking into the camera, styled with big hair and wearing a blue fur coat. The title appears in pink at the top of the image. Pre-save links to the song were made available simultaneously. The day after, Cyrus released a preview of the song's music video of her dancing and singing along to the lyrics and announced the release date as March 1, 2024.\n\n\"Doctor (Work It Out)\" is Cyrus's first release of 2024. Additionally, it marks her first collaboration with Williams in over a decade, after \"Come Get It Bae\", and their fifth, overall. In a four out of five stars review, Roisin O'Connor of The Independent described the song as a \"glam-pop-rock jam\" with a \"funky bass hook\". The writer assimilated its \"melody and rhythm\" to \"I Wanna Be Your Slave\" by Måneskin and called the intro \"redolent of the one on \"Blurred Lines\", finding that \"Cyrus elevates what could've been a forgettable bop, adding the thrills and spills with a gasp, a moan.\"\n\nThe music video for \"Doctor (Work It Out)\" is directed by Jacob Bixenman. It premiered simultaneously with the release of the song, via Cyrus's Vevo channel on YouTube. <a href=\"http://www.last.fm/music/Pharrell+Williams/_/Doctor+(Work+It+Out)+%5Bfeat.+Miley+Cyrus%5D\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}