{
  "track": {
    "name": "Timber (feat. Ke$ha)",
    "mbid": "e4d692e2-d509-4fcc-a9ff-c0db9565af07",
    "url": "https://www.last.fm/music/Pitbull/_/Timber+(feat.+Ke$ha)",
    "duration": "204000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "694116",
    "playcount": "4436206",
    "artist": {
      "name": "Pitbull",
      "mbid": "d262ea27-3ffe-40f7-b922-85c42d625e67",
      "url": "https://www.last.fm/music/Pitbull"
    },
    "album": {
      "artist": "Pitbull",
      "title": "Global Warming: Meltdown (Deluxe Version)",
      "url": "https://www.last.fm/music/Pitbull/Global+Warming:+Meltdown+(Deluxe+Version)",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/0bb5e59856964ea9ce3edd20bdb201d5.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/0bb5e59856964ea9ce3edd20bdb201d5.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/0bb5e59856964ea9ce3edd20bdb201d5.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/0bb5e59856964ea9ce3edd20bdb201d5.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "10 Feb 2014, 22:22",
      "summary": "\"Timber\" is a song by American rapper Pitbull featuring American recording artist Ke$ha from Pitbull's EP Meltdown - EP. The song was released on October 7, 2013, and as the album's lead single. The song was produced by Dr. Luke, Cirkut, and Sermstyle, with additional production by Nick Seeley. \n\nThe song interpolates \"San Francisco Bay\" by Danish harmonica player Lee Oskar, which was written by Lee Oskar, Keri Oskar, and Greg Errico. Timber features harmonica player Paul Harrington of Rockwall, Texas, who plays through the entire song. <a href=\"http://www.last.fm/music/Pitbull/_/Timber+(feat.+Ke$ha)\">Read more on Last.fm</a>.",
      "content": "\"Timber\" is a song by American rapper Pitbull featuring American recording artist Ke$ha from Pitbull's EP Meltdown - EP. The song was released on October 7, 2013, and as the album's lead single. The song was produced by Dr. Luke, Cirkut, and Sermstyle, with additional production by Nick Seeley. \n\nThe song interpolates \"San Francisco Bay\" by Danish harmonica player Lee Oskar, which was written by Lee Oskar, Keri Oskar, and Greg Errico. Timber features harmonica player Paul Harrington of Rockwall, Texas, who plays through the entire song. He was told to emulate harmonica player Lee Oskar of the band War. \n\nTimber peaked at number one on the Billboard Hot 100 for three consecutive weeks and has also topped the charts in Canada where it has stood at number one for eight consecutive weeks.\n\nKesha had previously featured Pitbull on remixes of her songs “Tik Tok” and “Crazy Kids”. In an interview in December 2013, Pitbull said that Rihanna was originally meant to be the featured artist on “Timber”, but she had already been asked to be the featured artist on Shakira’s “Can’t Remember to Forget You” and did not have time to record “Timber”.\n\nIt reached #1 in Austria, Bulgaria, Canada, Croatia, Denmark, Finland, Germany, Hungary, Lebanon, Luxembourg (digital sales charts), the Netherlands, Norway, Scotland, South Africa, Sweden, Turkey, Ukraine (dance charts), the United Kingdom, the United States, and Venezuela.\n\nIt also peaked at #2 in the Czech Republic, Ireland, and South Korea, #3 in Israel, New Zealand, Poland, Slovakia, and Switzerland, #4 in Australia and the Flanders region of Belgium, #5 in Spain and the Wallonia region of Belgium, #7 in Italy, #8 in France, #10 in Brazil, #11 in Ukraine, #13 in Mexico, #16 in Japan, and #17 in Russia. <a href=\"http://www.last.fm/music/Pitbull/_/Timber+(feat.+Ke$ha)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}