{
  "track": {
    "name": "Circles",
    "mbid": "0025eb0c-9832-4446-b5cd-90f7f5cca285",
    "url": "https://www.last.fm/music/Post+Malone/_/Circles",
    "duration": "215000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1421900",
    "playcount": "20525938",
    "artist": {
      "name": "Post Malone",
      "mbid": "b1e26560-60e5-4236-bbdb-9aa5a8d5ee19",
      "url": "https://www.last.fm/music/Post+Malone"
    },
    "album": {
      "artist": "Various Artists",
      "title": "Now That's What I Call Music! Vol. 73",
      "url": "https://www.last.fm/music/Various+Artists/Now+That%27s+What+I+Call+Music%21+Vol.+73",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/8d5a82de4881fa8e068b18eb7bbfd30b.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/8d5a82de4881fa8e068b18eb7bbfd30b.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/8d5a82de4881fa8e068b18eb7bbfd30b.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/8d5a82de4881fa8e068b18eb7bbfd30b.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "indie pop",
          "url": "https://www.last.fm/tag/indie+pop"
        },
        {
          "name": "Hip-Hop",
          "url": "https://www.last.fm/tag/Hip-Hop"
        },
        {
          "name": "pop rock",
          "url": "https://www.last.fm/tag/pop+rock"
        },
        {
          "name": "post malone",
          "url": "https://www.last.fm/tag/post+malone"
        }
      ]
    },
    "wiki": {
      "published": "09 Sep 2019, 20:08",
      "summary": "“Circles” is the fourth single from Post Malone’s third studio album, 'Hollywood’s Bleeding'. The track continues the heartbreak theme from the third single, “Goodbyes”, as he struggles to maintain a strong relationship with his partner. Like “Goodbyes,” “Circles” fell victim to leaks before the official announcement. A snippet of the track originally surfaced online in July of 2019, with an early version of the song being leaked online later in August. <a href=\"http://www.last.fm/music/Post+Malone/_/Circles\">Read more on Last.fm</a>.",
      "content": "“Circles” is the fourth single from Post Malone’s third studio album, 'Hollywood’s Bleeding'. The track continues the heartbreak theme from the third single, “Goodbyes”, as he struggles to maintain a strong relationship with his partner. Like “Goodbyes,” “Circles” fell victim to leaks before the official announcement. A snippet of the track originally surfaced online in July of 2019, with an early version of the song being leaked online later in August.\n\nIn 2018, Post released the song “Stay” in a very similar fashion—the song was debuted on April 4, 2018, during his first Bud Light Dive Bar Tour show in Nashville, Tennessee. Like “Stay,” “Circles” features a more unique instrumental compared to the majority of Post’s discography, and is sonically similar to his 2016 track, “Hollywood Dreams / Come Down.”\n\nAn official teaser was shared on August 5, 2019, and the full song was later debuted by Post during his Bud Light Dive Bar Tour performance on the same day in New York. During his performance at the Bud Light Dive Bar Tour, Post said that the track would be released the next week, leading many to believe it was supposed to be released on August 16. However, the song was not released on its original expected release date. In an Instagram post on August 28, 2019, Post announced the song would be released on August 30, 2019, alongside the song’s cover art. <a href=\"http://www.last.fm/music/Post+Malone/_/Circles\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}