{
  "track": {
    "name": "Better Now",
    "mbid": "2b632288-0cca-4cc8-85cc-8272f862920e",
    "url": "https://www.last.fm/music/Post+Malone/_/Better+Now",
    "duration": "231000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1008604",
    "playcount": "11273073",
    "artist": {
      "name": "Post Malone",
      "mbid": "b1e26560-60e5-4236-bbdb-9aa5a8d5ee19",
      "url": "https://www.last.fm/music/Post+Malone"
    },
    "album": {
      "artist": "Post Malone",
      "title": "beerbongs & bentleys",
      "url": "https://www.last.fm/music/Post+Malone/beerbongs+&+bentleys",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/d9a790b6c8526a4c8cb9862c64bc3342.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/d9a790b6c8526a4c8cb9862c64bc3342.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/d9a790b6c8526a4c8cb9862c64bc3342.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/d9a790b6c8526a4c8cb9862c64bc3342.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "Hip-Hop",
          "url": "https://www.last.fm/tag/Hip-Hop"
        },
        {
          "name": "rap",
          "url": "https://www.last.fm/tag/rap"
        },
        {
          "name": "trap",
          "url": "https://www.last.fm/tag/trap"
        },
        {
          "name": "rnb",
          "url": "https://www.last.fm/tag/rnb"
        },
        {
          "name": "2010s",
          "url": "https://www.last.fm/tag/2010s"
        }
      ]
    },
    "wiki": {
      "published": "07 Jan 2022, 23:09",
      "summary": "\"Better Now\" is a song by American rapper and singer Post Malone, released on May 18, 2018, as the third single from his second studio album, Beer Bongs & Bentleys. The track showcases a more introspective side of Post Malone, blending elements of hip-hop, rock, and pop in his signature style. The song explores themes of heartbreak, regret, and emotional vulnerability, while maintaining the catchy, melodic hooks that made Post Malone a household name. <a href=\"http://www.last.fm/music/Post+Malone/_/Better+Now\">Read more on Last.fm</a>.",
      "content": "\"Better Now\" is a song by American rapper and singer Post Malone, released on May 18, 2018, as the third single from his second studio album, Beer Bongs & Bentleys. The track showcases a more introspective side of Post Malone, blending elements of hip-hop, rock, and pop in his signature style. The song explores themes of heartbreak, regret, and emotional vulnerability, while maintaining the catchy, melodic hooks that made Post Malone a household name. \"Better Now\" became one of the most successful singles from the album, charting highly on various Billboard charts and achieving significant commercial success.\n\nLyrically, \"Better Now\" deals with the aftermath of a failed relationship. In the song, Post Malone reflects on a past romance and the emotional complexities that followed its end. He admits to feeling better now, but there's an underlying sense of longing and unresolved emotions. The lyrics, \"I know you say you love me, but I don't believe you,\" encapsulate the uncertainty and pain that often accompany a breakup, and the repetition of the line \"But I'm better now\" serves as both a declaration of healing and a subtle acknowledgment of the emotional scars left behind. The song’s chorus is both uplifting and melancholic, which resonated with many listeners.\n\nMusically, \"Better Now\" is driven by a mix of acoustic guitars and trap beats, which creates a dynamic fusion of genres. The production, which Post Malone co-produced with frequent collaborator Frank Dukes, features atmospheric melodies and a steady, bouncy rhythm that enhances the song's emotional depth. The laid-back beat and melodic flow give the track an accessible and radio-friendly feel, making it perfect for mainstream success. Post Malone’s distinctive voice, with its mixture of rap and singing, adds to the track’s appeal, allowing it to cross over into both hip-hop and pop territories.\n\nThe commercial success of \"Better Now\" was significant, as it became one of the standout tracks from Beer Bongs & Bentleys. It peaked at number 3 on the Billboard Hot 100 and remained in the top 10 for multiple weeks, further solidifying Post Malone’s position as one of the most prominent artists of his generation. The song also performed well internationally, charting highly in several countries and becoming one of Post Malone's most recognizable hits. Its success was driven by its relatable lyrics, infectious melody, and cross-genre appeal, which resonated with a wide range of listeners.\n\n\"Better Now\" has received positive reviews from critics and fans alike, praised for its introspective lyrics and genre-blending production. Many noted that it encapsulates the emotional vulnerability that Post Malone often infuses into his music, making it relatable to listeners who have experienced heartbreak or personal struggles. Over time, the song has become one of Post Malone’s signature tracks and remains a favorite in his live performances. Its enduring popularity has solidified its place in the cultural landscape, continuing to be a standout moment in his career. <a href=\"http://www.last.fm/music/Post+Malone/_/Better+Now\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}