{
  "track": {
    "name": "Chemical",
    "mbid": "4d5ea684-6127-4506-b7b3-c5ea5a1eb1d8",
    "url": "https://www.last.fm/music/Post+Malone/_/Chemical",
    "duration": "183000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "511399",
    "playcount": "6237471",
    "artist": {
      "name": "Post Malone",
      "mbid": "b1e26560-60e5-4236-bbdb-9aa5a8d5ee19",
      "url": "https://www.last.fm/music/Post+Malone"
    },
    "album": {
      "artist": "Post Malone",
      "title": "Chemical",
      "url": "https://www.last.fm/music/Post+Malone/Chemical",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/77158e0b32b09ed7c8ab522401182664.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/77158e0b32b09ed7c8ab522401182664.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/77158e0b32b09ed7c8ab522401182664.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/77158e0b32b09ed7c8ab522401182664.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop rock",
          "url": "https://www.last.fm/tag/pop+rock"
        },
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "guitar",
          "url": "https://www.last.fm/tag/guitar"
        },
        {
          "name": "acoustic",
          "url": "https://www.last.fm/tag/acoustic"
        },
        {
          "name": "indie pop",
          "url": "https://www.last.fm/tag/indie+pop"
        }
      ]
    },
    "wiki": {
      "published": "14 Apr 2023, 08:59",
      "summary": "“Chemical\" is a song by American musician Post Malone. It was released through Republic and Mercury Records as the lead single from his fifth studio album, Austin, on April 14, 2023. The song was produced by Malone himself, Andrew Watt, and Louis Bell, and the three wrote it alongside Billy Walsh. One week after its release, the song appeared as the last track on Malone's first compilation album, The Diamond Collection, which was released to celebrate <a href=\"http://www.last.fm/music/Post+Malone/_/Chemical\">Read more on Last.fm</a>.",
      "content": "“Chemical\" is a song by American musician Post Malone. It was released through Republic and Mercury Records as the lead single from his fifth studio album, Austin, on April 14, 2023. The song was produced by Malone himself, Andrew Watt, and Louis Bell, and the three wrote it alongside Billy Walsh. One week after its release, the song appeared as the last track on Malone's first compilation album, The Diamond Collection, which was released to celebrate him becoming the artist with the most diamond-certified singles by the Recording Industry Association of America (RIAA), although the song was not certified at the time of the album's release.\n\nIn an early 2022 interview with Billboard ahead of the release of his fourth studio album, Twelve Carat Toothache (2022), Malone expressed plans to rebuild his artistic vision, even if that meant to compromise commercial success. \"Chemical\" marks his first release as a lead artist since the album. On April 12, 2023, Malone posted a clip of him listening to the song on his social media and announced the release.\n\n\"Chemical\" is a pop rock and synth-pop song that sees Malone return to his trademark sound, while the song is also accompanied by an acoustic \"folk-based\" guitar and \"contemporary pop elements\". It includes a \"bright and catchy\" chorus, which was described as a \"contrast\" to his previous moodier offerings. Despite the upbeat vibe of the chorus, the lyrical content was viewed as \"on-brand\" for Malone, as he opens up about his inability to let go of a seemingly toxic relationship, akin to an addiction.\n\nThe accompanying official music video for \"Chemical\", directed by Alfred Marroquin, was released on April 14, 2023. It sees Malone in different locations, including him smoking in a car like he says in the song as well as him dancing in front of a beach, desert, lightning, and cloud backdrop. In the beginning of the video he briefly walks by a nighttime backdrop. The same backdrop can be seen at the very end of the video as he's seen sitting on top of a vehicle. In the beginning of the video and towards the middle of it, someone from behind the scenes can be seen pushing the backdrops, making way for a different backdrop. Malone also posted a lyric video, in which different angles are shown. The quality of the lyric video was reduced to create a retro effect. <a href=\"http://www.last.fm/music/Post+Malone/_/Chemical\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}