{
  "track": {
    "name": "That That (prod. & feat. SUGA of BTS)",
    "url": "https://www.last.fm/music/Psy/_/That+That+(prod.+&+feat.+SUGA+of+BTS)",
    "duration": "174000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "270559",
    "playcount": "15906511",
    "artist": {
      "name": "Psy",
      "url": "https://www.last.fm/music/Psy"
    },
    "album": {
      "artist": "Psy",
      "title": "PSY 9th",
      "url": "https://www.last.fm/music/Psy/PSY+9th",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/6a1077a737f5b551081230293d81373a.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/6a1077a737f5b551081230293d81373a.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/6a1077a737f5b551081230293d81373a.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/6a1077a737f5b551081230293d81373a.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "02 May 2022, 20:38",
      "summary": "\"That That\" is the second track on PSY 9th. Suga of BTS produced and featured on \"That That\", this marks the first collaboration between the two artists. The “That That” music video also features Suga, rocking cowboy outfits, the two are seen dancing in a saloon and in a car to the catchy tune. Before being approached by Suga, Psy revealed he was worried he had to stop making EDM, but he couldn't do something slow, he thought a Latin-based dance song would work well, which was exactly what Suga had bought. <a href=\"http://www.last.fm/music/Psy/_/That+That+(prod.+&+feat.+SUGA+of+BTS)\">Read more on Last.fm</a>.",
      "content": "\"That That\" is the second track on PSY 9th. Suga of BTS produced and featured on \"That That\", this marks the first collaboration between the two artists. The “That That” music video also features Suga, rocking cowboy outfits, the two are seen dancing in a saloon and in a car to the catchy tune. Before being approached by Suga, Psy revealed he was worried he had to stop making EDM, but he couldn't do something slow, he thought a Latin-based dance song would work well, which was exactly what Suga had bought.\n\nPsy opened up about what it was like to work with the rapper in a video titled “best friends 16 years apart.” “When meeting younger artists, I don’t want to make them feel uncomfortable. I don’t want to be someone who’s hard to approach. He just wasn’t my junior in the business, but also he truly feels like a friend,” Psy said. “It was hard to feel any age gap. If he thinks of me as a bestie, that’s great for me.”\n\nAs the collaboration process went on, Suga and Psy built a personal connection he didn’t anticipate. “To be honest, I haven’t gotten that close with anyone I collab with. It’s because I’m not the type to meet up and collaborate in-person,” Suga said in a separate video. “But he wanted to see me in person. While producing, we went back and forth a lot. I seriously didn’t expect to be dancing with Psy. I thought I was only writing the song!” <a href=\"http://www.last.fm/music/Psy/_/That+That+(prod.+&+feat.+SUGA+of+BTS)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}