{
  "track": {
    "name": "Ride It",
    "mbid": "84d7a8d9-e26e-4fae-85b0-e92498be39c8",
    "url": "https://www.last.fm/music/Regard/_/Ride+It",
    "duration": "159000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "464959",
    "playcount": "4111221",
    "artist": {
      "name": "Regard",
      "mbid": "85f11607-6ed7-4a36-af69-dcadd32ad277",
      "url": "https://www.last.fm/music/Regard"
    },
    "album": {
      "artist": "Various Artists",
      "title": "Now 35",
      "url": "https://www.last.fm/music/Various+Artists/Now+35",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/fdfd652fe474d2396dd5176fa130757e.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/fdfd652fe474d2396dd5176fa130757e.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/fdfd652fe474d2396dd5176fa130757e.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/fdfd652fe474d2396dd5176fa130757e.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "10 May 2024, 07:03",
      "summary": "Kosovo-Albanian DJ Regard officially released a reworked version of Jay Sean's 2008 single \"Ride It\" on 26 July 2019, though earlier versions of the song were available as early as 2017. It became a viral sensation on the TikTok app shortly after release, with over four million clips being posted by people using snippets of the song on the app. Due to the sudden success of the song, Regard subsequently signed to the label Ministry of Sound. The song was a global success <a href=\"http://www.last.fm/music/Regard/_/Ride+It\">Read more on Last.fm</a>.",
      "content": "Kosovo-Albanian DJ Regard officially released a reworked version of Jay Sean's 2008 single \"Ride It\" on 26 July 2019, though earlier versions of the song were available as early as 2017. It became a viral sensation on the TikTok app shortly after release, with over four million clips being posted by people using snippets of the song on the app. Due to the sudden success of the song, Regard subsequently signed to the label Ministry of Sound. The song was a global success, reaching number one in Ireland and Mexico, number two in the UK and peaked within the top 20 in various other European and Oceanian countries. It was certified triple platinum by the BPI. As of 11 July 2025, the track has received over 1.53 billion streams on Spotify.\n\nNeither Regard not Jay Sean appear in the music video, directed by Meji Alabi. The music video was shot in Ukraine; its cast includes English dancer and actor Harry Parr, and the vehicle used also features in the music video for Rosa Linn's 2022 viral hit \"Snap\".\n\nRegard performed the song with Jay Sean at the 2019 Jingle Bell Ball held by Capital FM at The O2 Arena in London on 7 December 2019. <a href=\"http://www.last.fm/music/Regard/_/Ride+It\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}