{
  "track": {
    "name": "These Days (feat. Jess Glynne, Macklemore & Dan Caplen)",
    "url": "https://www.last.fm/music/Rudimental/_/These+Days+(feat.+Jess+Glynne,+Macklemore+&+Dan+Caplen)",
    "duration": "211000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "354441",
    "playcount": "2670080",
    "artist": {
      "name": "Rudimental",
      "mbid": "b09ced80-aa65-43c1-9aa7-58b1e982eada",
      "url": "https://www.last.fm/music/Rudimental"
    },
    "album": {
      "artist": "群星",
      "title": "Q Beach House",
      "url": "https://www.last.fm/music/%E7%BE%A4%E6%98%9F/Q+Beach+House",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/c56ad90bcdffe597952d5397249e4ede.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/c56ad90bcdffe597952d5397249e4ede.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/c56ad90bcdffe597952d5397249e4ede.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/c56ad90bcdffe597952d5397249e4ede.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "28 May 2023, 15:12",
      "summary": "\"These Days\" is a song by English drum and bass band Rudimental, featuring British singers Jess Glynne and Dan Caplen as well as American rapper Macklemore. It was released on 19 January 2018 as the second single from Rudimental's third studio album, Toast to Our Differences, following their UK top 10 hit \"Sun Comes Up\".\n\nAn official music video was released to Rudimental's YouTube channel on 25 January 2018. The video was filmed in London, directed by Johnny Valencia and produced by Shabana Mansuri. <a href=\"http://www.last.fm/music/Rudimental/_/These+Days+(feat.+Jess+Glynne,+Macklemore+&+Dan+Caplen)\">Read more on Last.fm</a>.",
      "content": "\"These Days\" is a song by English drum and bass band Rudimental, featuring British singers Jess Glynne and Dan Caplen as well as American rapper Macklemore. It was released on 19 January 2018 as the second single from Rudimental's third studio album, Toast to Our Differences, following their UK top 10 hit \"Sun Comes Up\".\n\nAn official music video was released to Rudimental's YouTube channel on 25 January 2018. The video was filmed in London, directed by Johnny Valencia and produced by Shabana Mansuri.\n\nDan Caplen, Jamie Scott, Julian Bunetta and John Ryan wrote a demo for \"These Days\" in 2016. After it was produced by Rudimental, Caplen showed it to Macklemore in Los Angeles and he was excited to feature on it. The final vocalist to join was Jess Glynne, who added her vocals to the song after a studio session in 2017.\n\nOn 26 January 2018, \"These Days\" entered the UK Singles Chart at number 33. Two weeks later it charted at number 2, held off the top spot by Drake's song \"God's Plan\". Drake kept Rudimental at bay for a total of seven weeks, giving the latter a record-equalling stint at number 2; the only other songs in UK chart history to spend that number of weeks at number 2 are All-4-One's \"I Swear\" and \"Moves Like Jagger\" by Maroon 5 featuring Christina Aguilera. On 30 March, \"God's Plan\" became subject to accelerated chart ratio (ACR) and \"These Days\" finally reached number 1.\n\nGlynne and Cheryl previously jointly held the record for most number-one singles by a British woman, with five each, but Glynne gained the record in her own right when \"These Days\" reached the summit.\n\nRudimental, Glynne and Caplen performed the song live for the first time on The One Show on 7 February 2018. <a href=\"http://www.last.fm/music/Rudimental/_/These+Days+(feat.+Jess+Glynne,+Macklemore+&+Dan+Caplen)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}