{
  "track": {
    "name": "Please Please Please",
    "mbid": "d0217329-86bd-4e25-a32f-5b73edcf3e03",
    "url": "https://www.last.fm/music/Sabrina+Carpenter/_/Please+Please+Please",
    "duration": "186000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1594285",
    "playcount": "33147918",
    "artist": {
      "name": "Sabrina Carpenter",
      "mbid": "1882fe91-cdd9-49c9-9956-8e06a3810bd4",
      "url": "https://www.last.fm/music/Sabrina+Carpenter"
    },
    "album": {
      "artist": "Sabrina Carpenter",
      "title": "Please Please Please",
      "url": "https://www.last.fm/music/Sabrina+Carpenter/Please+Please+Please",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/bad7187fa0cb0d19edd775f8be53afd6.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/bad7187fa0cb0d19edd775f8be53afd6.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/bad7187fa0cb0d19edd775f8be53afd6.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/bad7187fa0cb0d19edd775f8be53afd6.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "synthpop",
          "url": "https://www.last.fm/tag/synthpop"
        },
        {
          "name": "my top songs",
          "url": "https://www.last.fm/tag/my+top+songs"
        },
        {
          "name": "country pop",
          "url": "https://www.last.fm/tag/country+pop"
        },
        {
          "name": "Sabrina Carpenter",
          "url": "https://www.last.fm/tag/Sabrina+Carpenter"
        }
      ]
    },
    "wiki": {
      "published": "07 Jun 2024, 00:13",
      "summary": "“Please Please Please” is a single by Sabrina Carpenter, released on June 6, 2024, as the second track from her sixth studio album Short n’ Sweet. The song showcases Carpenter’s knack for combining sharp, self-aware lyrics with a breezy, catchy pop production. Co-written by Carpenter alongside Jack Antonoff and Amy Allen, and produced by Antonoff, “Please Please Please” plays with themes of romantic anxiety and public embarrassment, wrapped in Carpenter’s signature wit and sass. <a href=\"http://www.last.fm/music/Sabrina+Carpenter/_/Please+Please+Please\">Read more on Last.fm</a>.",
      "content": "“Please Please Please” is a single by Sabrina Carpenter, released on June 6, 2024, as the second track from her sixth studio album Short n’ Sweet. The song showcases Carpenter’s knack for combining sharp, self-aware lyrics with a breezy, catchy pop production. Co-written by Carpenter alongside Jack Antonoff and Amy Allen, and produced by Antonoff, “Please Please Please” plays with themes of romantic anxiety and public embarrassment, wrapped in Carpenter’s signature wit and sass.\n\nThe track’s narrative revolves around a plea to a lover not to tarnish her reputation or complicate her carefully curated image. With lines like “Heartbreak is one thing, my ego’s another,” Carpenter deftly mixes vulnerability and humor, crafting a song that’s both self-reflective and relatable. Her vocal delivery remains poised yet playful, capturing the tension between hope and caution that comes with entering a new relationship.\n\nMusically, the song leans into a laid-back pop groove with subtle country and retro undertones, guided by Antonoff’s hallmark production style. Minimal yet polished instrumentation allows Carpenter’s voice and lyrics to take center stage. The track’s infectious melody and crisp chorus make it an instant standout, contributing to its rapid commercial success and widespread social media virality.\n\nThe song was accompanied by a stylish music video starring Carpenter and her real-life partner Barry Keoghan, further fueling public interest. “Please Please Please” quickly became a chart-topping hit and a fan favorite, cementing Sabrina Carpenter’s rising status as a pop powerhouse. It continues to resonate with listeners for its clever lyrical tone, relatable storytelling, and bold pop confidence. <a href=\"http://www.last.fm/music/Sabrina+Carpenter/_/Please+Please+Please\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}