{
  "track": {
    "name": "A Bar Song (Tipsy)",
    "mbid": "d85fd2e8-6174-4ffe-bf30-7ddbb9528374",
    "url": "https://www.last.fm/music/Shaboozey/_/A+Bar+Song+(Tipsy)",
    "duration": "171000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "585450",
    "playcount": "5548447",
    "artist": {
      "name": "Shaboozey",
      "mbid": "0b427dad-1ee5-48f1-aa4b-026680a3338e",
      "url": "https://www.last.fm/music/Shaboozey"
    },
    "album": {
      "artist": "Shaboozey",
      "title": "A Bar Song (Tipsy)",
      "url": "https://www.last.fm/music/Shaboozey/A+Bar+Song+(Tipsy)",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/eeb1f2231e2ba26346dce6eb0b76edcd.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/eeb1f2231e2ba26346dce6eb0b76edcd.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/eeb1f2231e2ba26346dce6eb0b76edcd.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/eeb1f2231e2ba26346dce6eb0b76edcd.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "country",
          "url": "https://www.last.fm/tag/country"
        },
        {
          "name": "country rap",
          "url": "https://www.last.fm/tag/country+rap"
        },
        {
          "name": "my top songs",
          "url": "https://www.last.fm/tag/my+top+songs"
        },
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "american",
          "url": "https://www.last.fm/tag/american"
        }
      ]
    },
    "wiki": {
      "published": "24 Jul 2025, 22:38",
      "summary": "\"A Bar Song (Tipsy)\" is a song by American musician Shaboozey. The song was released April 12, 2024, as the fourth single from his third album, Where I've Been, Isn't Where I'm Going. The song tied \"Old Town Road\" by Lil Nas X as the longest-running number-one song of all time on the Billboard Hot 100 with 19 non-consecutive weeks at the top of the chart, and the longest by a solo artist. Outside of the United States, \"A Bar Song (Tipsy)\" topped the charts in Australia <a href=\"http://www.last.fm/music/Shaboozey/_/A+Bar+Song+(Tipsy)\">Read more on Last.fm</a>.",
      "content": "\"A Bar Song (Tipsy)\" is a song by American musician Shaboozey. The song was released April 12, 2024, as the fourth single from his third album, Where I've Been, Isn't Where I'm Going. The song tied \"Old Town Road\" by Lil Nas X as the longest-running number-one song of all time on the Billboard Hot 100 with 19 non-consecutive weeks at the top of the chart, and the longest by a solo artist. Outside of the United States, \"A Bar Song (Tipsy)\" topped the charts in Australia, Belgium (Flanders), Canada, Ireland, Norway, and Sweden, and peaked within the top ten of the charts in Austria, Belgium (Wallonia), Denmark, Iceland, the Netherlands, New Zealand, South Africa, Switzerland, and the United Kingdom.\n\n\"A Bar Song (Tipsy)\" was nominated for Song of the Year, Best Country Song, and Best Country Solo Performance at the 67th Annual Grammy Awards, with Shaboozey also being nominated for Best New Artist.\n\n\"A Bar Song (Tipsy)\" charted at number one on Billboard's Hot Country Songs. As it succeeded Beyoncé's \"Texas Hold 'Em\" at the top, this was the first time in history that two black artists held the number-one position there in consecutive weeks. This song made Shaboozey the first male black artist to chart at number one on Billboard's Hot 100 and Hot Country Songs charts at the same time; Beyoncé had previously become the first black artist to do so with \"Texas Hold 'Em\". The song also made Shaboozey the first male black artist to chart at number one on Billboard's Hot Country Songs and Country Airplay charts at the same time. In addition, it spent seven weeks at number one on the latter chart, surpassing the record for the longest-running number one debut single previously set by Carrie Underwood's \"Jesus, Take the Wheel\", which spent six weeks at the top in January–February 2006. The song spent 25 weeks at number one on the Canadian Hot 100, breaking the record for the longest-running number one hit ever on the chart set by \"Old Town Road\" by Lil Nas X featuring Billy Ray Cyrus in 2019. On the Billboard Hot 100, it became the longest-running number one song in the chart's history, tying the record set five years earlier by \"Old Town Road\". It was named the top single of 2024 by RIAA. <a href=\"http://www.last.fm/music/Shaboozey/_/A+Bar+Song+(Tipsy)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}