{
  "track": {
    "name": "Until I Found You",
    "mbid": "5d132952-d348-48dd-94ce-b42644ceeb2f",
    "url": "https://www.last.fm/music/Stephen+Sanchez/_/Until+I+Found+You",
    "duration": "177000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "883147",
    "playcount": "9041208",
    "artist": {
      "name": "Stephen Sanchez",
      "mbid": "a9c38fd2-04be-4bc6-a3bc-96508b226508",
      "url": "https://www.last.fm/music/Stephen+Sanchez"
    },
    "album": {
      "artist": "Stephen Sanchez",
      "title": "Until I Found You - Single",
      "url": "https://www.last.fm/music/Stephen+Sanchez/Until+I+Found+You+-+Single",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/698dd90731310b1060e63558b0b30945.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/698dd90731310b1060e63558b0b30945.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/698dd90731310b1060e63558b0b30945.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/698dd90731310b1060e63558b0b30945.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "Love",
          "url": "https://www.last.fm/tag/Love"
        },
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "sweet",
          "url": "https://www.last.fm/tag/sweet"
        },
        {
          "name": "american",
          "url": "https://www.last.fm/tag/american"
        },
        {
          "name": "Traditional Pop",
          "url": "https://www.last.fm/tag/Traditional+Pop"
        }
      ]
    },
    "wiki": {
      "published": "23 Feb 2022, 00:54",
      "summary": "Released on September 1, 2021, \"Until I Found You\" became Stephen Sanchez's first hit after it went viral on TikTok.\n\nSanchez was in a bad place when he first met singer-songwriter Georgia Webster. When she started showing him love, Sanchez didn't feel good enough for Georgia, so he pushed her away. They spent some time apart – she in Virginia and him in California – then a month before he moved to Nashville, he contacted her on the phone. Sanchez drove to Virginia, took her for a date, and they connected just like old times. <a href=\"http://www.last.fm/music/Stephen+Sanchez/_/Until+I+Found+You\">Read more on Last.fm</a>.",
      "content": "Released on September 1, 2021, \"Until I Found You\" became Stephen Sanchez's first hit after it went viral on TikTok.\n\nSanchez was in a bad place when he first met singer-songwriter Georgia Webster. When she started showing him love, Sanchez didn't feel good enough for Georgia, so he pushed her away. They spent some time apart – she in Virginia and him in California – then a month before he moved to Nashville, he contacted her on the phone. Sanchez drove to Virginia, took her for a date, and they connected just like old times. They've been together ever since.\n\nSanchez penned \"Until I Found You\" to tell Georgia \"how much I love her, and to let her know I knew how much of an idiot I was when I let her go the first time.\"\n\nGeorgia Webster also contributes vocals to the song while Sanchez plays the electric guitar.\nIan Fitchuk produced the track. Sanchez released an updated version featuring Em Beihold on April 2, 2022. The Los Angeles-based musician contributes a verse from Georgia's perspective, where she assures him she'd rather die than let him go.\n\n“When I met my girlfriend, Georgia, I was in the worst place ever. She was so loving and great to me though. I didn’t feel good enough for that, so I pushed her away. We spent some time apart. She was in Virginia. I was in California. A month before I moved to Nashville, we reconnected over the phone. I drove up, took her on a date, and we’ve been together ever since. I wrote ‘Until I found You’ to let her know how much I love her. And to let her know I knew how much of an idiot I was when I let her go the first time.” says Stephen.\n\n\"i love you in every universe\" - Stephen Strange to Christine <a href=\"http://www.last.fm/music/Stephen+Sanchez/_/Until+I+Found+You\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}