{
  "track": {
    "name": "ily (i love you baby) (feat. Emilee)",
    "url": "https://www.last.fm/music/Surf+Mesa/_/ily+(i+love+you+baby)+(feat.+Emilee)",
    "duration": "0",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "341269",
    "playcount": "2351077",
    "artist": {
      "name": "Surf Mesa",
      "url": "https://www.last.fm/music/Surf+Mesa"
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "03 May 2023, 18:15",
      "summary": "\"ily (i love you baby)\", originally titled \"ily\", is a song by American producer Surf Mesa featuring vocals by Emilee Flood. It was first released on November 26, 2019. When the song was re-released through Astralwerks and Universal in February 2020, it started gaining popularity through user-generated clips on the app TikTok. The song has since topped the Romanian Airplay 100 chart. It further reached the top 10 in Austria, Germany, the Netherlands <a href=\"http://www.last.fm/music/Surf+Mesa/_/ily+(i+love+you+baby)+(feat.+Emilee)\">Read more on Last.fm</a>.",
      "content": "\"ily (i love you baby)\", originally titled \"ily\", is a song by American producer Surf Mesa featuring vocals by Emilee Flood. It was first released on November 26, 2019. When the song was re-released through Astralwerks and Universal in February 2020, it started gaining popularity through user-generated clips on the app TikTok. The song has since topped the Romanian Airplay 100 chart. It further reached the top 10 in Austria, Germany, the Netherlands, Slovakia, and Switzerland, as well as the top 40 in Australia, Belgium (Flanders and Wallonia), the Czech Republic, Denmark, Estonia, France, Ireland, Lithuania, New Zealand, and Norway. The song is a basic rendition of the chorus from the 1967 song \"Can't Take My Eyes Off You\" by Frankie Valli.\n\nMike Wass of Idolator described the song as a \"chorus on a loop over a dreamy synth-scape that falls somewhere between Petit Biscuit and Kasbo\" and praised it as \"the perfect soundtrack to any blissed-out moment\". Hits Daily Double called the song \"the heating-up club banger\" version of the original. <a href=\"http://www.last.fm/music/Surf+Mesa/_/ily+(i+love+you+baby)+(feat.+Emilee)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}