{
  "track": {
    "name": "Moth to a Flame (with The Weeknd)",
    "url": "https://www.last.fm/music/Swedish+House+Mafia/_/Moth+to+a+Flame+(with+The+Weeknd)",
    "duration": "234000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "855592",
    "playcount": "13255560",
    "artist": {
      "name": "Swedish House Mafia",
      "mbid": "99075985-0d80-4692-a15e-b16f78831792",
      "url": "https://www.last.fm/music/Swedish+House+Mafia"
    },
    "album": {
      "artist": "Swedish House Mafia",
      "title": "Moth to a Flame",
      "url": "https://www.last.fm/music/Swedish+House+Mafia/Moth+to+a+Flame",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/fc5e890b423abc1737087a772790829d.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/fc5e890b423abc1737087a772790829d.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/fc5e890b423abc1737087a772790829d.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/fc5e890b423abc1737087a772790829d.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "dance",
          "url": "https://www.last.fm/tag/dance"
        },
        {
          "name": "electronic",
          "url": "https://www.last.fm/tag/electronic"
        },
        {
          "name": "2021",
          "url": "https://www.last.fm/tag/2021"
        },
        {
          "name": "synthpop",
          "url": "https://www.last.fm/tag/synthpop"
        },
        {
          "name": "The Weeknd",
          "url": "https://www.last.fm/tag/The+Weeknd"
        }
      ]
    },
    "wiki": {
      "published": "07 Jan 2022, 16:37",
      "summary": "“Moth to a Flame” is a collaborative single released on October 22, 2021 by Swedish electronic music duo Swedish House Mafia and Canadian singer The Weeknd. Serving as one of the key tracks from Swedish House Mafia’s 2022 album Paradise Again, the song blends the group’s dark, synth-driven production with The Weeknd’s signature falsetto vocals. It marked an important moment in Swedish House Mafia’s comeback era while also continuing The Weeknd’s run of high-profile collaborations. <a href=\"http://www.last.fm/music/Swedish+House+Mafia/_/Moth+to+a+Flame+(with+The+Weeknd)\">Read more on Last.fm</a>.",
      "content": "“Moth to a Flame” is a collaborative single released on October 22, 2021 by Swedish electronic music duo Swedish House Mafia and Canadian singer The Weeknd. Serving as one of the key tracks from Swedish House Mafia’s 2022 album Paradise Again, the song blends the group’s dark, synth-driven production with The Weeknd’s signature falsetto vocals. It marked an important moment in Swedish House Mafia’s comeback era while also continuing The Weeknd’s run of high-profile collaborations.\n\nLyrically and sonically, “Moth to a Flame” explores the pull of irresistible attraction and emotional conflict, a theme that resonates with both artists’ discographies. The track stands out for its moody atmosphere, minimalistic beat, and haunting melodies that echo 1980s electronic influences. Critics praised the song’s seamless fusion of dance and R&B elements, highlighting how it bridges club-ready energy with introspective storytelling.\n\nUpon release, the single quickly gained international attention, debuting on numerous charts and amassing millions of streams across platforms. Its accompanying music video, directed by Alexander Wessely, further emphasized the track’s shadowy aesthetic and narrative tension. “Moth to a Flame” has since become a fan favorite at festivals and on radio playlists, cementing its place as one of the standout collaborations between an iconic electronic act and one of contemporary pop’s biggest stars. <a href=\"http://www.last.fm/music/Swedish+House+Mafia/_/Moth+to+a+Flame+(with+The+Weeknd)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}