{
  "track": {
    "name": "The Less I Know the Better",
    "mbid": "78be434c-0908-458f-9693-f16cdebb68ef",
    "url": "https://www.last.fm/music/Tame+Impala/_/The+Less+I+Know+the+Better",
    "duration": "217000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "2491434",
    "playcount": "42597772",
    "artist": {
      "name": "Tame Impala",
      "mbid": "63aa26c3-d59b-4da4-84ac-716b54f1ef4d",
      "url": "https://www.last.fm/music/Tame+Impala"
    },
    "album": {
      "artist": "Tame Impala",
      "title": "Currents",
      "url": "https://www.last.fm/music/Tame+Impala/Currents",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/dd45b0438a315aed98b5830aa2fc43c5.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/dd45b0438a315aed98b5830aa2fc43c5.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/dd45b0438a315aed98b5830aa2fc43c5.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/dd45b0438a315aed98b5830aa2fc43c5.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "psychedelic",
          "url": "https://www.last.fm/tag/psychedelic"
        },
        {
          "name": "psychedelic pop",
          "url": "https://www.last.fm/tag/psychedelic+pop"
        },
        {
          "name": "indie",
          "url": "https://www.last.fm/tag/indie"
        },
        {
          "name": "Neo-Psychedelia",
          "url": "https://www.last.fm/tag/Neo-Psychedelia"
        },
        {
          "name": "Disco",
          "url": "https://www.last.fm/tag/Disco"
        }
      ]
    },
    "wiki": {
      "published": "20 Jul 2016, 04:32",
      "summary": "“The Less I Know the Better” describes the pain of a man feeling left out in a love triangle, illustrated with a complex arrangement of groovy bass hooks, sensual Rhodes piano chords, and moody synth textures.\n\nTame Impala frontman Kevin Parker has said that the song doesn’t belong on the album “because it has this dorky, white disco funk.” However, it is by far the most popular track on Currents, thanks in no small part to its breakout music video fusing psychedelia, sex appeal, high school angst, and a man in a gorilla costume. <a href=\"http://www.last.fm/music/Tame+Impala/_/The+Less+I+Know+the+Better\">Read more on Last.fm</a>.",
      "content": "“The Less I Know the Better” describes the pain of a man feeling left out in a love triangle, illustrated with a complex arrangement of groovy bass hooks, sensual Rhodes piano chords, and moody synth textures.\n\nTame Impala frontman Kevin Parker has said that the song doesn’t belong on the album “because it has this dorky, white disco funk.” However, it is by far the most popular track on Currents, thanks in no small part to its breakout music video fusing psychedelia, sex appeal, high school angst, and a man in a gorilla costume.\n\nThis track follows the synth vignette “Gossip,” suggesting that the narrator, voiced by Parker, is hearing news about the woman he wants – that she is hooking up with someone named Trevor. The song’s title comes from his insecurity – if people give him the details of his crush’s sexual activity, the more it will dominate his thoughts and leave her seemingly defiled in his mind (“is this who you are?”).\n\nAs illustrated by the music video’s gorilla, Trevor vs. Kevin appears to be the classic “alpha-beta” struggle for women’s affections. Trevor has her attention for now because of his sexual prowess (he is her “lover… like every night”), but she knows that Parker would be the better long-term partner (“Wait ten years, we’ll be together”). However, Kevin warns her that his patience will not last “forever.”\n\nFollowing its success on the record, “The Less I Know The Better” was released as a radio single on November 29th, 2015. The song was voted number 1 in Triple J’s Hottest 100 of the decade.\n\n“The Less I Know The Better” was certified 4x platinum on February 11, 2022. <a href=\"http://www.last.fm/music/Tame+Impala/_/The+Less+I+Know+the+Better\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}