{
  "track": {
    "name": "Blank Space",
    "mbid": "576b16cf-33f8-4524-9782-8d227ca7f11b",
    "url": "https://www.last.fm/music/Taylor+Swift/_/Blank+Space",
    "duration": "231000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1707999",
    "playcount": "26531826",
    "artist": {
      "name": "Taylor Swift",
      "mbid": "20244d07-534f-4eff-b4d4-930878889970",
      "url": "https://www.last.fm/music/Taylor+Swift"
    },
    "album": {
      "artist": "Taylor Swift",
      "title": "1989",
      "url": "https://www.last.fm/music/Taylor+Swift/1989",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/e740f250a8e84ca392b14dd896a53ff9.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/e740f250a8e84ca392b14dd896a53ff9.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/e740f250a8e84ca392b14dd896a53ff9.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/e740f250a8e84ca392b14dd896a53ff9.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "love at first listen",
          "url": "https://www.last.fm/tag/love+at+first+listen"
        },
        {
          "name": "2014",
          "url": "https://www.last.fm/tag/2014"
        },
        {
          "name": "female vocalists",
          "url": "https://www.last.fm/tag/female+vocalists"
        },
        {
          "name": "best of 2014",
          "url": "https://www.last.fm/tag/best+of+2014"
        }
      ]
    },
    "wiki": {
      "published": "27 Dec 2014, 16:25",
      "summary": "\"Blank Space\" is a song by American singer-songwriter Taylor Swift, from her fifth studio album, 1989 (2014). The song was released to US radio stations as the second single from 1989 on November 10, 2014, by Republic Records in partnership with Big Machine. Swift co-wrote \"Blank Space\" with its producers Max Martin and Shellback. In the lyrics, she conceived the song as a satirical self-referential nod to her reputation as a flirtatious woman with a series of romantic attachments, which blemished her once-wholesome girl next door image. <a href=\"http://www.last.fm/music/Taylor+Swift/_/Blank+Space\">Read more on Last.fm</a>.",
      "content": "\"Blank Space\" is a song by American singer-songwriter Taylor Swift, from her fifth studio album, 1989 (2014). The song was released to US radio stations as the second single from 1989 on November 10, 2014, by Republic Records in partnership with Big Machine. Swift co-wrote \"Blank Space\" with its producers Max Martin and Shellback. In the lyrics, she conceived the song as a satirical self-referential nod to her reputation as a flirtatious woman with a series of romantic attachments, which blemished her once-wholesome girl next door image. Musically, it is an electropop song with minimal hip hop-influenced beats.\n\n\"Blank Space\" spent seven weeks atop the US Billboard Hot 100 and was certified eight times platinum by the Recording Industry Association of America (RIAA). It also topped charts in Australia, Canada, Iceland, Scotland, and South Africa. The International Federation of the Phonographic Industry (IFPI) reported that \"Blank Space\" was one of the best-selling singles of 2015. Critics praised the song's production and Swift's songwriting; some picked it as 1989's highlight. The song earned three nominations at the 58th Grammy Awards, including two general categories: Record of the Year and Song of the Year. It featured on decade-end lists by such publications as Billboard, Rolling Stone, and Slant Magazine.\n\nJoseph Kahn directed the music video for \"Blank Space\", which depicts Swift as a jealous woman who acts erratically upon suspecting her boyfriend's infidelity. Photography took place mostly at Oheka Castle, with a few additional scenes shot at Woolworth Estate. The video won Best Pop Video and Best Female Video at the 2015 MTV Video Music Awards. Swift included \"Blank Space\" on the set lists for three of her concert tours: the 1989 World Tour (2015), Reputation Stadium Tour (2018), and the Eras Tour (2023). The song has been adapted into cover versions of different genres by several rock musicians, including I Prevail and Ryan Adams. <a href=\"http://www.last.fm/music/Taylor+Swift/_/Blank+Space\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}