{
  "track": {
    "name": "Something Just Like This",
    "mbid": "6fdd95d6-9837-4d95-91f4-b123d0696a2a",
    "url": "https://www.last.fm/music/The+Chainsmokers/_/Something+Just+Like+This",
    "duration": "247000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "1132064",
    "playcount": "9857857",
    "artist": {
      "name": "The Chainsmokers",
      "mbid": "91a81925-92f9-4fc9-b897-93cf01226282",
      "url": "https://www.last.fm/music/The+Chainsmokers"
    },
    "album": {
      "artist": "The Chainsmokers",
      "title": "Memories...Do Not Open",
      "url": "https://www.last.fm/music/The+Chainsmokers/Memories...Do+Not+Open",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/96ce941e795755d46ce76c092732d7d0.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/96ce941e795755d46ce76c092732d7d0.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/96ce941e795755d46ce76c092732d7d0.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/96ce941e795755d46ce76c092732d7d0.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "dance",
          "url": "https://www.last.fm/tag/dance"
        },
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        },
        {
          "name": "electronic",
          "url": "https://www.last.fm/tag/electronic"
        },
        {
          "name": "Coldplay",
          "url": "https://www.last.fm/tag/Coldplay"
        },
        {
          "name": "the chainsmokers",
          "url": "https://www.last.fm/tag/the+chainsmokers"
        }
      ]
    },
    "wiki": {
      "published": "27 Feb 2017, 11:15",
      "summary": "\"Something Just Like This\" is a song by American electronic music duo The Chainsmokers and British rock band Coldplay. It was released on February 22, 2017 as the second single from the former's debut album Memories...Do Not Open and as the lead single of the latter's Kaleidoscope EP.\n\nIt reached the Top 10 of various charts around the world, including number two in the UK Singles Chart and the ARIA Charts and three on the Billboard Hot 100. The song <a href=\"http://www.last.fm/music/The+Chainsmokers/_/Something+Just+Like+This\">Read more on Last.fm</a>.",
      "content": "\"Something Just Like This\" is a song by American electronic music duo The Chainsmokers and British rock band Coldplay. It was released on February 22, 2017 as the second single from the former's debut album Memories...Do Not Open and as the lead single of the latter's Kaleidoscope EP.\n\nIt reached the Top 10 of various charts around the world, including number two in the UK Singles Chart and the ARIA Charts and three on the Billboard Hot 100. The song was also nominated for a Grammy Award for Best Pop Duo/Group Performance at the 60th Annual Grammy Awards being listed as one of the best songs of the year by Uproxx and 3voor12.\n\nIn September 2016, the Chainsmokers shared three short clips of an upcoming song featuring vocals from Coldplay's lead vocalist Chris Martin. On February 22, 2017, Spotify prematurely posted a banner ad at the top of the site's home page with a Listen Now button.\n\nThe song is written in the key of D major and has a tempo of 103.156 beats per minute in common time. It follows a chord progression of G(add9)–Asus–Bm–Asus, and the vocals span two octaves, from G2 to G4.\n\nOn the same date, Coldplay premiered \"Something Just Like This\" with the Chainsmokers on stage at the Brit Awards at The O2 Arena in London, England. They then performed the song at the 2017 iHeartRadio Music Awards at The Forum in Inglewood, California on March 5, 2017 and on their A Head Full of Dreams Tour since the Singapore show on March 31, 2017. It was performed again at the One Love Manchester benefit concert for the victims of the Manchester Arena bombing on June 4, 2017.\n\nA lyric video was also released on February 22, 2017 on the Chainsmokers' Vevo channel. It has received over 2.1 billion views and is one of the 70 most viewed videos on YouTube. It was directed by James Zwadlo.\n\n\"Something Just Like This\" debuted at number 56 on the Billboard Hot 100 and soared to number five on its second week, becoming the Chainsmokers' third top five after \"Don't Let Me Down\" and \"Closer\". Meanwhile, it was Coldplay's second top five hit after \"Viva la Vida\", which peaked at number three on the Billboard Hot 100 ever since. The song was also the sixth best-selling track of 2017 in the United States with 1,348,000 copies sold. In the United Kingdom, \"Something Just Like This\" debuted at number 30 on 24 February 2017, reaching its number two peak position the following week behind Ed Sheeran's \"Shape of You\". It spent nine consecutive weeks in the top 10 and became the ninth biggest song of the year in the country. The song also set a new record for most weeks atop Billboard's Hot Dance/Electronic Songs chart. <a href=\"http://www.last.fm/music/The+Chainsmokers/_/Something+Just+Like+This\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}