{
  "track": {
    "name": "THE SCOTTS",
    "url": "https://www.last.fm/music/The+Scotts/_/THE+SCOTTS",
    "duration": "162000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "677355",
    "playcount": "7263582",
    "artist": {
      "name": "The Scotts",
      "url": "https://www.last.fm/music/The+Scotts"
    },
    "album": {
      "artist": "The Scotts",
      "title": "Love Language",
      "url": "https://www.last.fm/music/The+Scotts/Love+Language",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/b238803a3fd6c0bba9f3221e7075381f.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/b238803a3fd6c0bba9f3221e7075381f.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/b238803a3fd6c0bba9f3221e7075381f.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/b238803a3fd6c0bba9f3221e7075381f.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "trap",
          "url": "https://www.last.fm/tag/trap"
        },
        {
          "name": "rap",
          "url": "https://www.last.fm/tag/rap"
        },
        {
          "name": "2020",
          "url": "https://www.last.fm/tag/2020"
        },
        {
          "name": "travis scott",
          "url": "https://www.last.fm/tag/travis+scott"
        },
        {
          "name": "2020s",
          "url": "https://www.last.fm/tag/2020s"
        }
      ]
    },
    "wiki": {
      "published": "09 Jun 2020, 10:04",
      "summary": "\"THE SCOTTS\" is a song by American hip-hop super-duo The Scotts, composed of rappers Travis Scott and Kid Cudi. It was released in various formats, including on 7-inch vinyl, cassette, and as a CD single through Epic, Cactus Jack, and Wicked Awesome on April 24, 2020. Four different visuals on YouTube supported the song release.\n\nThe song debuted atop the Billboard Hot 100, for the chart dated May 9, 2020, becoming Scott's third US number-one single, following \"Sicko Mode\" and \"Highest in the Room\" as Cudi's first US number-one single. <a href=\"http://www.last.fm/music/The+Scotts/_/THE+SCOTTS\">Read more on Last.fm</a>.",
      "content": "\"THE SCOTTS\" is a song by American hip-hop super-duo The Scotts, composed of rappers Travis Scott and Kid Cudi. It was released in various formats, including on 7-inch vinyl, cassette, and as a CD single through Epic, Cactus Jack, and Wicked Awesome on April 24, 2020. Four different visuals on YouTube supported the song release.\n\nThe song debuted atop the Billboard Hot 100, for the chart dated May 9, 2020, becoming Scott's third US number-one single, following \"Sicko Mode\" and \"Highest in the Room\" as Cudi's first US number-one single.\n\nBoth artists had previously collaborated on Scott's \"Through the Late Night\" and \"Way Back\" on Birds in the Trap Sing McKnight, Cudi's \"Baptized in Fire\" on Passion, Pain & Demon Slayin', and Scott's \"Stop Trying to Be God\" on Astroworld. On September 3, 2021, Kid Cudi stated via Twitter that a full-length \"THE SCOTTS\" album was in store for the future, though he noted that he did not know when it would happen, only that it would come at some point. In December 2022, Cudi revealed he was no longer working on the album, effectively announcing its cancellation.\n\nOn April 20, 2020, it was reported that Scott teamed up with Fortnite Battle Royale to start a virtual tour through the game called \"Astronomical\" starting on April 23 until April 25. The rapper would premiere and play a new song at several different times during the game. Players of the game got to hear snippets of the song before its official release. In total, the concert was witnessed by an audience of over 12 million players. On April 23, Scott revealed the cover art of the song on his Instagram and announced that the song would feature Kid Cudi. The song title is a reference to Scott's stage surname and Cudi's real first name, which inspired Scott to take the name in the first place. The cover art of the single was created by American artist Kaws. <a href=\"http://www.last.fm/music/The+Scotts/_/THE+SCOTTS\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}