{
  "track": {
    "name": "One of Your Girls",
    "mbid": "4d8f94fb-c927-4328-b8e0-61ccc44c2189",
    "url": "https://www.last.fm/music/Troye+Sivan/_/One+of+Your+Girls",
    "duration": "181000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "816365",
    "playcount": "16277712",
    "artist": {
      "name": "Troye Sivan",
      "mbid": "e5712ceb-c37a-4c49-a11c-ccf4e21852d4",
      "url": "https://www.last.fm/music/Troye+Sivan"
    },
    "album": {
      "artist": "Troye Sivan",
      "title": "Something To Give Each Other [Clean] [Clean]",
      "url": "https://www.last.fm/music/Troye+Sivan/Something+To+Give+Each+Other+%5BClean%5D+%5BClean%5D",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/d8ebbbb2527712e94934fd107b251607.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/d8ebbbb2527712e94934fd107b251607.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/d8ebbbb2527712e94934fd107b251607.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/d8ebbbb2527712e94934fd107b251607.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "nu-disco",
          "url": "https://www.last.fm/tag/nu-disco"
        },
        {
          "name": "synthpop",
          "url": "https://www.last.fm/tag/synthpop"
        },
        {
          "name": "contemporary rnb",
          "url": "https://www.last.fm/tag/contemporary+rnb"
        },
        {
          "name": "House",
          "url": "https://www.last.fm/tag/House"
        },
        {
          "name": "rnb",
          "url": "https://www.last.fm/tag/rnb"
        }
      ]
    },
    "wiki": {
      "published": "13 Nov 2023, 22:30",
      "summary": "“One Of Your Girls” is a synth-pop track that serves as the third single out of Sivan’s studio album, Something to Give Each Other, released with the whole project on October 13, 2023. The record was written about “experiences that I had with guys who had not previously been with guys, and were showing me interest”.\n\nThe song is produced by Oscar Görres (OZGO) and features Max Martin’s contribution to the synths. Troye said in an interview that Max Martin had requested to not be credited and had “given it to them as a gift”. <a href=\"http://www.last.fm/music/Troye+Sivan/_/One+of+Your+Girls\">Read more on Last.fm</a>.",
      "content": "“One Of Your Girls” is a synth-pop track that serves as the third single out of Sivan’s studio album, Something to Give Each Other, released with the whole project on October 13, 2023. The record was written about “experiences that I had with guys who had not previously been with guys, and were showing me interest”.\n\nThe song is produced by Oscar Görres (OZGO) and features Max Martin’s contribution to the synths. Troye said in an interview that Max Martin had requested to not be credited and had “given it to them as a gift”.\n\n\"I was in this phase of crushing super hard on people. My weakness is essentially a fashion-y art fuck boi who’s beautiful and tall and everywhere all the time. You don’t really know what he does or where he lives and boys and girls are obsessed with him. So I built this character based off people I’d met over the years. The same weekend Oscar started the track I was having this experience with a guy who identifies as straight. I messaged him sort of joking, like, okay let me know if you’re feeling gay on Saturday night. But that got me thinking and it came with a lot of introspection. Why am I throwing myself at this person? Why does it feel so validating that they’re interested? At the same time this idea of a sad robot voice came together for the chorus. I’m basically having a conversation with myself.\" - via Genius\n\n\"I think this is my favourite song I’ve ever worked on. This thing kept happening where I was being approached by guys who’d previously or historically identified as straight. They were flirting with me, saying there was something in me that they were interested in. I just felt all these different things. Firstly, I was placing them on such a pedestal. I was like, why is this so hot? And also questioning myself because I’d always end up heartbroken. I think I knew I wasn’t treating myself with the respect I deserved by being the secret or the experiment. We wrote three different choruses and ended up coming to this sad robot thing, inspired by a movie I’d seen. Even that spoke to the way I’d felt: like I was expected to be there when they wanted me, then disappear when they freaked out, then be there again when they wanted. Like this emotionless object. And yet there I was time and time again. You don’t want to rush them through the process of figuring shit out. This isn’t me making any sort of statement—I have patience for that experience. I’m just musing to myself about it.\" – Troye Sivan via Apple Music (October 13, 2023)\n\nDuring the tracking week ending November 4, 2023, the song debuted at #79 on the Billboard Hot 100 chart. The song marks Sivan’s second single to appear on the Hot 100, his first being “Rush”, which peaked at #77. <a href=\"http://www.last.fm/music/Troye+Sivan/_/One+of+Your+Girls\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}