{
  "track": {
    "name": "See You Again (feat. Charlie Puth)",
    "mbid": "c6cf4924-75b7-40b3-8d66-f50ff8aec30e",
    "url": "https://www.last.fm/music/Wiz+Khalifa/_/See+You+Again+(feat.+Charlie+Puth)",
    "duration": "229000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "887890",
    "playcount": "6428604",
    "artist": {
      "name": "Wiz Khalifa",
      "mbid": "f5dfa020-ad69-41cd-b3d4-fd7af0414e94",
      "url": "https://www.last.fm/music/Wiz+Khalifa"
    },
    "album": {
      "artist": "Charlie Puth",
      "title": "Nine Track Mind",
      "url": "https://www.last.fm/music/Charlie+Puth/Nine+Track+Mind",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/003a0fc6117294c106ec986514fec8ce.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/003a0fc6117294c106ec986514fec8ce.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/003a0fc6117294c106ec986514fec8ce.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/003a0fc6117294c106ec986514fec8ce.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": [
        {
          "name": "Hip-Hop",
          "url": "https://www.last.fm/tag/Hip-Hop"
        },
        {
          "name": "Soundtrack",
          "url": "https://www.last.fm/tag/Soundtrack"
        },
        {
          "name": "piano",
          "url": "https://www.last.fm/tag/piano"
        },
        {
          "name": "2015",
          "url": "https://www.last.fm/tag/2015"
        },
        {
          "name": "pop",
          "url": "https://www.last.fm/tag/pop"
        }
      ]
    },
    "wiki": {
      "published": "18 Mar 2015, 08:09",
      "summary": "“See You Again” is a tribute to the late Furious actor Paul Walker who died tragically in November of 2013 after his car crashed and burst into flames in Valencia, CA. The first verse is from the perspective of Vin Diesel and the Furious 7 cast members, while the second is from Paul Walker.\n\nIts popularity grew quickly after the release of the film Furious 7, and the music video eventually became the first hip hop song to reach 1 billion YouTube views. <a href=\"http://www.last.fm/music/Wiz+Khalifa/_/See+You+Again+(feat.+Charlie+Puth)\">Read more on Last.fm</a>.",
      "content": "“See You Again” is a tribute to the late Furious actor Paul Walker who died tragically in November of 2013 after his car crashed and burst into flames in Valencia, CA. The first verse is from the perspective of Vin Diesel and the Furious 7 cast members, while the second is from Paul Walker.\n\nIts popularity grew quickly after the release of the film Furious 7, and the music video eventually became the first hip hop song to reach 1 billion YouTube views. It topped the Billboard Hot 100 for twelve weeks, becoming the longest-running rap number one since Eminem’s “Lose Yourself.”\n\nThis marks Wiz Khalifa’s second release from the Furious 7 soundtrack, his first being “Go Hard or Go Home” featuring Iggy Azalea.\n\nCharlie Puth, DJ Frank E and Andrew Cedar produced this song.\n\nAfter the music video became the most-watched video on YouTube in July 2017, Puth told Billboard:\n\n\"I don’t know if a lot of people know this, I wasn’t supposed to be in the video. I wasn’t supposed to be on the song; I was only supposed to be a writer on the song. I was a brand new artist, I wasn’t cool enough to be part of the franchise yet, I wasn’t big enough, but I proved everybody who was close-minded wrong. Everyone on my record label stuck beside me and my management.\n\nI’ll never forget I ended up calling them from around this big conference table on the phone, and they were explaining the reasons why it was going to be sung by this artist and blah, blah blah, I’m not going to name any names, but… I said, ‘That’s great. Your movie comes out in a week and I’m not gonna give you the song.’ And I hung up the phone and when I said that miraculously I was in the music video.\"\n\nAccording to Songfacts, Charlie Puth said to American Songwriter:\n\n\"I had come out here by myself just to go to LA and be a songwriter, because that’s what I originally intended to do. Though between you and me, in the back of my mind I also secretly wanted to be an artist, but I thought the best way to go about that was to write songs first. My first day I wrote my other single “Marvin Gaye, My second day I heard a message from the Fast and Furious franchise that they wanted a song to honor Paul Walker’s legacy for a three-minute scene at the end of the movie – the most significant part of the movie. I thought, ‘Who am I?’ But I took a whack at writing it. I wrote it with my co-writer, Justin, who I just met at the time. When we wrote the song it was so powerful – just crazy human interaction. We were like, ‘How did we just do this so quickly?’ We sent it to them and they loved it, they got Wiz Khalifa on it, and the rest is history.\"\n\nHe also explained he didn’t see the movie before writing the song:\n\n\"They just told me about the scenes. Later on, they wanted us to write a bridge which became [singing] ‘So let the light guide your way, hold every memory as you go,’ so I actually went to see a rough cut of the movie with the song and – oh, you know what I just realized? When I went to that rough cut I still didn’t know they were going to use my vocals on it. They were going to get someone else to sing it – and they had a lot of great people try it – but they showed the movie with me singing the hook. I was like, ‘By the way, did you guys put my cut of the vocals in there on accident?’ And they’re like, ‘Oh, no. We’re going to use you on the song.’ I was like, ‘What!? You’re going to use me?!\"\n\nWiz Khalifa said to Billboard magazine:\n\n\"I loved Charlie’s voice and the message. I’ve lost a lot of people, so I just channeled that energy.\"\n\n“See You Again” was certified 11x platinum by the RIAA on September 24, 2019. This marked the first diamond-certified record for both artists. <a href=\"http://www.last.fm/music/Wiz+Khalifa/_/See+You+Again+(feat.+Charlie+Puth)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}