{
  "track": {
    "name": "MANIKIN (Feat. wifisfuneral)",
    "url": "https://www.last.fm/music/XXXTENTACION/_/MANIKIN+(Feat.+wifisfuneral)",
    "duration": "0",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "54006",
    "playcount": "396873",
    "artist": {
      "name": "XXXTENTACION",
      "url": "https://www.last.fm/music/XXXTENTACION"
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "09 Sep 2023, 06:25",
      "summary": "This song serves as the second collaboration between South Florida rappers XXXTENTACION and wifisfuneral, the first being X’s remix of wifi’s “Don’t Test Me”. This track was planned to be a part of X’s mixtape ItWillAllBeOverSoon, until it was scrapped. The unfinished mixtape was instead turned into a four-track EP, titled ItWasntEnough.\n\nIn this song, X and Wifi rap over a melancholy, calming beat — which X calls “weird as fuck”, about their egos and how deranged they actually are. <a href=\"http://www.last.fm/music/XXXTENTACION/_/MANIKIN+(Feat.+wifisfuneral)\">Read more on Last.fm</a>.",
      "content": "This song serves as the second collaboration between South Florida rappers XXXTENTACION and wifisfuneral, the first being X’s remix of wifi’s “Don’t Test Me”. This track was planned to be a part of X’s mixtape ItWillAllBeOverSoon, until it was scrapped. The unfinished mixtape was instead turned into a four-track EP, titled ItWasntEnough.\n\nIn this song, X and Wifi rap over a melancholy, calming beat — which X calls “weird as fuck”, about their egos and how deranged they actually are. They interpolate their descriptions of rape, murder, and drug abuse to emphasize that they have no emotions, similar to a mannequin.\n\nIt was announced on the 12th of July 2020 that this track would be re-released on streaming platforms like Spotify, Apple Music and TIDAL on the 17th of the same month. <a href=\"http://www.last.fm/music/XXXTENTACION/_/MANIKIN+(Feat.+wifisfuneral)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}