{
  "track": {
    "name": "Relationship (feat. Future)",
    "url": "https://www.last.fm/music/Young+Thug/_/Relationship+(feat.+Future)",
    "duration": "215000",
    "streamable": {
      "#text": "0",
      "fulltrack": "0"
    },
    "listeners": "319064",
    "playcount": "3296762",
    "artist": {
      "name": "Young Thug",
      "mbid": "800760de-bdf8-43a2-8fe0-44a2401a5515",
      "url": "https://www.last.fm/music/Young+Thug"
    },
    "album": {
      "artist": "Young Thug",
      "title": "Beautiful Thugger Girls",
      "url": "https://www.last.fm/music/Young+Thug/Beautiful+Thugger+Girls",
      "image": [
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/34s/59cb61ae0221a38c0b5fbb44df7fdecb.png",
          "size": "small"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/64s/59cb61ae0221a38c0b5fbb44df7fdecb.png",
          "size": "medium"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/174s/59cb61ae0221a38c0b5fbb44df7fdecb.png",
          "size": "large"
        },
        {
          "#text": "https://lastfm.freetls.fastly.net/i/u/300x300/59cb61ae0221a38c0b5fbb44df7fdecb.png",
          "size": "extralarge"
        }
      ]
    },
    "toptags": {
      "tag": []
    },
    "wiki": {
      "published": "06 Dec 2019, 04:14",
      "summary": "“Relationship” sees Thugger and Future croon over an instrumental reminiscent of early 2000s R&B and brag about their relationships with different women.\n\nThis song is their second collaboration since Young Thug and Future’s beef which began in November of 2015 when producer Metro Boomin sent out a series of tweets that stated Future started the trend of releasing multiple mixtapes per year, and that other artists should focus on dropping one good project. <a href=\"http://www.last.fm/music/Young+Thug/_/Relationship+(feat.+Future)\">Read more on Last.fm</a>.",
      "content": "“Relationship” sees Thugger and Future croon over an instrumental reminiscent of early 2000s R&B and brag about their relationships with different women.\n\nThis song is their second collaboration since Young Thug and Future’s beef which began in November of 2015 when producer Metro Boomin sent out a series of tweets that stated Future started the trend of releasing multiple mixtapes per year, and that other artists should focus on dropping one good project. Young Thug, who already released multiple mixtapes that year, believed the tweets were directed at him, and sent multiple shots at Metro. Future also took to Twitter that night with a tweet that many believed was directed towards Thugger.\n\nAnother Twitter battle took place between Thug and Future hours before the release of Future’s album EVOL. In September of 2016, Thug publicly apologized to Future, officially squashing their beef. They recently collaborated on the DJ Esco track, “Who”.\n\nThis song’s production is handled by BL$$D, producer of the hit song Rolex, and Billboard Hitmakers, a production group who assisted with many of the tracks on Young Thug’s last mixtape Jeffery. <a href=\"http://www.last.fm/music/Young+Thug/_/Relationship+(feat.+Future)\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."
    }
  }
}